[
   {
      "id":"akuoumaru",
      "name":"Akuoumaru",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Watatsumi Wavewalker",
      "abilityDescription":"For every point of the entire party's combined maximum Energy capacity, the Elemental Burst DMG of the character equipping this weapon is increased by 0.12/0.15/0.18/0.21/0.24%. A maximum of 40/50/60/70/80% increased Elemental Burst DMG can be achieved this way.",
      "description":"The beloved sword of the legendary \"Akuou.\" The blade is huge and majestic, but is surprisingly easy to wield.",
      "lore":"This blade was once used by a mighty general of Watatsumi.\nIt is said that he only knew as much of swordsmanship as the \"Getsumouun\" and \"Yuushio\" styles he taught himself,\nAnd yet by their grace was he never vanquished by any mortal in a duel or on the field of battle.\n\nIt is often said that snakes and fish are both cold-blooded. But cold-blooded creatures ever seek the promised land of warmth.\nTo see his people's dreams fulfilled, Omikami challenged the gathering storm clouds to war.\nAmongst the people of Watatsumi bent upon conquest, a young man stood out from the rest.\nHis fearless valor won him great love in Watatsumi, and they named him Touzannou.\nBut after many years passed, his kingly name was forgotten, only to be replaced by the epithet by which his foes knew him:\n\"Akuou,\" the wicked fangs and claws of the Great Serpent, the savage, demonic invader of Yashiori Island...\n\nThe slaughter had hardened the young man into a warrior. But to him,\nOnly the wish he made before departing, a wish made upon the moon reflected in the waters beside the shrine, was eternal.\n\n\"One day, I shall set myself above Mt. Yougou, overlooking the palace of the Lord of Thunder.\"\n\"I will have a joyful showdown against the legendary Great Tengu of Yougou upon the roof of Tenshukaku.\"\n\"...And then I'll bring that tengu's mask back to Ayame and Mouun as a souvenir!\"\n\nAt last, the tides washed all their dreams away like towers in the sand.\nThe tengu's mask, shining like a crimson star, was shattered like seashore gravel amidst the chaotic battle,\nNor would the shrine maiden who shone like moonlight into the young man's soul ever return again,\nWhile the Akuou himself would face the blinding ray of lightning alongside the Great Serpent. ",
      "image":"https://impact.moe/assets/img/weapon-icons/akuoumaru.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id": "kaguras-verity",
      "name": "Kagura's Verity",
      "type": "Catalyst",
      "rarity": 5,
      "baseAtk": 608,
      "subStatType": "CRIT DMG",
      "subStat": 66.2,
      "abilityName": "Kagura Dance of the Sacred Sakura",
      "abilityDescription": "Gains the Kagura Dance effect when using an Elemental Skill, causing the Elemental Skill DMG of the character wielding this weapon to increase by 24% for 16s. Max 3 stacks. This character will gain 24% All Elemental DMG Bonus when they possess 3 stacks.",
      "description": "The bells used when performing the Kagura Dance, blessed by the Guuji herself. The scent of the Sacred Sakura tree lingers on it.",
      "lore": "",
      "image": "https://i.ibb.co/YbrzCmT/image-2022-02-15-232051.png",
      "location": "Gacha",
      "stats": null

   },
   {
      "id":"alley-hunter",
      "name":"Alley Hunter",
      "type":"Bow",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"ATK %",
      "subStat":27.6,
      "abilityName":"Urban Guerrilla",
      "abilityDescription":"While the character equipped with this weapon is in the party but not on the field, their DMG increases by 2/2.5/3/3.5/4% every second up to a max of 20/25/30/35/40%. When the character is on the field for more than 4s, the aforementioned DMG buff decreases by 4/5/6/7/8% per second until it reaches 0%.",
      "description":"An intricate, opulent longbow. It once belonged to a gentleman thief who was never caught.",
      "lore":"This fine bow has been painted black, all the better to blend perfectly into the deepest night. This was once the first choice of an opulent noble house in their hunting games. Till one day, it fell into the hands of a gentleman thief who was never caught. Its user shot the crowns from the heads of nobles in utter silence. It shot through many a tightened bond, and disarmed many a pursuing soldier. It once vowed to bring light to a darkened age. To bring justice, riches and gladness to the oppressed. In the past, he did indeed bring justice, riches and gladness to the oppressed, and he brought fear unto those in power, giving them countless sleepless nights in their impotent rage. He brought light footsteps like rain to the roofs and terraces, and he brought song to the bards in the squares. He even once pried a sapphire from a noble's regalia to give to a blue-eyed witch, who hunted the vile with spear in hand. But even to the last, he was unable to bring a single smile to the lips of the witch whom his soul loved, who was as cold as the sapphire he gave her. In the end, seeking death, her flower-like face was marked with a criminal's brand, and none knew where she went thereafter. Abandoning his vow, he sailed into the ocean that belonged to no one. \"Pray tell, does she still recall my song? Does she remember those years that pursue me even now, of the wine-scented streets and the songs sung of her?\"",
      "image":"https://impact.moe/assets/img/weapon-icons/alley-hunter.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"amenoma-kageuchi",
      "name":"Amenoma Kageuchi",
      "type":"Bow",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"ATK %",
      "subStat":55.1,
      "abilityName":"Iwakura Succession",
      "abilityDescription":"After casting an Elemental Skill, gain 1 Succession Seed. This effect is triggered once every 5s. The Succession Seed lasts for 30s. Up to 3 Succession Seeds may exist simultaneously. After using an Elemental Burst, all Succession Seeds are consumed and after 2s, the character regenerates 6/7.5/9/10.5/12 Energy for each seed consumed.",
      "description":"A blade custom made for a famed samurai who could strike down a tengu warrior, known for their incredible agility, in midair.",
      "lore":"One of the \"kageuchi\" copies of the famed sword \"Hakuen Bankou Amenoma.\" It was gifted to the Saimon Clan by Douin, the founding patriarch of the Iwakura Clan. This gift was given in thanks for the care that he received from them when he was living in seclusion in Konda Village. \nIt is said that Iwakura's secret blade technique, Tengu Sweeper, can only be performed when there is not a single trace of confusion in one's heart. In the past, the name \"Tengu Sweeper' sounded the same as \"Tengu Victor,\" and it was a sword strike that could cut a Tengu soaring in the sky down. For centuries, the swordsmen of Iwakura, they who inherited the name \"In,\" would use this secret blade to destroy countless evils throughout the Inazuman archipelago. \nLegend has it that the Tengu Sweeper was first created in the courtyard of a small shrine where incense no longer burned. The technique was so powerful that it destroyed the building, and Iwakura Douin's sword was broken in two. After that, he founded the Iwakura Art with his swordsmanship skills and became the instructor of the Kujou Clan. He would also have the Amenoma master of that time craft the sword that would be passed down through the \"In\" line—the \"Hakuen Bankou Amenoma\" \nLegends abound concerning the deeds done using that blade. It is said that its edge was so sharp that it might even cut through mortal fate. As for the overly lengthy name, it is said that Iwakura Douin specified to Amenoma that it be called as such. \n",
      "image":"https://impact.moe/assets/img/weapon-icons/amenoma-kageuchi.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"amos-bow",
      "name":"Amos' Bow",
      "type":"Bow",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"ATK %",
      "subStat":49.6,
      "abilityName":"Strong-Willed",
      "abilityDescription":"Increases Normal Attack and Aimed Shot DMG by 12/15/18/21/24%. Increases DMG from arrows shot by a further 8/10/12/14/16% for every 0.1s that the arrow is in flight, up to 0.5s. Stacks up to 5 times on each arrow.",
      "description":"An extremely ancient bow that has retained its power despite its original master being long gone. It draws power from everyone and everything in the world, and the further away you are from that which your heart desires, the more powerful it is.",
      "lore":"In a barren ancient time, when the now-verdant land was still but a wasteland, a maiden, barefoot in the snow, followed the footsteps of the Lord of the Tower. He once was her love, but the unforgiving winds could never understand the softness of mortal flesh. He once was her foe, but her hunt was for more than simple vengeance. \"I dreamt of ocean waves and sand, of lush forests and land.\" \"I dreamt of boars playing in berry bushes, of a towering spire.\" These words she spoke to the God King in a soft tone, but they were left unheard. Awoken from blind love, she realized she was the only one who spoke with sincerity. For he spoke of love, but was only accompanied by razor winds. He looked down at the bent backs of his subjects in the howling wind, believing it to be a sign of their adoration and unwavering obedience. It was the era when the Tyrant of the North Wind warred with the Lord of the Tower. The huntress thought herself loved by the slavemaster. At the end of the war, and when the wind of resistance first blew, in the company of a nameless young man, elf, and knight, she scaled the towering spire and challenged the eccentric lord. \"Finally, I shall hold his gaze.\" But it was not until the moment when her arrow flew toward him, and when the piercing wind was about to rip her asunder, that she finally realized their distance apart.",
      "image":"https://impact.moe/assets/img/weapon-icons/amos-bow.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"apprentices-notes",
      "name":"Apprentice's Notes",
      "type":"Catalyst",
      "rarity":1,
      "baseAtk":185,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"Notes left behind by a top student. Many useful spells are listed, and the handwriting is beautiful.",
      "lore":"With words, this book records learning, experiments, and incantations.\nWith the spaces between words, it records a student's striving.",
      "image":"https://impact.moe/assets/img/weapon-icons/apprentices-notes.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"aquila-favonia",
      "name":"Aquila Favonia",
      "type":"Sword",
      "rarity":5,
      "baseAtk":674,
      "subStatType":"Physical DMG %",
      "subStat":41.3,
      "abilityName":"Falcon's Defiance",
      "abilityDescription":"ATK is increased by 20/25/30/35/40%. Triggers on taking DMG: the soul of the Falcon of the West awakens, holding the banner of the resistance aloft, regenerating HP equal to 100/115/130/145/160% of ATK and dealing 200/230/260/290/320% of ATK as DMG to surrounding enemies. This effect can only occur once every 15s.",
      "description":"The soul of the Knights of Favonius. Millennia later, it still calls on the winds of swift justice to vanquish all evil—just like the last heroine who wielded it.",
      "lore":"All knew the falcon's protection was a blessing of Favonius,\nFew knew the blessing of Favonius was from a distant tribe.\nUnder the tyranny of the old nobles, Mondstadt cried for freedom.\nEnslaved was the exiled foreign fighter in the land of the wind.\nYet she knelt not before injustice and deception, but set a shining example.\nFor she overthrew the barbaric nobles and established a chivalric order and the Church.\nBlessed was she to eventually walk with the gods.\nThis was the sword that witnessed all her hardships and feats.\nA testament to her achievement in spreading justice across Mondstadt.\nYou can feel her unrelenting spirit when swinging this sword:\nJustice for the pressed.\nFreedom for the shackled.\nWisdom for the deceived.\nLet the wind of justice and freedom lead.",
      "image":"https://impact.moe/assets/img/weapon-icons/aquila-favonia.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"beginners-protector",
      "name":"Beginner's Protector",
      "type":"Polearm",
      "rarity":1,
      "baseAtk":185,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"A polearm as straight as a flag pole. Well suited to most combat situations, it has an imposing presence when swung.",
      "lore":"In old Mondstadt, spear arts were forbidden by the nobility.\nOstensibly, they claimed that only the sword was worthy of noble stock,\nBut they say that in reality, it was because the length of polearms could bridge the gaps in training,\nWhich might grant the unarmed and unschooled commoners a weapon with which to resist.",
      "image":"https://impact.moe/assets/img/weapon-icons/beginners-protector.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"black-tassel",
      "name":"Black Tassel",
      "type":"Polearm",
      "rarity":3,
      "baseAtk":354,
      "subStatType":"HP %",
      "subStat":46.9,
      "abilityName":"Bane of the Soft",
      "abilityDescription":"Increases DMG against slimes by 40/50/60/70/80%.",
      "description":"An exceptionally powerful polearm that also offers a simple but elegant solution to the issue of the easily stained white tassel.",
      "lore":"One night, a Millelith officer drank with a poet, and brought his signature white-tasseled halberd with him.\nThe poet's ink was spilled.\nAnd the halberd's white tassel was dyed black.\n\"'Tis but a tale of polearm wielder and poet.\"\n\"Unrelated to mine own black—tasseled polearm.\"\nThe old smith smacked his apprentice.\nHe demanded he dye black the tassel for the newly made polearm.",
      "image":"https://impact.moe/assets/img/weapon-icons/black-tassel.webp",
      "location":"Gacha, NPC Orban",
      "stats":null
   },
   {
      "id":"blackcliff-agate",
      "name":"Blackcliff Agate",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"CRIT DMG %",
      "subStat":55.1,
      "abilityName":"Press the Advantage",
      "abilityDescription":"After defeating an enemy, ATK is increased by 12/15/18/21/24% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others.",
      "description":"A mysterious catalyst made of blackstone. It has an ominous crimson glow that seems to pulse in synchronization with the tremors from deep within the earth.",
      "lore":"A catalyst made from rare blackcliff. It glows when activated and cosmic energy circulates within.\nThe device is circular with a piece of blood-red Cor Purum fitted in the center. The Cor Purum seems to wax and wane like a crimson moon, growing steadily brighter and then steadily darker in a never-ending cycle.\n\n\"The myriad mountains of Tianheng are a trove of a thousand treasures, for deep within the rocks bounteous jade gleams gloriously.\" This is to say, mining prospered in Liyue under Rex Lapis' rule.\nOne by one the ore deposits in Mt. Tianheng and the surrounding area would run dry, and the miners would dig further. The result was a network of mine shafts stretching across the region in all directions. At their deepest point, the mines reached all the way to the earth's core.\nSlowly, the once-quiet region was beset by increasingly frequent disturbances. With a deep growl, the earth would tremble, causing landslides on the mountains and cave-ins in the mines.\nIn the night, the aggrieved souls of the innocent who died in the disasters could be heard wailing in the distance.\n\nThen one day, a stranger arrived at Mt. Qingce.\nThe stranger was dressed in a full-length gown and spoke in an esoteric and eloquent manner. He claimed to be a thaumaturge visiting Liyue on a quest to find two craftsmen by the names of Yun and Han.\nYun Huang, the first daughter of the Yun family, was then resident in Qingce Village. She immediately sent a messenger to fetch Han Ce, first son of master craftsman Han Wu.\nThe thaumaturge informed them both that in the past, the Yuns and Hans had jointly crafted a catalyst for the thaumaturges of the world.\nWith unrest now spreading through Liyue, the thaumaturges wished to provide the Yuns and Hans with a piece of crimson Cor Purum, in the hope that it might help the people of Liyue through this troubled time.\n\nOn receiving the message, Yun Huang and Han Ce lit the furnace at once and crafted a blackcliff catalyst with the crimson Pur Lapis as its core.\nThe crimson stone resonated with the ley lines of the earth. A blood-red glow would fade in and out as if to give forewarning of imminent tectonic activity.\nJust as the stars guide those who travel by night, so this catalyst was the light that gave safe passage to the people in Liyue through that tumultuous time of landslides and cave-ins. It was placed at the foot of Mt. Tianheng for all to see.\nWhen peaceful days finally returned, the Blackcliff Agate quietly disappeared without a trace, just as had faded the fury of the earth's core.",
      "image":"https://impact.moe/assets/img/weapon-icons/blackcliff-agate.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"blackcliff-longsword",
      "name":"Blackcliff Longsword",
      "type":"Sword",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"CRIT DMG %",
      "subStat":36.8,
      "abilityName":"Press the Advantage",
      "abilityDescription":"After defeating an enemy, ATK is increased by 12/15/18/21/24% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others.",
      "description":"A sword made of blackstone. It has a dark crimson glow on its black blade.",
      "lore":"A longsword wrought from a rare kind of stone known as \"blackcliff.\" Its sharp blade can cut through gold and jade with ease.\nOn a clear moonlit night a strand of dark crimson, about the length of an outstretched hand, becomes visible along the center of the blade.\nIts blood-red glow faintly flickers in the dark, as if the blade is howling out into the night, announcing its desire to tear through the earth.\nAfter designs for the new prototypes came into being, the master craftsman Han Wu overhauled his entire weapon catalog.\nThis particular design used a rare substance, crystallized blackcliff, to produce a superior-quality blade.\nWhen forging a blackcliff sword, subtle differences in temperature and in the type of water used for cooling can influence the final hardness and durability of the blade.\nThis presents a major challenge to manufacturers of blackcliff weaponry. But it is one that the bladesmith must overcome if he is to free himself from the shackles that bind him and reach new heights of competency in his trade.\nHan Wu struggled to see beyond the limits of his casting techniques. Thanks to a contact of his good friend in the house of Yun, he was able to go with a crew to the Chasm to personally procure the materials for his new weapon.\nBut a cave-in trapped the crew in the mine shaft for four days.\n\nImprisoned within the impenetrable rock walls of the cave, the crew found their mining tools to be of no use.\nDeprived of all the natural light and thus of all the knowledge as to the time of day, one by one the trapped crew succumbed to the madness and despair.\nJust when they thought all hope was lost, Han Wu thought he saw a faint flickering emanate from the corner of the cave, where lay the prototype sword he had brought with him into the mine.\nWith that sword he carved their way to freedom, and the survivors emerged from the pits of the earth into glorious bright sunlight.\nbut the moment that the first ray of sunlight made contact with the blade, it shattered into a million pieces.\nAll strength left the master craftsman's legs and he collapsed on the ground. Months later, he remade the sword and declared, \"This sword shall be named the Blackcliff Longsword, for it is made of blackcliff.\"\nAll who beheld the Blackcliff Longsword were bewitched by its beauty, spellbound by its sharpness, and transfixed by its tenacity. But the crew spoke not a word of what they had witnessed during their ordeal in the mine...\n\nDeep in the all-consuming darkness, when the master craftsman struck his blade against the cave wall with all his might, the sword released a deafening roar, like thunder sweeping across the plains. Perhaps the crew knew that the sword's cry was to foreshadow an earthquake years into the future...",
      "image":"https://impact.moe/assets/img/weapon-icons/blackcliff-longsword.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"blackcliff-pole",
      "name":"Blackcliff Pole",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"CRIT DMG %",
      "subStat":55.1,
      "abilityName":"Press the Advantage",
      "abilityDescription":"After defeating an enemy, ATK is increased by 12/15/18/21/24% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others.",
      "description":"A weapon made of blackstone and aerosiderite. There is a dark crimson glow on its cold black sheen.",
      "lore":"A sharp-tipped polearm wrought from rare blackcliff. It zaps through the air like lightning, unimpeded by the wind.\nMade in blackcliff crystal from head to tip, the body is inlaid with red jade stones for decoration.\nViewed in the moonlight, the swirling of blood-red light can be discerned within.\n\nLiyue master craftsman Han Wu had a son with his first wife. The son's name was \"Han Ce, the Cold and Calculating.\" Cold, because his father wished him to be cool-headed and rational. Calculating, because his father wished him to be precise in his craft, that he might inherit the family business.\nBut Han Ce had other ambitions. During his days as a student, Han Ce idled away his study time on martial arts fiction, while spending his free time practicing the art of the polearm up in the mountains. He was consumed by the desire to become a martial nomad, roaming the world with his pole for protection.\nWhen he scoured the lands in search of Aerosiderite, he sought not the rare ore itself but the thrill of adventure. And when he ascended the highest peaks to commune with the adepti, he desired not the wisdom of the sages but the tale of his travels.\nHan Ce cared not for the flames of the furnace and the working of weaponry. His father scolded him, but it was to no avail. Eventually, Han Ce left home one day without bidding his father farewell.\n\nIn his later years, Han Wu was involved in a mining accident that profoundly changed his temperament. Han Ce caught wind of the ordeal and hurried home to see his father, traveling through the night.\nPreviously hot-tempered and never short of something to say, Han Wu was now calm and quiet. He no longer held any animosity towards his son for his reluctance to take over the forge.\nFinally, the father and son grew close for the first time in their lives. Han Ce was ashamed of his past actions, but knew not how to redeem himself.\nSeveral years later, Han Wu breathed his last. Thus ended the life of a master craftsman of a generation. Per his father's will, Han Ce retrieved an archive of weapon designs from the study - they were the fabled prototypes.\nThe archive was sealed inside a wooden chest along with a letter addressed to Han Ce.\n\"To my dear son, Han Ce. The world is vast and filled with many marvels. May you always see the wonder in the world, wherever your journey takes you.\"\n\nThe designs were covered in comments penned by his father.\nHan Ce was overjoyed at the sight and proceeded to peruse them all night long.\nAs Han Ce stepped outside the door of the study at the first light of dawn, he watched in wonder as a meteorite fell from the sky. It crashed down right before him in front of the Han residence, landing perfectly vertical.\nA host of emotions flooded Han Ce's heart. Tears both of joy and sorrow streamed down his face as he cried, \"The heavens have spoken! The heavens have spoken!\"\nHan Ce took the pitch-black aerosiderite and added it to the blackcliff that remained in the forge. Following his late father's designs to the letter, he crafted a pointed pole with a sharp tip that shimmered like ice and a body hard as bedrock.\nHan Ce could have traveled the world with this trusty weapon in hand, but he chose not to. For Han Ce vowed that starting that day, never again would the flames of the furnace die out, and never again would the working of weaponry cease.",
      "image":"https://impact.moe/assets/img/weapon-icons/blackcliff-pole.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"blackcliff-slasher",
      "name":"Blackcliff Slasher",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"CRIT DMG %",
      "subStat":55.1,
      "abilityName":"Press the Advantage",
      "abilityDescription":"After defeating an enemy, ATK is increased by 12/15/18/21/24% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others.",
      "description":"An extremely sturdy greatsword from the Blackcliff Forge. It has a dark crimson color from the blade to the pommel.",
      "lore":"A broadsword wrought from rare blackcliff. Weighty as a boulder, it has enough brute force to carve its way through a mountain.\nThe blade is forged from a combination of blackcliff crystal and a crimson ore. It is pitch black like a pool of ink, with red flames leaping from within.\nBlackcliff weaponry has its roots in the ancient \"prototype\" series. Blackcliff blades possess three distinguishing features: hard as bedrock, shimmer like ice, fierce as the blood that gives us life.\nThough the Slasher is a broadsword, it has a uniquely sharp blade, barely thicker than a thread of silk.\nThe join between the red and black crystals is seamless, and each blade segment interlocks perfectly with the next to form a single cohesive body.\nWith the Pyro motif and red jade stones that adorn the hilt, the sword has a dark and foreboding presence when viewed from afar, like bright-red blood oozing from a bottomless pit of black ink.\nMaster craftsman Han Wu once embarked on a quest to find the finest ore with which to cast a blackcliff blade. He searched everywhere, until he became involved in a mining accident.\nWhile trapped in the cave, his eyes perceived nothing but an all-engulfing and profoundly disorienting darkness. His ears rang with the thunderous crashing of rocks, as if the foundations of the world itself were caving in.\nIn the aftermath of this ordeal, the craftsman's furnace lay unused. Where flames had once burned bright, frigid dust now gathered as the forgotten fantasies of the forge dwindled and died.\nHan Wu's son, Han Ce, read that the earth's core had been sealed off due to a monster infestation, and rushed to inform his father.\nHan Wu was racked with guilt upon hearing the news. He was certain that it was his trip into the mine that had disturbed the dragon from underground and the meteorite from the heavens.\nHe forced himself up from his sickbed, lit the fires of the furnace once more and forged a mighty broadsword.\nWhen it was ready, Han Ce took the sword into the mine shaft.\nThere, on instructions from his father, he erected a shrine as tall as himself and placed the sword inside to ward off evil and rebuke the dragon.\nHan Wu died peacefully in his sleep several years later.\nAt the moment of Han Wu's death, a traveler passing by the mine shaft at Mt. Tianheng saw a crimson light shining out from somewhere within the rocks. As the traveler watched on, a hidden shrine appeared and slowly opened.\nThe broadsword inside the shrine shone faintly, as if weeping with bereavement.\nHan Ce went into the mountains that very night to retrieve the blade.\nThe Tianshu of that age personally engraved an inscription upon the blade:\n\"Carves open mountains and tears through the seas, shreds apart clouds and splits the moon.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/blackcliff-slasher.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"blackcliff-warbow",
      "name":"Blackcliff Warbow",
      "type":"Bow",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"CRIT DMG %",
      "subStat":36.8,
      "abilityName":"Press the Advantage",
      "abilityDescription":"After defeating an enemy, ATK is increased by 12/15/18/21/24% for 30s. This effect has a maximum of 3 stacks, and the duration of each stack is independent of the others.",
      "description":"A bow made of blackstone that features extremely sturdy bow limbs. It requires an archer with a strong bow arm to use.",
      "lore":"A longbow made from rare blackcliff. Drawing the bow invokes a sound like the wind - a premonition of the final breeze for any target within 100 yards. With a jet-black body contrasted by blood-red ends, it's cold to the touch without being intimidating. A shot from this bow takes to the skies like a meteor, challenging both wind and thunder. The house of Yun has long since established itself in Liyue as a family of craftsmen. At the time of this bow's inception, the seventh head of the house, Hui, was well-renowned as a member of the Qixing. Yun Hui had but one child, a daughter, by the name of Huang. As per family custom, should she marry, her husband would take over as head of the house. Having been raised by an unyielding martial artist, Huang refused to take this path, and instead took over as the daughter she was, inciting endless gossip amongst the people. But Yun Huang took control at a hard time. The continent was troubled. Even the loftiest of peaks and deepest of caves collapsed to a symphony of low roars. The bouny of the earth beneath them became almost unreachable, threatening to bring an end to the legacy of their craft. One night Yun Huang lay awake unable to sleep, tortured by her worries that her family's name would end with her. Amidst the sorrow that enveloped her, she could do naught but call upon the heavens and pray for celestial intervention in her desperate situation. It was then that Han Ce, who had long since abandoned his family business and wandered the continent, arrived in the village in his craftsman's attire. He handed Huang a small wooden box, within which were the prototype plans his father had revised in his later years. He also took out a bow and said: \"As the issue arose from Blackcliff, so too shall it end by Blackcliff. It is said that the house of Yun appreciates archery. Should it please you, give this bow a try.\" Huang fired an arrow into the sky. It roared across the heavens like angry thunder, as the sound of the bowstring being released reverberated throughout the mountains. As she watched the clouds flow beneath the moon, she knew that her prayer had been answered.",
      "image":"https://impact.moe/assets/img/weapon-icons/blackcliff-warbow.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"bloodtainted-greatsword",
      "name":"Bloodtainted Greatsword",
      "type":"Claymore",
      "rarity":3,
      "baseAtk":354,
      "subStatType":"Elemental Mastery",
      "subStat":187,
      "abilityName":"Bane of Fire and Thunder",
      "abilityDescription":"Increases DMG against enemies affected by Pyro or Electro by 12/15/18/21/24%.",
      "description":"A steel sword that is said to have been coated with dragon blood, rendering it invulnerable to damage. This effect is not extended to its wielder, however.",
      "lore":"Legend says that after slaying the venomous dragon, The famed hero bathed in its blood, for he desired invulnerability. Sure enough, he became untouchable. Be it swords, be it spears, or be it rain of arrows, He laughed and shrugged them off. Alas, his foes learned, 'Twas with his prized greatsword that he bathed together. His greatest strength became his fatal weakness.",
      "image":"https://impact.moe/assets/img/weapon-icons/bloodtainted-greatsword.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id": "calamity-queller",
      "name": "Calamity Queller",
      "type": "Polearm",
      "rarity": 5,
      "baseAtk": 741,
      "subStatType": "ATK %",
      "subStat": 16.5,
      "abilityName": "Extinguishing Precept",
      "abilityDescription": "Gain 24% All Elemental DMG Bonus. Obtain Consummation for 20s after using an Elemental Skill, causing ATK to increase by 6.4% per second. This ATK increase has a maximum of 6 stacks. When the character equipped with this weapon is not on the field, Consummation's ATK increase is doubled.",
      "description": "A keenly honed weapon forged from some strange crystal. Its faint blue light seems to whisper of countless matters now past.",
      "lore": "They say that this long polearm was forged using materials that are not from this world. The weapon has passed through the hands of many loyal yet unfortunate souls. It has seen many a slaughter begin and end, and tasted many a foul beast's flesh and blood. It is said that a person whose job was to exorcise evil once came to the great chasm of crystal sands. There, they retrieved an ominous, aqua-colored crystal from its depths. Then, they hired someone to forge it into a weapon, naming it \"Calamity Queller.\" \"If disaster should befall, this shall surely be used to calm it.\" The tribespeople who made their living in the craggy mountains were not partial to either boasts or critique. But since there was no contract signed, and such words were of no cost, they accepted them all the same. Later, the time came when the monstrous tides scaled the bedrock, turning the cinnabar-colored earth black. The shield-wall of the Millelith and the dark forces clashed, and any stragglers were all slain. Like a cold star amidst the gloom, Calamity Queller flashed this way and that at the heart of the maelstrom...When, at last, the light of the setting sun split the mournful clouds, the dark sludge sunk back into the depths of the chasm. The Calamity Queller was also lost, together with the Yaksha who wielded it — both returned to silence. In times thereafter, those who wielded this spear would largely meet similar fates. But there were people who would fight without requiring orders or protect people without taking any oaths. For them, such a fate was hardly one to be lamented...It is also said that this spear was once borrowed from someone. And in a deserted, water-eroded cave, it would bear witness to a clash between intimate friends.",
      "image": "https://static.wikia.nocookie.net/gensin-impact/images/8/8b/Weapon_Calamity_Queller.png/revision/latest/scale-to-width-down/256?cb=20220105045145",
      "location": "Gacha",
      "stats": null
   },
   {
      "id":"cinnabar-spindle",
      "name":"Cinnabar Spindle",
      "type":"Sword",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"DEF %",
      "subStat":69,
      "abilityName":"Spotless Heart",
      "abilityDescription":"Elemental Skill DMG is increased by 40/50/60/70/80% of DEF. The effect will be triggered no more than once every 1.5s and will be cleared 0.1s after the Elemental Skill deals DMG.",
      "description":"A sword made from materials that do not belong in this world. The power within might even be able to withstand the corruption of a venom that could corrode a mighty dragon.",
      "lore":"Separate the dust in the flames with joy, and extract the exquisite from the crude.\n\nFor all in the universe comes from a single source, and all things may be derived from a single thought.\n\nYou must pursue that which your elder brother, the one-horned white horse, could not accomplish.\n\nReach the far side of philosophy, and create a new destiny for myself and your brothers... ",
      "image":"https://impact.moe/assets/img/weapon-icons/cinnabar-spindle.webp",
      "location":"Limited-Time Event",
      "stats":null
   },
   {
      "id":"compound-bow",
      "name":"Compound Bow",
      "type":"Bow",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"Physical DMG %",
      "subStat":69,
      "abilityName":"Infusion Arrow",
      "abilityDescription":"Normal Attack and Aimed Shot hits increase ATK by 4/5/6/7/8% and Normal Attack SPD by 1.2/1.5/1.8/2.1/2.4% for 6s. Max 4 stacks. Can only occur once every 0.3s.",
      "description":"An exotic metallic bow from a distant land. Though extremely difficult to maintain, it is easy to nock and fires with tremendous force.",
      "lore":"The whole world flocks to the commercial port of Liyue, much to the city's pride. With the tides of people also come exotic treasures. This compound bow may be small in size, but its unique design and superior craftsmanship have made it more destructive than most common longbows. It is also harder to maintain than other bows. For it is not merely a weapon, but the culmination of the wisdom of a foreign kingdom. Made by a foreign scholar, this compound bow has been modified with a pulley. The scholar had no heart for violence, and bore no desire to see blood drawn. But mesmerized by the curve of the drawn bow, and the quiver of arrows in flight, He was driven to transform the compound bow and make it more powerful. The scholar knew from the onset of his endeavor what his creation would become - a tool of war, that would bring nothing but death. But he was lost in his pursuit to perfect both structure and materials, And there was to be no stopping him as he fled this reality. Though one day the bow was taken up by a soldier, who promptly shot down a wilde goose. \"This is the bow I seek\" Said the heartless soldier, commending the weapon in his hands, As the final cry of the bird he had murdered pierced his heart, just as his arrow had pierced the bird's.",
      "image":"https://impact.moe/assets/img/weapon-icons/compound-bow.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"cool-steel",
      "name":"Cool Steel",
      "type":"Sword",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"ATK %",
      "subStat":35.2,
      "abilityName":"Bane of Water and Ice",
      "abilityDescription":"Increases DMG against enemies affected by Hydro or Cryo by 12/15/18/21/24%.",
      "description":"A reliable steel-forged weapon that serves as a testament to the great adventures of its old master.",
      "lore":"A sturdy steel sword forged by the method of folding.\nIt has a dull shine with a cold glimmer.\nIt belonged to a famous adventurer who witnessed the vastness of the earth.\nWith it, he severed the iron bones of monsters and crossed blades with bandits.\nBut in the end,\nHe gave up the vast earth, the boundless sky,\nHis friends in the Guild, his trusty Cool Steel, and old pals, to be with the girl he loved.",
      "image":"https://impact.moe/assets/img/weapon-icons/cool-steel.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"crescent-pike",
      "name":"Crescent Pike",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Physical DMG %",
      "subStat":34.5,
      "abilityName":"Infusion Needle",
      "abilityDescription":"After picking up an Elemental Orb/Particle, Normal and Charged Attacks deal an additional 20/25/30/35/40% ATK as DMG for 5s.",
      "description":"An exotic weapon with an extremely long blade on the top and a crescent blade at the bottom. It found its way into Liyue through foreign traders. With practice, it can deal heavy damage.",
      "lore":"The whole world flocks to the commercial port of Liyue, much to the city's pride.\nWith the tides of people also come exotic treasures.\nThis spearhead is long and narrow like a needle, with a crescent-shaped blade extending from its base.\nOnce the bearer has grasped its elusive design concept, this weapon becomes far more destructive than its counterparts.\n\nUnlike the martial artists of Liyue, those from other lands are masters of the art of surprise, skilled at developing ingenious new tricks.\nThis weapon is designed to exploit fatal flaws. Like a needle, it slips between the gaps in an opponent's armor. Like the powers of music and love, it finds its way past people's defenses.\n\nThe designer of the Crescent Pike was said to be able to visualize the fatal flaws in life itself.\nAs if drawn by some mystical power, the pike would fly from her hand toward her opponents' fatal flaws.\n\"Perhaps all that lives waits willingly for death.\"\nSo thought the designer, who could see that which was fatally undefended in each living thing, yet had no such fatal flaws in her own life.\n\nThen she found music, and through music found love. And in love, she found her own fatal flaw.\nIn the end, the pain of finality, which pierced her heart like a needle, finally brought the witch to a realization:\n\"Fatal flaws are born of a fear of death. Fear of death is born of having things, and people, to care about.\"\n\n\"Oh, how I wish to see him but one more time, that thief who can neither be caught nor killed.\"\n\"Oh, how I wish to hear his song but one more time. If I should survive, I shall certainly treat him—\"",
      "image":"https://impact.moe/assets/img/weapon-icons/crescent-pike.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"dark-iron-sword",
      "name":"Dark Iron Sword",
      "type":"Sword",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"Elemental Mastery",
      "subStat":141,
      "abilityName":"Overloaded",
      "abilityDescription":"Upon causing an Overloaded, Superconduct, Electro-Charged, or an Electro-infused Swirl reaction, increases Base ATK by 20/25/30/35/40% for 12s.",
      "description":"A perfectly ordinary iron sword, just slightly darker than most.",
      "lore":"\"Why is your sword lying on the ground?\"\n\"I'm sun-tanning the sword to make it darker.\"\n\"Why?\"\n\"Good question, kid. What's the darkest thing you can think of?\"\n\"Crows?\"\n\"...Sure. What else?\"\n\"Hm... Cooking pots!\"\n\"Good. Keep going. What's underneath the cooking pot?\"\n\"Fire!\"\n\"And where does the fire come from?\"\nThe girl thought for a bit.\n\"Coal! Coal is the darkest thing of all!\"\n\"That's right! Coal, or carbon, is what makes iron stronger. But I figure I can just darken the sword by tanning it instead.\"\nWith that, he flipped the sword to the other side.",
      "image":"https://impact.moe/assets/img/weapon-icons/dark-iron-sword.webp",
      "location":"NPC: Chen the Sharp",
      "stats":null
   },
   {
      "id":"deathmatch",
      "name":"Deathmatch",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"CRIT Rate %",
      "subStat":36.8,
      "abilityName":"Gladiator",
      "abilityDescription":"If there are at least 2 opponents nearby, ATK is increased by 16% and DEF is increased by 16%. If there are less than 2 enemies nearby, ATK is increased by 24%.",
      "description":"A sharp crimson polearm that was once a gladiator's priceless treasure. Its awl has been stained by the blood of countless beasts and men.",
      "lore":"This crimson polearm has seen countless battles, and has borne witness to a certain gladiator's valor. Its ice-cold tip was often drenched in the blood of its foes, to the thunderous applause of the crowd. Bloodstained was the gladiator's fate, and freedom, so near yet so far, was often balanced on a knife's edge. The dull sound of that crimson tip piercing flesh was many a battle's death-knell. As the gladiator's final ended, their master spoke up amidst the thunderous applause: \"The promised number has been met. You have done well, and are a warrior worthy of great renown.\" \"Consider this weapon to be a parting gift... Yet, would you not consider fighting on?\" \"Continue your brilliant performance as a free person, for your glory and for mine. What say you?\" Many years past, and the beasts and men who fell to that spear grew too numerous to count. The duelist's weapon became known as undefeated, but his heart belonged to his young master. As the gladiator's final performance ended, amidst thunderous applause, His weapon fell to the bloodied sand as the red-haired maiden's scorching blade pierced the old warrior's heart. As he fell, despondent, he turned his eyes to his beloved master, his noble lord who cherished him... \"Eberhart, Master Eberhart... Did my final performance please you?\" But his master's seat was empty, save for a wine goblet and silver platter, toppled in haste. \"At first, I fought for myself, for blood and battle-lust.\" \"But since a time I know not when, I have killed for my master.\" \"Only for the sake of others can we fight like wild beasts without care.\" \"Someone like you, who fights for her people and not for herself... Surely, you understand this as well.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/deathmatch.webp",
      "location":"BP Bounty",
      "stats":null
   },
   {
      "id":"debate-club",
      "name":"Debate Club",
      "type":"Claymore",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"ATK %",
      "subStat":35.2,
      "abilityName":"Blunt Conclusion",
      "abilityDescription":"After using an Elemental Skill, Normal or Charged Attacks, on hit, deal an additional 60/75/90/105/120% ATK DMG in a small area. Effect lasts 15s. DMG can only occur once every 3s.",
      "description":"A handy club made of fine steel. The most persuasive line of reasoning in any debater's arsenal.",
      "lore":"A persuasive tool, sure to turn the tide of a heated argument in the wielder's favor. Guaranteed to add weight to one's words.\nUseful in any argument, no matter who the opponent, to convince them to listen to reason.\nIn short, people listen to pearls of wisdom.\nUltimately, production was forcibly ended due to mass protests. The needs of the many outweigh the needs of the one.",
      "image":"https://impact.moe/assets/img/weapon-icons/debate-club.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"dodoco-tales",
      "name":"Dodoco Tales",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"ATK %",
      "subStat":55.1,
      "abilityName":"Dodoventure!",
      "abilityDescription":"Normal Attack hits on opponents increase Charged Attack DMG by 16/20/24/28/32% for 6s.\nCharged Attack hits on opponents increase ATK by 8/10/12/14/16% for 6s.",
      "description":"A children's book in a resplendent cover, filled with silly short stories at which one cannot help but laugh.",
      "lore":"Legend has it that there is a group of islands somewhere far away in the middle of a foggy sea, and this place is called the Golden Apple Archipelago.\nThey say that the cute and peace-loving Dodo Clan lives together on the many islands, and they have no troubles with the rest of the world.\nThe Dodo Clan are kind and playful creatures, and they love to tease each other and play with each other, and none of them ever get bored or sad.\n\"Dodoco!\" they all call each other, and that means \"the best of friends!\"\n\nBut just as dandelion seeds will one day leave the embrace of their stalk and go with the wind, every Dodoco will one day ride the wind and the waves, and travel to the wider world on an adventure, searching for a four-leaf clover.\nWhy must they do this?\nIt's because, having lived for a long time on the Golden Apple Archipelago, the Dodocos can no longer recognize each other. They're all \"Dodocos,\" and they all look the same, after all! So there's no \"you\" or \"me\" for them at all!\nBut only the red, blazing four-leaf clover can let them know the true meaning of \"Dodoco\" and tell each other apart, thus allowing them to play freely with all their friends!\n...At least, that's what my mom says, and she can do just about aaaanything!\nSo, in order to understand what makes a true \"Dodoco,\" they leave their good friends and go to faraway places to make new good friends and become their \"Dodoco,\" too!\nThey'll see all kinds of nice things, hear all kinds of interesting stuff, meet lots of friends... and one day, when their friends are looking at them, at a time when no one expects it — that's when the blazing, sparkling four-leaf clover will appear!\n\nAnd that's why when a furry Dodoco from the Golden Apple Archipelago tumbles into the sea or leaps into the wind before drifting far, far away, that means that a lucky child is about to meet their bestest friend ever!\nThis small, precious book was given by the freest mother in the world to the luckiest daughter in the world. It chronicles the countless adventures that Dodoco had before meeting her, and the adventures that she and Dodoco have had since — bigger and better adventures filled with sparks, splashes, treasures, and lots of friends!",
      "image":"https://impact.moe/assets/img/weapon-icons/dodoco-tales.webp",
      "location":"Midsummer Island Adventure Event",
      "stats":null
   },
   {
      "id":"dragons-bane",
      "name":"Dragon's Bane",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"Elemental Mastery",
      "subStat":221,
      "abilityName":"Bane of Flame and Water",
      "abilityDescription":"Increases DMG against enemies affected by Hydro or Pyro by 20/24/28/32/36%.",
      "description":"A polearm decorated with an entwining golden dragon. Light and sharp, this weapon may very well kill dragons with ease.",
      "lore":"Rumored to be a legendary polearm of Liyue.\nThe polearm features a dragon motif that runs from handle to tip.\nIt used to have a dragon-shaped wooden sheath,\nbut now it no longer needs to contain its might.\nIt shall pierce through anything that stands in its way.\n\nIt is said that when Kunwu forged this Pole, he used a dragon's spine for the haft and a dragon's claw for the tip.\nHence the weapon's body is unbreakable, while its tip is sharp beyond compare — and gleams with a dragon's malice.\n\nThere once was a dragon slayer of unimaginable strength and courage, who defied the ocean's wrath and fought fiercely against the monstrosities it harbored within.\nMany years after the dragon slayer had disappeared without a trace, the hopeless sound of a dragon's cry could still be heard resounding throughout the ocean.\n\nThe dragon slayer became an urban legend. In the end, both the legend and the dragon-slaying Pole were lost.\nFreed at last from the shackles of its past, it displayed the full force of its ferocity once and for all, as if to mark the dragon's return to the ocean where it belonged.",
      "image":"https://impact.moe/assets/img/weapon-icons/dragons-bane.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"dragonspine-spear",
      "name":"Dragonspine Spear",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"Physical DMG %",
      "subStat":69,
      "abilityName":"Frost Burial",
      "abilityDescription":"Hitting an opponent with Normal and Charged Attacks has a 60/70/80/90/100% chance of forming and dropping an Everfrost Icicle above them, dealing 80/95/110/125/140% AoE ATK DMG. Opponents affected by Cryo are dealt 200/240/280/320/360% ATK DMG. Can only occur once every 10s.",
      "description":"A Spear created from the fang of a dragon. It is oddly warm to the touch.",
      "lore":"He had a very, very long dream...\n\nHe dreamed that he and everyone else had gone on a long, long journey,\nInto a land where green grass grew, and where soulful songs were sung.\nHe dreamed that he sang along with the gentle people of this land,\nAnd danced in the skies with a dragon as beauteous as a jewel.\n\nWhen he opened his eyes, he was in the sky above a mountain swept by roaring snowstorms.\nThe green, tranquil land had already been painted crimson by fire and blood,\nAnd the song of that sky-blue bard's lyre was almost drowned in the howling tumult.\nAnd that bejeweled, lovely dragon, like a tender lover,\nHad now pierced his neck through with its sharp fangs.\n\n\"Farewell, Mother! My journey is ended.\"\n\"I shall sleep beneath this white, shining silver... and perhaps this, too, is good.\"\n\"Farewell, O lovely bard! And farewell, O lovely dragon!\"\n\"Would that we had met in a different time and place,\"\n\"To meet, to song and dance together!\"\nSo he thought most sincerely as he lay dying.\n\n\"Now then, this great blessing that pulses through my veins,\"\n\"And lovely sight of the dark universe that gave me birth...\"\n\"They are now yours to inherit.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/dragonspine-spear.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"dull-blade",
      "name":"Dull Blade",
      "type":"Sword",
      "rarity":1,
      "baseAtk":185,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"Youthful dreams and the thrill of adventure. If this isn't enough, then make it up with valiance.",
      "lore":"Travels are full of meetings and partings. Perhaps the only trusty and inseparable companions of a Traveler, are the sword in their hand and the dream in their heart.",
      "image":"https://impact.moe/assets/img/weapon-icons/dull-blade.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"elegy-for-the-end",
      "name":"Elegy for the End",
      "type":"Bow",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"Energy Recharge %",
      "subStat":55.1,
      "abilityName":"The Parting Refrain",
      "abilityDescription":"A part of the \"Millennial Movement\" that wanders amidst the winds. Increases Elemental Mastery by 60/75/90/105/120. When the Elemental Skills or Elemental Bursts of the character wielding this weapon hit opponents, that character gains a Sigil of Remembrance. This effect can be triggered once every 0.2s and can be triggered even if said character is not on the field. When you possess 4 Sigils of Remembrance, all of them will be consumed and all nearby party members will obtain the \"Millennial Movement: Farewell Song\" effect for 12s. \"Millennial Movement: Farewell Song\" increases Elemental Mastery by 100/125/150/175/200 and increases ATK by 20%/25%/30%/35%/40%. Once this effect is triggered, you will not gain Sigils of Remembrance for 20s. Of the many effects of the \"Millennial Movement,\" buffs of the same type will not stack.",
      "description":"A bow as lovely as any bard's lyre, its arrows pierce the heart like a lamenting sigh.",
      "lore":"\"The west wind bears wine's fragrance away,\"\n\"The mountain wind brings glad tidings new.\"\n\"The breeze from afar tugs at my heart,\"\n\"It sings of my longing for you.\"\n\nLong ago, there was a knight who was ever dour of countenance.\nOnly a certain song could ever cause his brow to unfurl,\nAnd only a certain girl who sang that song in the square,\nCould cause him to forget the great burden of his duty for a time.\n\nBut at last, calamity came upon this land.\nThe songs that had once flown joyfully in the wind were drowned by a venomous dragon.\nIn the wake of its earth-shaking footsteps, even the cries and the flames were ripped asunder.\nThe Anemo Archon heard their agony, though he had refused to rule.\nBut to protect his old friends' dream, and defend the wind-kissed fields of green,\nHe woke from his long slumber anew, and with the sky dragon in battle he flew...\nThe Knight and his knights also fought for their land.\n\nWhen the venomous dragon fell to ruin on the ice-sealed peak, the blue sky dragon fell asleep in the ancient tower.\nBut the Knight was in the valley, spent of his life's blood, and as he fell, he could only think thus:\n\"She is abroad studying, so she should be well. But ah, how I wish to hear her sing again.\"\n\"At least Arundolyn and Roland are alright. When she returns, this calamity should have blown over.\"\n\nThe songs in praise of the archon and tunes that recorded the battle of the two dragons were many, but all slowly became lost.\nThe song the girl loved to sing, too, changed upon her return.\n\"The dandelions carry in the summer wind,\"\n\"Autumn brings the fragrance of grain.\"\n\"But no wind in any season on earth\"\n\"Shall have you gaze upon me again.\"\n\nAnd after her voice and her tears had run dry, the girl swore to use her life's flame to cleanse the world's crookedness.",
      "image":"https://impact.moe/assets/img/weapon-icons/elegy-for-the-end.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"emerald-orb",
      "name":"Emerald Orb",
      "type":"Catalyst",
      "rarity":3,
      "baseAtk":448,
      "subStatType":"Elemental Mastery",
      "subStat":94,
      "abilityName":"Rapids",
      "abilityDescription":"Upon causing a Vaporize, Electro-Charged, Frozen, or a Hydro-infused Swirl reaction, increases Base ATK by 20/25/30/35/40% for 12s.",
      "description":"A catalyst carved out of the hard jade from Jueyun Karst north of Liyue. Small, light, and durable, it is known more colloquially as the \"jade ball.\"",
      "lore":"A lightweight catalyst carved out of emerald-green jade. It is durable and affordable, which makes it a popular item all around.\nSmall but exquisitely made, it is referred to by the people of Liyue as the \"jade ball.\"\nIt is a highly efficient defensive Catalyst as well as a good-looking accessory.",
      "image":"https://impact.moe/assets/img/weapon-icons/emerald-orb.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"engulfing-lightning",
      "name":"Engulfing Lightning",
      "type":"Polearm",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"Energy Recharge %",
      "subStat":55.1,
      "abilityName":"Timeless Dream: Eternal Stove",
      "abilityDescription":"ATK increased by 28/35/42/49/56% of Energy Recharge over the base 100%. You can gain a maximum bonus of 80/90/100/110/120% ATK. Gain 30/35/40/45/50% Energy Recharge for 12s after using an Elemental Burst.",
      "description":"A naginata used to \"cut grass.\" Any army that stands before this weapon will probably be likewise cut down...",
      "lore":"The naginata was a lethal weapon by which scattered dross might be cut away. And the one who wielded that naginata was one who guarded the path to eternity.\n\nWhen the one who stood high above the storm clouds looked upon the mortal world, which she so loved, Seeing their shallow disputes and transient obsessions... Such contentions stemmed from needless attachments and unchecked desire — both enemies of eternity. The wild weeds that disturbed the unchanging world would be swept away by the lightning.\n\n\"Well then — what sort of Eternity would ██'s eyes reflect?\" So asked the clergyperson who sloshed and drank wine with her under the sakura tree in that still-clear memory.\n\nWhat a pointless question. Though the answer she gave them was lost to the alcohol, She had gained the answer countless times in those memories. One must thin fruits to improve their quality, and plants used in dyes must have their flowers pruned. Not a signle speck of dross could be permitted in an eternal paradise.\n\n\"Ah, but even so...\" \"Using that great blade of light to uproot all obsession and to eliminate the possibility for dreams to take root and wither by themselves...\" \"A tranquil world that brooks no dispute, no gain, or no loss... It shall be an amnesiac world, lost to itself.\" In the heart of eternity, that old friend is still so clear, the scent of the sakura so fresh, as if it were in the present.\n\nBut I will never forget you, just as I will not forget the things that were lost across the years. After all...\n\nHaving witness the pitch-dark annihilation consume those precious to her, How could she not see the absurd nature of life and death, yes, incomprehensible destiny itself, as her mortal foe? But since no one can overturn the impermanence of the world, and the barren nature of this game, Then let the eternal euthymia within her heart carry forth into the nation she loves. ",
      "image":"https://impact.moe/assets/img/weapon-icons/engulfing-lightning.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"everlasting-moonglow",
      "name":"Everlasting Moonglow",
      "type":"Catalyst",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"HP %",
      "subStat":49.6,
      "abilityName":"Byakuya Kougetsu",
      "abilityDescription":"Healing Bonus increased by 10/12.5/15/17.5/20%, Normal Attack DMG is increased by 1/1.25/1.5/1.75/2% of the Max HP of the character equipping this weapon. For 12s after using an Elemental Burst, Normal Attacks that hit opponents will restore 0.6 Energy. Energy can be restored this way once every 0.1s.",
      "description":"A string of lovely jasper from the deep sea. It shines with a pure radiance like that of the moon, and just as ever-distant.",
      "lore":"The \"pearl and waves\" emblem of the Sangonomiya is said to represent the waves that embrace Watatsumi, And the bright pearls that can be found there. But some also say that it shows the jeweled wheel of Watatsumi Omikami keeping eternal vigil over the land of coral like the moon.\n\nIn the dreams of the deep sea where sponges and coral dwell, in the depths where flowing clouds and ocean sands dance as one, Undying hope would pass from generation to generation of those descended from their god — they who dreamed the same dreams as Watatsumi. The colors of the skies are ever-changing, and the lights and shadows cast deep beneath the waves are of forms ill-defined... Thus did the brilliant compassion that the dark ocean could not conceal diffuse in tranquil bliss.\n\nIn those days, the first Divine Priestess once led her brethren with wisdom as precious as pearls, And she selected clergy from amongst the people newly introduced to the sun, who aided the offspring of their god in comforting those for whom the light of day brought terror. In latter days, the \"Umigozen\" who made the navies of Narukami tremble would sing whale-songs alongside them, And it was this symbol that they drew as they danced with the airborne kurage.\n\nSome years later, a single bolt of lightning would reject the dream of the Watatsumi people. Into the storm slithered the serpent, the lightning's ruthless glow to surely face... But the children of the god and the shrine maidens, who had hearts of pearl, would not forget. Countless tales, gratitude unnumbered, and that ring of ocean gems would forever be passed down, And they would shine ever brighter and more beautifully for it.\n\nWhether it be the histories of the jeweled branches being torn or the birth of precious pearls, Or the defeat of the wicked creatures in the depths to bring sunlight to the pale nation beneath the waves, Or how the young man who dreamed of standing atop Mt. Yougou came to have the name of an \"evil king,\" and had his great duel against the tengu... All these would light up the hearts of the children of Watatsumi, like pearls from the heavens, like waves under the moon's glow. They will carry the pain of loss away into the churning, salty waters, storing them within radiant pearls. May the stories and sacrifices of the age of gods forever be handed down, along with this emblem of \"pearl and waves.\"\n\nEven if the storm clouds should gather, and even if the violet lightning's ferocity be perilous and unpredictable, The silver moon of Watatsumi shall still pierce through the clouds and scatter forth its light.",
      "image":"https://impact.moe/assets/img/weapon-icons/everlasting-moonglow.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"eye-of-perception",
      "name":"Eye of Perception",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"ATK %",
      "subStat":55.1,
      "abilityName":"Echo",
      "abilityDescription":"Normal and Charged Attacks have a 50% chance to fire a Bolt of Perception, dealing 240/270/300/330/360% ATK as DMG. This bolt can bounce between enemies a maximum of 4 times. This effect can occur once every 12/11/10/9/8s.",
      "description":"A dim black glaze pearl that is said to have the power to reach the purity of one's heart.",
      "lore":"A beauteous item fashioned from rare natural glaze.\nLegend has it that the Eye of Perception was once upon a time as bright, clear, and smooth as a lake's surface, but became dulled over the passage of many years.\nFolk records claim that on a still night, one can hear it make soft noises.\nSometimes it sounds like a mild breeze, other times like a flowering spring.\n\nThey say that the Eye was an adeptus's heirloom that was passed down in Liyue and eventually found its way into the Yun family.[Note 1]\nNow one day, Yun was strolling about in the mountains, and there they happened to meet an exorcist named Huang, who had come to consult with the adepti.[Note 2]\nYun spoke with Huang enthusiastically and at length, gifted the Eye to Huang. When Huang frantically declined, Yun said this with a smile:\n\"This pearl is nature's very quintessence. Only one whose heart is clear can use it.\"\n\nThanking Yun, Huang took the Eye and wore it on his person, and slowly made his way towards Liyue. Along the way, neither rain nor wind impeded him.\nAs one who sought after the path of the adepti, Huang wandered the land without rest. Thus, he would often be at the market to buy water and food.\nThe harbor-side streets were a morass of humanity. Yet Huang walked among them as if idle, and was never taken advantage of. Some were curious: how could this bookish exorcist take to the city like a fish to water, and never miss a step?\nWhen asked, he replied: \"This Eye trembles at wickedness, and helps me see which hearts are true.\"\n\nThis Eye could reveal human hearts, though no one knows how it worked, causing many to fall back on folktales to explain it.\nSome say that at midnight, you can dimly hear it call out like a mild breeze, or like spring water flowing between scattered stones.\nBoth are reminiscent of the murmuring of demons that feed on wicked thoughts, a common feature of the parables once told by mothers to their children in days long gone.",
      "image":"https://impact.moe/assets/img/weapon-icons/eye-of-perception.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"favonius-codex",
      "name":"Favonius Codex",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Energy Recharge %",
      "subStat":45.9,
      "abilityName":"Windfall",
      "abilityDescription":"CRIT hits have a 60/70/80/90/100% chance to generate 1 Elemental Orb, which will regenerate 6 Energy for the character. Can only occur once every 12/10.5/9/7.5/6s.",
      "description":"A secret tome that belonged to the scholars of the Knights of Favonius. It describes the logic and power of elements and matter.",
      "lore":"A secret tome that belonged to the scholars of the Knights of Favonius. It holds the collective knowledge of the scholars. It is inlaid with crystallized elements, which is what makes the Favonius Codex such a rarity. Not only because the elemental crystals are precious, but also because each Favonius Codex is hand-made. Only scholars who have mastered the control of the elements can create such elemental crystals.[Note 1] When the Knights of Favonius was founded, the Dawn Knight Ragnvindr turned the aristocrats' indoor baths into a library. In time, countless contributions from bards, scholars and travelers turned the library into the largest collection of literature in the northern half of the continent. After all, songs are whisked away by the wind and wine's pleasure lasts but a fleeting moment. Only that which is committed to the page may sparkle and shine for eternity. Even so, the scale of the library's collection is now a fraction of what it was at its peak.[Note 2] For sadly, the library once burned down in the \"Great Fire of Fall Equinox\" tragedy. There is a large sturdy door made of poplar wood in the library basement. It is said the door predates the founding of the library and stood firm against the smoke and flames. The truth is this door stood there long before the Knights of Favonius was ever founded. The Knights of Favonius officially states that the restricted section of the library is housed behind the door. But tales tell of a far more profound secret hidden within.",
      "image":"https://impact.moe/assets/img/weapon-icons/favonius-codex.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"favonius-greatsword",
      "name":"Favonius Greatsword",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"Energy Recharge %",
      "subStat":61.3,
      "abilityName":"Windfall",
      "abilityDescription":"CRIT hits have a 60/70/80/90/100% chance to generate 1 Elemental Orb, which will regenerate 6 Energy for the character. Can only occur once every 12/10.5/9/7.5/6s.",
      "description":"A heavy ceremonial sword of the Knights of Favonius. It channels elemental power easily and is highly destructive.",
      "lore":"A heavy ceremonial sword of the Knights of Favonius. It is usually only issued after the approval of both the Grand Master and the Church. The craftsmen in Mondstadt have achieved some results in elemental affinity by studying the ancient artifacts of Mondstadt. This heavy greatsword is not only an honor bestowed upon a Knight of Favonius, but also the fruit of the hard work and skills of the guardians of Mondstadt. It can channel elemental power with ease. Its bearer would do well to remember that destruction is but a means to an end, the end being to defend that which must be defended. Only a single-handed form of Rostam the Wolf Pup's Favonius Bladework survives today. Another form has been lost to history: that of Arundolyn, the Lion of Light, who could wield both a longsword and greatsword together in battle. Because of the great strength needed, only those gifted with extraordinary strength could attempt this form. Thus, it soon died out. Close companions growing up, Arundolyn was from a long line of knights while Rostam was born to a peasant family. Their childhood friendship was forged from a shared dream of heroism. As young men, they became fellow knights; as mature adults, one became Grand Master and the other his assistant. Grand Master Arundolyn was no Vision bearer. His formidable strength came from a mixture of natural gifts and intense training. The Grand Master's strength was his pride, and the Grand Master was the pride of the Knights — nay, the pride of all in Mondstadt. After Rostam met his fate, Arundolyn never displayed his strength again. For no longer was it a source of glory to challenge ferocious monsters.",
      "image":"https://impact.moe/assets/img/weapon-icons/favonius-greatsword.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"favonius-lance",
      "name":"Favonius Lance",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Energy Recharge %",
      "subStat":30.6,
      "abilityName":"Windfall",
      "abilityDescription":"CRIT hits have a 60/70/80/90/100% chance to generate 1 Elemental Orb, which will regenerate 6 Energy for the character. Can only occur once every 12/10.5/9/7.5/6s.",
      "description":"A polearm made in the style of the Knights of Favonius. Its shaft is straight, and its tip flows lightly like the wind.",
      "lore":"A spear of honor amongst the Knights of Favonius. It is used in a ceremonial role at parades and reviews, but it is also a keen and mortal foe of monsters. By studying the arbor that held firm in the wind, the craftsmen and scholars of Mondstadt would learn much of elemental affinities. This sturdy spear would not only hold a place in honor among the Knights, but it is also a crystallization of the hard work and artistry of the city's defenders. With it at hand, they shall always remember to be disciplined, and to defend Mondstadt's freedom. Indeed, many people have used polearms of a kind as their weapons, using the reach advantage to supplement their lack of martial skill. Even untrained plebeians could arm themselves with sharpened wooden sticks, and they could perhaps be a match for the steel of trained soldiers. To celebrate the overthrow of the aristocracy, long stakes, flagpoles, and pitchforks were stuck all over the greenery around the city. It was once required of all nobles to study the art of the sword, that they might grow in stature and wisdom. In those days, the art of the spear was reserved for foreign gladiators and traitors. But there was once a noble scion who wielded a spear. They said that Eberhart would enjoy the night breeze as he caught the first drops of dew with his spear tip. An illegitimate child, Eberhart dreamed of recapturing the glory and pride of ancient nobility. Yet, he needed greater power in order to destroy these rotten foundations. So— Whether it was instigate his legitimate brother to pursue his dream of becoming a phantom thief, before deceiving him and forcing him to flee, So that he might usurp that legitimacy. Or whether it was pledging himself as a certain spear-wielding witch's disciple to learn the fatal loophole in her art, All the better to slay her with... \"So what if those who came after should despise me? I will do anything to achieve my goals.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/favonius-lance.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"favonius-sword",
      "name":"Favonius Sword",
      "type":"Sword",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"Energy Recharge %",
      "subStat":61.3,
      "abilityName":"Windfall",
      "abilityDescription":"CRIT hits have a 60/70/80/90/100% chance to generate 1 Elemental Orb, which will regenerate 6 Energy for the character. Can only occur once every 12/10.5/9/7.5/6s.",
      "description":"A standard-issue longsword of the Knights of Favonius. When you're armed with this agile and sharp weapon, channeling the power of the elements has never been so easy!",
      "lore":"A standard longsword wielded by the Knights of Favonius. It is usually issued after the approval of both the Master of the order and the Church. The craftsmen in Mondstadt have achieved some results in elemental affinity by studying Mondstadt's Anemo. This light and agile sword is not only an honor bestowed upon a Knight of Favonius, but also the fruit of the hard work and skills of the guardians of Mondstadt. It can channel elemental power with ease. Its bearer could do well to remember that its sharp blade is intended for defending, not attacking. The traditional art of Favonius Bladework was originated by the childhood friend and spiritual counterpart of Arundolyn, the Lion of Light, whose name was Rostam, the Wolf Pup. Legend says he could chop each drop of rain out of the sky, and that the wind from his sword dance could split the rose and extinguish the torch. In this lies the essence of Favonius Bladework: light, swift, and precise in the defense of Mondstadt. At age of twenty-seven, Rostam received the title of Wolf Pup. Knights of Favonius tradition dictated that the titles of Lion and Wolf were reserved for those of great leadership potential. Such individuals would one day assume the position of Grand Master, devoting themselves to the leadership of a multitude of knights and the safeguarding of Mondstadt. But though he fulfilled his duties faithfully, and devoted himself to Mondstadt, Rostam would not live to see that day. Since Rostam introduced the bladework style, no other practitioner has ever matched his legendary ability. But his fervor, along with his will to protect Mondstadt, have stayed with the knights throughout the generations.",
      "image":"https://impact.moe/assets/img/weapon-icons/favonius-sword.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"favonius-warbow",
      "name":"Favonius Warbow",
      "type":"Bow",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"Energy Recharge %",
      "subStat":61.3,
      "abilityName":"Windfall",
      "abilityDescription":"CRIT hits have a 60/70/80/90/100% chance to generate 1 Elemental Orb, which will regenerate 6 Energy for the character. Can only occur once every 12/10.5/9/7.5/6s.",
      "description":"A standard-issue recurve bow of the Knights of Favonius. Only the best archers can unleash its full potential.",
      "lore":"A standard recurve bow wielded by the Knights of Favonius. Only issued to the best archers long in service of the order. Expertly crafted, the oak frame provides superior strength while the addition of metal parts makes it easy to use. The bowstring is enchanted with the secrets of alchemy and magic, granting protection to the fingers of the archer. This bow serves as a reward to the worthy guardians of Mondstadt, and a fine tool with which for them to continue in their guardianship. The Knights of Favonius once had a formidable team of archer scouts known as the Outriders. The team was founded by a mercenary leader from Liyue, who passed on his lifetime's worth of knowledge to the Outriders. The tracking skills they acquired, along with the ability to sense when danger was afoot, were unique among all the knights. Hence, the skills of the Outriders were invaluable to the Knights of Favonius. This lasted until the first of the Outriders, for reasons unknown to the Knights, ultimately left the order. From that day, the Outrider team was a shell of its former self. Its expertise was gone, though its structure and name have been preserved. Nevertheless, there are still those who work tirelessly to maintain the dignity of the Outrider title.",
      "image":"https://impact.moe/assets/img/weapon-icons/favonius-warbow.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"ferrous-shadow",
      "name":"Ferrous Shadow",
      "type":"Claymore",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"HP %",
      "subStat":35.2,
      "abilityName":"Unbending",
      "abilityDescription":"When HP falls below 70/75/80/85/90%, increases Charged Attack DMG by 30/35/40/45/50%, and Charged Attacks become much harder to interrupt.",
      "description":"A replica of the famed sword of Arundolyn, the Lion of Light. Feel the power of a legendary hero as you hold this sword in your hand! Imagine yourself as the great warrior himself! Note: Daydreaming not recommended in live combat.",
      "lore":"When the young Arundolyn swung his replica greatsword — modeled off the great Ravenwood, Knight of Boreas' own greatsword — imagining that he was cutting the old nobles of Mondstadt down, he never envisaged he would become the renowned \"Lion of Light.\" Nor did he envisage that his young rival Rostam, who later died after serving the people of Mondstadt for 23 years, would one day become his most trusted right-hand man. The replica of the Lion of Light's greatsword is now in the hands of another youngster. How will this mysterious fate be passed on?",
      "image":"https://impact.moe/assets/img/weapon-icons/ferrous-shadow.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"festering-desire",
      "name":"Festering Desire",
      "type":"Sword",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Energy Recharge %",
      "subStat":45.9,
      "abilityName":"Undying Admiration",
      "abilityDescription":"Increases Elemental Skill DMG by 16/20/24/28/32% and Elemental Skill CRIT Rate by 6/7.5/9/10.5/12%.",
      "description":"A creepy straight sword that almost seems to yearn for life. It drips with a shriveling venom that could even corrupt a mighty dragon.",
      "lore":"This was a story from long ago... Unborn life, unfulfilled wishes, Tragic dreams at the edge of the universal darkness that could never come true, Indwell my body, and descend unto this world. Then, my lovely children, Like rainwater flowing into creeks, and plants growing towards the sun, Go unto a lovely place, and display your own beauty there with pride. This is a memory, a memory that a child named Durin had of his mother... \"Thank you, Mother, thank you.\" \"You gave me wings to soar and a mighty form.\" \"Mother, I wish to go to a land of lovely songs,\" \"I will tell them about you, Mother, and about everyone else.\" \"I shall tell them that the place where I was born is beautiful.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/festering-desire.webp",
      "location":"The Chalk Prince and the Dragon Event",
      "stats":null
   },
   {
      "id":"fillet-blade",
      "name":"Fillet Blade",
      "type":"Sword",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"ATK %",
      "subStat":35.2,
      "abilityName":"Gash",
      "abilityDescription":"On hit, has 50% chance to deal 240/280/320/360/400% ATK DMG to a single enemy. Can only occur once every 15/14/13/12/11s.",
      "description":"A sharp filleting knife. The blade is long, thin, and incredibly sharp.",
      "lore":"It was said that the Ticker Fish was a favorite among the people of Liyue.\nAs word caught on, somehow Ticker became Tiger.\nNow, the real Ticker Fish is hard to come by,\nbut Tiger Fish fillets have become synonymous with delicious fish for the people of Liyue.",
      "image":"https://impact.moe/assets/img/weapon-icons/fillet-blade.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"freedom-sworn",
      "name":"Freedom-Sworn",
      "type":"Sword",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"Elemental Mastery",
      "subStat":198,
      "abilityName":"Revolutionary Chorale",
      "abilityDescription":"A part of the \"Millennial Movement\" that wanders amidst the winds. Increases DMG by 10/12.5/15/17.5/20%. When the character wielding this weapon triggers Elemental Reactions, they gain a Sigil of Rebellion. This effect can be triggered once every 0.5s and can be triggered even if said character is not on the field. When you possess 2 Sigils of Rebellion, all of them will be consumed and all nearby party members will obtain \"Millennial Movement: Song of Resistance\" for 12s. \"Millennial Movement: Song of Resistance\" increases Normal, Charged and Plunging Attack DMG by 16/20/24/28/32% and increases ATK by 20/25/30/35/40%. Once this effect is triggered, you will not gain Sigils of Rebellion for 20s. Of the many effects of the \"Millennial Movement,\" buffs of the same type will not stack. \n",
      "description":"A straight sword, azure as antediluvian song, and as keen as the oaths of freedom taken in the Land of Wind.",
      "lore":"People would once raise a toast to a traveler's song that was thusly sung: \n\"If someone plucks out your tongue, you can still sing with your eyes.\" \n\"If someone blinds you in both eyes, you can still see with your ears.\"\n \"If someone conspires to destroy tomorrow, then raise them a glass.\"  \n\"For even if tomorrow dies, this song shall live on.\" \n\nThey say that a region's character follows that of its archon, and that this holds true both for the people and the land itself. But was it the unfettered archon who bestowed a love of freedom and wine upon the land and people amidst conflict? Or was it the people who nurtured the Anemo Archon's love of freedom as they pined for it amid the howling wind and frost? \nThis is a question that can no longer be answered. \n\nBut that song is often sung in dark times. \nWhether in the days when Decarabian reigned from his gale-crowned tower, \nOr when the corrupt nobility overturned the archon's likeness, \nIn cloistered cellars, in dark alleys, and in decrepit taverns, \nThe song seeped through the gale and the iron fist of tyranny, and became an anthem for resisting heroes. \n\nIn the distant past, in a silent city ringed in from all sides, \nCheers erupted to the sound of a lyre and at last pierced the prison of raging winds. \nA certain group, comprised of a youth, a spirit, an archer, a knight and a wandering flame-haired warrior, \nCame and stood before the tower that loomed like a sky-piercing lance, \nThat cast a shadow like that of a titan, \nAnd they swore to be free, and vowed to shatter the rule of the tower's lone tyrant. \n\nThe weak and infirm who could not scale the tower instead sang the song that, till now, had only ever been whispered in corners where the wind did not reach, \nAnd that drinking song rose up with force enough to shake the city walls, spurring the heroes on as they climbed... \n\"If someone plucks out your tongue, you can still sing with your eyes.\" \n\"If someone blinds you in both eyes, you can still see with your ears.\" \n\"But if anyone dares to steal your song, the freedom you yearn for,\" \n\"— That alone, that alone shall never do!\" \n",
      "image":"https://impact.moe/assets/img/weapon-icons/freedom-sworn.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"frostbearer",
      "name":"Frostbearer",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Frost Burial",
      "abilityDescription":"Hitting an opponent with Normal and Charged Attacks has a 60/70/80/90/100% chance of forming and dropping an Everfrost Icicle above them, dealing 80/95/110/125/140% AoE ATK DMG. Opponents affected by Cryo are dealt 200/240/280/320/360% ATK DMG. Can only occur once every 10s.",
      "description":"A fruit that possesses a strange frosty will. A faint sense of agony emanates from it.",
      "lore":"When the daughter of the priestess of Vindagnyr was born beneath this white tree,\nThe king in the verdant mountain was filled with joy when she received her blessings.\n\nSurely, the blessing of Sal Vindagnyr would be everlasting,\nJust as the undying silver-white tree whose roots pierced the earth.\nThat was the hope of those who wrote the annals of that mountain kingdom.\nThose who had recorded the tales of countless people and events believed this in their hearts,\nThat the beauty and skill of their princess would be as eternal and pure as the moonlight.\n\nWhen the nail that froze the world descended suddenly,\nAnd that tree, too, would be shattered by it,\nThat girl took the most complete branch,\nThinking to breathe new life into the tree that once overshadowed a nation.\nBut in the end, the grafted life could not flourish.\nThe cutting snowstorm eventually covered the moonlight like a curtain of countless blades...\nA long, long time later, yet still long ago -\nWhen the deathmatch between the dragons of darkness and wind was decided at last,\nWhen corrosive blood stained the ashen valley red,\nThe tree, at last, remembered that it had not died with that entombed city,\nAnd it extended its greedy roots towards the warm ichor that irrigated the land.\nAnd as a certain someone poured a crimson essence upon it,\nThe tree that should have long died remembered its past,\nAnd bore a single fruit from the gathering of all its might...\n\nHere for those who dwelt in my safe shadow, for the priests who eulogized me,\nFor that lovely maiden who oft painted upon my form,\nFor all the happiness they could not possess - I enjoin\nthem all into this crimson, icy fruit.\nTo the ones who can render recompense upon this poisonous world shall it go,\nAnd may they carry my innocent, bitter fruit as they enact justice.",
      "image":"https://impact.moe/assets/img/weapon-icons/frostbearer.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"hakushin-ring",
      "name":"Hakushin Ring",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Energy Recharge %",
      "subStat":30.6,
      "abilityName":"Sakura Saiguu",
      "abilityDescription":"After the character equipped with this weapon triggers an Electro elemental reaction, nearby party members of an Elemental Type involved in the elemental reaction receive a 10/12.5/15/17.5/20% Elemental DMG Bonus for their element, lasting 6s. Elemental Bonuses gained in this way cannot be stacked.",
      "description":"A catalyst that carries the memory of the Kitsune Saiguu of ancient times. However, this device is but an impoverished vessel for the full breadth of her thought.",
      "lore":"\"People come and go in such haste, like dreams that stay in the night and leave in the morning.\"\n\nThis simple and ordinary life...\nYes, I think I've lived it to the full.\n\nI was once the Hakushin Kitsune.\nWith my agile and loveable comrades,\nI dashed across the mountains and plains of Narukami.\n\nHopefully, when everything is over,\nThey can run happily once more...\n\nI once met an oni maiden with a face as lovely as the moon.\nTogether, we performed and played divine music before the throne,\nAnd I could not help but applaud her sword-dance.\nI hope her beauty, bravery, and bearing,\nShall be praised by people for thousands of years to come.\n\nAt the thought of her unrivaled beauty,\nI cannot help wanting to hide my current appearance with a mask...\n\nI once got into a race with the chieftain of the Yougou Tengu,\nAnd we sprinted through all the courses and paths of the spirit mountains, both within it and around it.\nIn this great contest of speed and strength,\n\nI, born of the Hakushin Clan, was the eventual victor.\nNow that I think about it, she must have let me off easy.\nThe very thought of it makes me feel a little unsatisfied...\n\nI once schemed against a bake-danuki who persistently challenged me,\nAnd I made him surrender to the Shogun completely.\nI also shamelessly schemed against the Shogun,\nAnd I made her put the great bake-danuki under her command.\n\nThat night, the moonlight swept the imperial garden, through branch and petal,\nShowering the courtyard with pearls from heaven.\nThat scene still glows brightly in my shallow heart...\n\nI hope she can remember the wordy motto I dared to put to her ere we parted.\n\"Do not be blinded. Do not waver. Keep walking on the path you believe in.\"\nI hope that my words will ward off at least some of the lies and evil she will face.\nI also hope that that mischievous yet innocent tanuki will not hate me for my final deception...\n\nNow, in this darkest of places,\nI will hold tightly to these scenes,\nAnd like the moon shining through the clouds,\nThey will light up my tiny, fragile heart.\n\nIn this life, I once took the form of a human,\nAnd I walked with these short-lived yet beautiful little creatures,\nAnd became friends with many people from all walks of life.\nWhether it was the shrine maiden who came to train in Narukami for the sake of her hometown shrine,\nOr the kid who got separated from the adults by the divine palanquin's entourage during the summer festival,\nOr the easygoing young man who finally went to Liyue to practice the adepti arts...\nWhether it's the Kanjou who worked hard to make the city prosperous,\nOr the craftsman who was obsessed with making extremely sharp swords,\nOr the clan who used ingenious techniques to make man-made meteors bloom in the skies...\nAll of them are friends whom I did not expect to make.\n\nI hope the barrier that guards them will not be eroded by any darkness...\n\nEverything, all of this — they are all things that I yearn for.\n\n\"So then, the dark will that gnaws at me...\"\n\"Now that I've lost all my strength,\"\n\"My Hakushin blood is yours to do with as you will.\"\n\"However, despite being greatly humbled as I am,\"\n\"I still pray that you will listen to my pleas...\"\n\n\"If you can see everything that I treasure,\"\n\"Then I beg pardon on behalf of those beings.\"\n\"If you would permit me to make but one wish,\"\n\"Please return my ever-bright memory,\"\n\"To this land that I love deeply.\"\n\"That way, that even after your rampage,\"\n\"I may still hold out hope for beautiful things to endure...\"",
      "image":"https://impact.moe/assets/img/weapon-icons/hakushin-ring.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"halberd",
      "name":"Halberd",
      "type":"Polearm",
      "rarity":3,
      "baseAtk":448,
      "subStatType":"ATK %",
      "subStat":23.4,
      "abilityName":"Heavy",
      "abilityDescription":"Normal Attacks deal an additional 160/200/240/280/320% DMG. Can only occur once every 10s.",
      "description":"A polearm with an axe blade mounted on top that can deal quite a lot of damage. It's favored by the Millelith officers.",
      "lore":"The polearm is a powerful weapon even in the hands of the unskilled, because \"the longer, the mightier.\"\nAdding an axe on the tip renders it somewhat unwieldy, but adds slash capabilities. This makes it better suited to complex battle scenarios.\nThe axe-mounted polearm — the halberd — is preferred by warriors of great strength. It has also come to symbolize the honor and bravery of Millelith officers.\nThough peace prevails in the Liyue Harbor of today, the sight of brave warriors with halberd in hand is a ubiquitous one on the city streets.\n\nEach Millelith squad was led by an officer who would fearlessly charge ahead. They were the first line of defense for their comrades in dangerous territory.\nBut it was not through bravery, loyalty, and self-sacrifice alone that they were able to protect their comrades. For they were also formidable fighters, their skills honed over years and years of drilling.\nAny foe who dared approach knew that the sight of the halberd-holding officers of the front line spelled almost certain doom for them.\nAnd when the soldiers of the Millelith assumed a tactical formation, it was the cornerstone of their fearless officers that made them impenetrable as a rock formation.",
      "image":"https://impact.moe/assets/img/weapon-icons/halberd.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"hamayumi",
      "name":"Hamayumi",
      "type":"Bow",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"ATK %",
      "subStat":55.1,
      "abilityName":"Full Draw",
      "abilityDescription":"Increases Normal Attack DMG by 16/20/24/28/32% and Charged Attack DMG by 12/15/18/21/24%. When the equipping character's Energy reaches 100%, this effect is increased by 100%.",
      "description":"A certain shrine maiden once owned this warbow. It was made with surpassing skill, and is both intricate and sturdy.",
      "lore":"\"Get off the ship. Women are a hindrance here!\" The thief they called Ako Domeki turned and left. But hearing this, the shrine maiden could not help by smile faintly. If the person who had taught me archery did not go out to campaign alongside the Shogun, Then our son would been the same age as Zaemon now. And perhaps I would have come to be a Takamine, or he, an Asase... \nZaemon's tone, and the way he intentionally turns his back on me, Is the spitting image of how he once did it, sword in hand. This time, I will not let this person die. Even if it means fighting against the Electro Mitsudomoe banner... \n\"Our fishing spears and swords have been sharpened. It is time to set sair \"Well then, let's show those Shogunate lackeys Seirai's strength!\" \nHearing the sea shanties greeting their departure, the shrine maiden set down her warbow. She once secretly learned true \"magic\" on Mt. Yougou, And though she felt sorry for her Master, the Tengu, she would use it here. She would undo the great barrier that had held for a thousand years, And she would set the resentment of the moribund violet glede free, Allowing it to ravage the ships that flew the Electro Archon's banner. She could only hope that that old cat wouldn't come charging into the storm... \n",
      "image":"https://impact.moe/assets/img/weapon-icons/hamayumi.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"harbinger-of-dawn",
      "name":"Harbinger of Dawn",
      "type":"Sword",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"CRIT DMG %",
      "subStat":46.9,
      "abilityName":"Vigorous",
      "abilityDescription":"When HP is above 90%, increases CRIT Rate by 14/17.5/21/24.5/28%.",
      "description":"A sword that once shone like the sun. The wielder of this sword will be blessed with a \"feel-good\" buff. The reflective material on the blade has long worn off.",
      "lore":"This sword has an extraordinary full name:\nThe Triumphant Harbinger of Dawn that Points Towards Victory.\nOnly one has ever fallen by this blade on the battlefield.\nOne night, the bearer drew the sword triumphantly.\nThe night sky lit up as bright as day,\npin-pointing his precise location.\nArrows rained down upon him.",
      "image":"https://impact.moe/assets/img/weapon-icons/harbinger-of-dawn.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"hunters-bow",
      "name":"Hunter's Bow",
      "type":"Bow",
      "rarity":1,
      "baseAtk":185,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"A hunter's music consists of but two sounds: the twang of the bowstring and the whoosh of soaring arrows.",
      "lore":"Legend has it that Mondstadt once played host to one who made music on bowstrings— Or perhaps it might be more fitting to say that this wandering musician used an instrument's strings to fire arrows. But this is naught but an old folk legend.",
      "image":"https://impact.moe/assets/img/weapon-icons/hunters-bow.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"iron-point",
      "name":"Iron Point",
      "type":"Polearm",
      "rarity":2,
      "baseAtk":243,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"Sharp and pointy at one end, it is a balanced weapon that is quite popular among travelers.",
      "lore":"A simple weapon that exudes a certain austerity.\nFor those who defend that which they must protect,\nOr a traveler with naught to their name but themselves,\nEven the most mundane of weapons might be ten times as powerful as it seems.",
      "image":"https://impact.moe/assets/img/weapon-icons/iron-point.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"iron-sting",
      "name":"Iron Sting",
      "type":"Sword",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Elemental Mastery",
      "subStat":165,
      "abilityName":"Infusion Stinger",
      "abilityDescription":"Dealing Elemental DMG increases all DMG by 6/7.5/9/10.5/12% for 6s. Max 2 stacks. Can only occur once every 1s.",
      "description":"An exotic long-bladed rapier that somehow found its way into Liyue via foreign traders. It is light, agile, and sharp.",
      "lore":"The whole world flocks to the commercial port of Liyue, much to the city's pride.\nWith the tides of people also come exotic treasures.\nThis needle-like sword, with a point but no edges, sacrifices the ability to slash for increased piercing damage.\nA level of skill is required to realize its full potential.\nHowever, it still serves as a fine sword even for those who wield it without particular skill.\n\nA weapon from a distant shore that once hung from the waist of its seafaring bearer.\nA slender and elegant blade, it stood out amidst the roughness and chaos of the sea.\n\nWhen curious folk inquired, the boat captain deflected their questions. Rumors abounded concerning the blade's origins.\nSome said it was won in battle against pirates, others that it was loot from a raid.\n\nBut when the red evening clouds set in and after the sails had been dropped for the night, the Chief Mate would gently polish the blade,\nReminiscing about his old life in the Wind Kingdom, the time he spent roaming as a martial nomad.\nReminiscing about a girl from his hometown, a love that ended too soon, and a promise to meet again.",
      "image":"https://impact.moe/assets/img/weapon-icons/iron-sting.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"katsuragikiri-nagamasa",
      "name":"Katsuragikiri Nagamasa",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Energy Recharge %",
      "subStat":45.9,
      "abilityName":"Samurai Conduct",
      "abilityDescription":"The wielder's Elemental Skill DMG is enhanced by 6/7.5/9/10.5/12%. The wielder loses 3 Energy when Elemental Skill strikes an opponent but gains 3/3.5/4/4.5/5 Energy every 2 seconds for the following 6 seconds. This phenomenon may happen once every ten seconds. Even if the character is not on the field, it may be activated.",
      "description":"A blade that was once made in Tatarasuna. Heavy and tough.",
      "lore":"A long painting scroll designed by one of Tatarasuna's inspectors. It is said that the diagram is as simple and upright as the artist. \nFor a long time, before the introduction of the outlander technology that helped build the Mikage Furnace, Tatarasuna smelted iron using the traditional \"Tatara Metalworking Method.\" After Mikoshi Nagamasa became the inspector, he was for a time obsessed with the grim loveliness of steel. He thus consulted the similarly-inclined Armory Officer Miyazaki for advice, With the end result being this tough and simple sword, the Daitatara Nagamasa. \nAlthough he was only the foster son of the Mikoshi Clan, and although his fostered mother had stained the reputation of the Mikoshi, And even though Mikoshi's only legitimate heir, Doukei, abandoned him and disappeared, His self-admitted stupidity and loyalty led him to cherish the Mikoshi name all the more. He strove to enter the government and got rid of the family's bad reputation with his diligence and righteousness. \nWhen his adjutant Katsuragi was connected with but a single trace of misconduct, he had him executed without mercy. Ever since then, the name of the sword and his title were changed forever. \n",
      "image":"https://impact.moe/assets/img/weapon-icons/katsuragikiri-nagamasa.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"kitain-cross-spear",
      "name":"Kitain Cross Spear",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Elemental Mastery",
      "subStat":110,
      "abilityName":"Samurai Conduct",
      "abilityDescription":"The wielder's Elemental Skill DMG is enhanced by 6/7.5/9/10.5/12%. The wielder loses 3 Energy when Elemental Skill strikes an opponent but gains 3/3.5/4/4.5/5 Energy every 2 seconds for the following 6 seconds. This phenomenon may happen once every ten seconds. Even if the character is not on the field, it may be activated.",
      "description":"A special lance that was once used by a famed warrior who guarded the Tatarigami on Yashiori Island.",
      "lore":"A strangely-shaped spear made by Kitain Bunsou for his own unique style of spearmanship. Its massive weight makes it extremely unwieldy in untrained hands. But in the hands of an expert, it is capable of unleashing great destructive power. \nIn the distant past, Kitain used to be a family that hunted the Tatarigami down. For many generations, they held the post of \"The Yashiori Guardians.\" \nIn the past, there was a certain childrens' song that circulated widely within Inazuma: \"Arataki of the Front Gate, Iwakura the Successor, Kitain the Serpent, Takamine the Mistsplitter.\" These phrases describe the dazzling warriors who once illuminated the earth like comets. There used to be many other names in the list, but they have since been lost to history. And having been a demon hunter for so long, it is unavoidable that one might imbibe some of that miasmic, tainted blood. \n",
      "image":"https://impact.moe/assets/img/weapon-icons/kitain-cross-spear.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"lions-roar",
      "name":"Lion's Roar",
      "type":"Sword",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Bane of Fire and Thunder",
      "abilityDescription":"Increases DMG against enemies affected by Pyro or Electro by 20/24/28/32/36%.",
      "description":"A sharp blade with extravagant carvings that somehow does not compromise on durability and sharpness. It roars like a lion as it cuts through the air.",
      "lore":"Rumored to be a legendary sword of Liyue.\nIt was said its sheath was made with eaglewood, decorated with mica, and engraved with the imagery of war.\nThis priceless sheath, however, was lost.\nTo the blade, the sheath was its prison, keeping it from its true purpose.\nThe blade is so sharp that its victims would only realize they had been struck an hour later.\n\nIt is said that Kunwu forged this prized sharp sword in just one day, though he worked all day and all night to do so.\nBut when Kunwu's aged master saw his apprentice's work, he clenched his fists, sighed in anguish, and beat the ground with his staff.\n\"O, pitiful is this thing merciless in all the world.\"\nThe master let out a final, long sigh, and hobbled away.\n\nKunwu pondered his master's word for three days, and did not touch a single blade in that time.\nThen, he spent a whole year painstakingly carving an eaglewood sheath.\n\nKunwu thought that an elegant and opulent scabbard would surely suffice to subdue the wildness and violence of the blade.\nBut then the prized sword was lost among the common folk. The sharp blade survived, and all that remained of the scabbard was its story.\nFor the sharp blade seeks only to bathe in the blood of its victims, and no sheath can be made that will curb this desire.",
      "image":"https://impact.moe/assets/img/weapon-icons/lions-roar.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"lithic-blade",
      "name":"Lithic Blade",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Lithic Axiom - Unity",
      "abilityDescription":"For every character in the party who hails from Liyue, the character who equips this weapon gains 7/8/9/10/11% ATK increase and 3/4/5/6/7% CRIT Rate increase.",
      "description":"A greatsword carved and chiseled from the very bedrock of Liyue.",
      "lore":"A weapon favored by the Millelith of yore. Carved from the divine bedrock upon which Liyue Harbor was established, it is incomparably heavy. No ordinary human could lift this blade, let alone wield it in battle. And yet records state that the Millelith of old could use it with ease.\n\nThe Millelith was an organization first founded on the initiative of the followers of Rex Lapis. Its history can be traced to when the port city was first completed. Under Rex Lapis' and Liyue's banner they march, and will never desert it, whether in advance or retreat. \"While rock stays hard, the mountain shall never fail; while the Millelith stands guard, evil shall never prevail.\" The Millelith warriors adhere without fail to this code, and for it they would die without regrets.\n\nThey follow in Rex Lapis' footsteps to the best of their ability, slaying monsters, protecting the citizenry, and keeping the peace in Liyue. The Millelith made its name not in slaughter but in defense, using their own bodies to shield their homeland.\n\nThis greatsword of unmatched weight and hardness mirrors the duty and the will of Liyue's guardians. Xing and Han, the two members of this armed force who first carved stone into swords, must have known in their hearts, That in the future, those who had the strength to use these stone swords would grow few. But this also meant that the world would be at peace, and neither guardians nor swords would be needed anymore.",
      "image":"https://impact.moe/assets/img/weapon-icons/lithic-blade.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"lithic-spear",
      "name":"Lithic Spear",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"ATK %",
      "subStat":27.6,
      "abilityName":"Lithic Axiom - Unity",
      "abilityDescription":"For every character in the party who hails from Liyue, the character who equips this weapon gains 7/8/9/10/11% ATK increase and a 3/4/5/6/7% CRIT Rate increase. This effect stacks up to 4 times.",
      "description":"A spear forged from the rocks of the Guyun Stone Forest. Its hardness knows no equal.",
      "lore":"A weapon favored by the Millelith of yore. Made from a lith of the Guyun Stone Forest, said to be able to pierce even through dragon scales... Its great weight prevents the Millelith of today from equipping it.\n\nIn ancient times, the Millelith would conduct themselves in Rex Lapis' name according to this axiom: \"While rock stays hard, the mountain shall never fail; while the Millelith stands guard, evil shall never prevail.\" In the past, they went forth to subdue demons and protect the roads and the countryside. In these peaceful times, their duties have shifted to maintaining order.\n\nAt a certain point in the past, the earth did shake, and the mountains did tremble. Then, the Millelith gave out equipment left over from the ancient wars to those among them who were of unusually great stature. These were the incredibly weighty Lithic Spears, and they were used as shoveling tools to rescue the injured. \"The Lithic Spear pierces through rock with ease.\" \"If a thousand such spears could be lined up in formation today, none could stand before them.\"\n\nYet in an even earlier era, when the world was in yet deeper turmoil, Every soldier in the Millelith could wield these colossal weapons. Thus were they able to protect Rex Lapis' kingdom and defend their homeland. With a thousand Lithic Spears lined up in formation, no evil could prevail against them.",
      "image":"https://impact.moe/assets/img/weapon-icons/lithic-spear.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"lost-prayer-to-the-sacred-winds",
      "name":"Lost Prayer to the Sacred Winds",
      "type":"Catalyst",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"CRIT Rate %",
      "subStat":33.1,
      "abilityName":"Boundless Blessing",
      "abilityDescription":"Increases Movement SPD by 10%. When in battle, earn a 8/10/12/14/16% Elemental DMG Bonus every 4s. Max 4 stacks. Lasts until the character falls or leaves combat.",
      "description":"An educational tome written by anonymous early inhabitants who worshiped the wind. It has been blessed by the wind for its faithfulness and influence over the millennia.",
      "lore":"Scriptures of the ancient winds, passed from generation to generation among the observers of ritual in service of the Anemo Archon.\nCountless hands have touched the now-yellowing pages of this book, though any prints they left have since been carried away by the wind.\n\nIn the era when the Storm Lord reigned from his tower up high, desperate appeals filled the scriptures.\nThen, in the era when the sands of snow thawed, the joy of the sprouting greenery flooded the pages.\n\nIn the days of yore, when the ruling aristocracy pulled at puppet strings to control the masses,\nThe scriptures in the hands of slaves told of their envy and their desire for the thousand winds.\n\nThe people of Mondstadt lived, endured, fought, rejoiced, and enjoyed freedom.\nAs the precious years passed, the scriptures grew thicker and heavier.\n\nWhen Mondstadt was born anew, and the Church finally unshackled,\nThe scriptures of the winds could bear no longer being confined to a shelf,\nAnd so the book took flight, left the Church's treasury and was gone.\nLike the winds of Mondstadt, and like the people of Mondstadt,\nIt belonged to freedom and the winds.\n\nThe elegant handwriting on the title page reads:\n\nChildren of the Anemo Archon, heed these words:\nFrom the winds we have come, and with the winds we shall go.\nNever, ever grieve for me.\n'Tis but my flesh and bones which rest in the soil:\nMy soul has become one with the thousand winds.\n\nWhen flowers bloom, when leaves sway,\nThat is me who sings the songs of freedom, of the winds.",
      "image":"https://impact.moe/assets/img/weapon-icons/lost-prayer-to-the-sacred-winds.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"luxurious-sea-lord",
      "name":"Luxurious Sea-Lord",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"ATK %",
      "subStat":55.1,
      "abilityName":"Oceanic Victory",
      "abilityDescription":"Increases Elemental Burst DMG by 12/15/18/21/24%. When Elemental Burst hits opponents, there is a 100% chance of summoning a titanic tuna that charges and deals 100/125/150/175/200% ATK as AoE DMG. This effect can occur once every 15s.",
      "description":"The great king of the ocean. Having been air-dried, it makes for a fine weapon as well as emergency sustenance.",
      "lore":"As the nights deepen, the pulsing of its gills translate as such:\n\n\"Well now, I was undoubtedly dead when I left the sea.\"\n\"My heart ceased to beat, the whites of my eyes showed, I gave off a rank stench-\".\n\"I mean, for a fish, this had to be death, right?\"\n\n\"Now, these old bones were the strongest among all mackarel.\"\n\"I was also once the strongest being in all the shallow seas,\"\n\"And even sea beasts, whales, and sharks were no match for my might.\"\n\"And yet, even I would meet my match!\"\n\"It was that kurage, or perhaps you might call them the jellyfish.\"\n\"Why, they just float along with the tide,\"\n\"And yet, they can deflect any and all impacts.\"\n\n\"So then did I forsake the patch of strength,\"\n\"Taking up the path of the jellyfish.\"\n\"After a long, long life,\"\n\"I became able to control every organ in my body.\"\n\"So I stopped my own heart,\"\n\"And was not mistaken for fresh fish and sliced open.\"\n\"You may thing that I am naught but a salted fish, 'tis true,\"\n\"But allow me to become your strength.\"\n\n\"Now then, you who wield this old one.\"\n\"Hmm...\"\n\"When all the waters flow into the sea,\"\n\"When the final stars go out,\"\n\"When everything returns to the primordial ocean whence they came,\"\n\"Would you try yourself against me?\"",
      "image":"https://impact.moe/assets/img/weapon-icons/luxurious-sea-lord.webp",
      "location":"Moonlight Merriment Event",
      "stats":null
   },
   {
      "id":"magic-guide",
      "name":"Magic Guide",
      "type":"Catalyst",
      "rarity":3,
      "baseAtk":354,
      "subStatType":"Elemental Mastery",
      "subStat":187,
      "abilityName":"Bane of Storm and Tide",
      "abilityDescription":"Increases DMG against enemies affected by Hydro or Electro by 12/15/18/21/24%.",
      "description":"Version 12. A reprint featuring corrections to Version 11 and brand-new additions based on recent developments.",
      "lore":"This version of the Magic Guide generated much controversy when published.\nIn addition to the defiance of basic common sense seen in Chapter VII: Principles of the Anemo Element,\nerrors can also be observed even concerning the basic principles of the Hydro and Electro elements.\nEvidently, the book was not peer-reviewed before publishing. Nevertheless, the book is still the most authoritative guide to magic in existence.\n\n",
      "image":"https://impact.moe/assets/img/weapon-icons/magic-guide.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"mappa-mare",
      "name":"Mappa Mare",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Elemental Mastery",
      "subStat":110,
      "abilityName":"Infusion Scroll",
      "abilityDescription":"Triggering an Elemental reaction grants a 8/10/12/14/16% Elemental DMG Bonus for 10s. Max 2 stacks.",
      "description":"A nautical chart featuring nearby currents and climates that somehow found its way into Liyue via foreign traders.",
      "lore":"The whole world flocks to the commercial port of Liyue, much to the city's pride.\nWith the tides of people also come exotic treasures.\nThis map, detailing the various seas surrounding the continent, is complete with undercurrents, hidden reefs, and wind directions.\nIt is said to be an exotic tome containing the knowledge, courage, and faith of pioneering explorers.\n\nThe title page of this book reads as follows:\n\"Love ye the sea breeze and the ocean currents, for it is the wind and water that carry the seafaring ones to their destination.\"\n\"Fear ye all the more that same sea breeze and those same ocean currents, for unbridled wind and water can tear apart even an iron vessel.\"\n\nTo woo the ocean and calm her temper, one must explore her every hidden reef, every prevailing wind, and every place which whales make their home.\nThese words appear in the yellowing pages of countless seafarers' notebooks, like an ode of infatuation with their lover's body.\n\nIn foreign lands, seasoned sailors refer to the ocean as their lover, and use female pronouns to address the cold, saline waters.\nPerhaps they do so because of the ocean's temperamentality, or its vast bosom. Or perhaps it is because they are drawn to the romance of sailing away on an adventure.\nLike the ocean, this chart answers to no master. Like the seafarers, it harbors the romantic dream of exploring every corner of the world.",
      "image":"https://impact.moe/assets/img/weapon-icons/mappa-mare.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"memory-of-dust",
      "name":"Memory of Dust",
      "type":"Catalyst",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"ATK %",
      "subStat":49.6,
      "abilityName":"Golden Majesty",
      "abilityDescription":"Increase Shield Strength by 20/25/30/35/40%. Scoring hits on opponents increases ATK by 4/5/6/7/8% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%.",
      "description":"A stone dumbbell containing distant memories. Its endless transformations reveal the power within.",
      "lore":"\"This is the mark of our pledge, and it is also my challenge to you.\"\n\"All my wisdom is hidden within this stone dumbbell.\"\nHe remembers meeting the young woman with the billowing sleeves, remembers the way she acted solemn, yet seemed joyful when she presented him this token.\nWhat a silly notion. There was no formal contract between them. They were merely two people walking the same path for their own reasons...\nBut he remembers the scene of their first meeting anyway, when the Glaze Lilies were still in abundant bloom.\nHe also remembers those words she spoke at the end — again, amid the Glaze Lilies.\n\n\"Those little people are as small and fragile as dust.\"\n\"Because they are so small, they know not when they will lose their lives to disaster or strife, and so they are afraid.\"\n\"Because they are afraid, they try so hard to become more intelligent. This I understand.\"\n\"So I thought that since there is such a gulf between us in strength, I should use technique and wisdom instead.\"\n\"With your brawn and my brains, this city would surely become a great one.\"\nHer final smile was a lonely one, even as her form dissolved into the finest dust.\n\"It seems that our journey together has come to an end. As for that stone dumbbell, forget about it, would you?\"\n\n\"This is the mark of our pledge, and it is also my challenge to you.\"\n\"All my wisdom is hidden within this stone dumbbell.\"\n\"If you can unlock it—\"\nMany years passed, and he was never able to unlock that dumbbell, nor would he ever learn what might have followed that sentence.\nOver the years, the wild Glaze Lilies, too, dwindled till at last they were no more.",
      "image":"https://impact.moe/assets/img/weapon-icons/memory-of-dust.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"messenger",
      "name":"Messenger",
      "type":"Bow",
      "rarity":3,
      "baseAtk":448,
      "subStatType":"CRIT DMG %",
      "subStat":31.2,
      "abilityName":"Archer's Message",
      "abilityDescription":"Aimed Shot hits on weak spots deal an additional 100/125/150/175/200% ATK DMG as CRIT DMG. Can only occur once every 10s.",
      "description":"A basic wooden bow. It is said to have once been used as a tool for long-distance communication.",
      "lore":"It was said in days gone by, The people of Liyue passed messages by bow and arrow. \"Wouldn't bystanders get hurt, you ask?\" \"Suffice to say, there's a good reason this bow is an antique...\" The antique shop owner rubbed their chin and smiled.",
      "image":"https://impact.moe/assets/img/weapon-icons/messenger.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"mistsplitter-reforged",
      "name":"Mistsplitter Reforged",
      "type":"Sword",
      "rarity":5,
      "baseAtk":674,
      "subStatType":"CRIT DMG %",
      "subStat":44.1,
      "abilityName":"Mistsplitter's Edge",
      "abilityDescription":"Gain a 12/15/18/21/24% Elemental DMG Bonus for every element and receive the might of Mistsplitter's Emblem. At stack levels 1/2/3, Mistsplitter's Emblem provides a {8/16/28}/{10/20/35}/{12/24/42}/{14/28/49}/{16/32/56}% Elemental DMG Bonus for the character's Elemental Type. The character will obtain 1 stack of Mistsplitter's Emblem in each of the following scenarios: Normal Attack deals Elemental DMG (stack lasts 5s), casting Elemental Burst (stack lasts 10s); Energy is less than 100% (stack disappears when Energy is full). Each stack's duration is calculated independently.",
      "description":"A sword that blazes with a fierce violet light. The name “Reforged” comes from it having been broken once before.",
      "lore":"One of the swords that the Shogun bestowed upon a Hatamoto. It is said that it can call upon the power of lightning itself to slice through the mountain mist and night fog. \nIt was once shattered into a thousand pieces. After being reforged, a hamon resembling flowing clouds was left on the blade. \n\nAs the folk song goes: \"Arataki of the Front Gate, Iwakura the Successor, Kitain the Serpent, Takamine the Mistsplitter.\" Thus do children who love martial arts list famous historical martial artists, and \"Takamine the Mistsplitter\" was the very same user of this sword. This man once accompanied a member of the clergy, using the Mistsplitter to countless demons and Tatarigami. He also learned archery from the Yougou Tengu, and passed that knowledge on to a person he loved. However, Mistsplitter would have no successors, and now only exists within storybooks, artworks, and fairytales. \n\nAt the end of his life, he assumed the position of one of the Shogun's yoriki and fought against a dark army. \n\nIf he hadn't left his beloved bow to her as part of their wager, maybe things would've been different. But real gamblers never regret, never care about \"what ifs,\" and never feel remorse over \"if onlys.\" The foe flooded over like mist — and so he would just keep slashing away with that secret blade that could disperse the brumous night. As long as his strikes were swift enough, he would pierce the dark night, and day would come again—\n\n\"Asase, our promise... No, say rather our great bet. I will not lose it, not for the world!\" \"I shall return, and together with the bow that I'd wagered.. I'll claim the future as my prize!\" \n\nLike a never-ending chain of lightning, he and Mistsplitter slew countless demons together. Yet at the last, the sword was not as tenacious as the swordsman, and it gradually broke down. And he became submerged in that thick dark mist.. In the end, only some of the blade's fragments were retrieved for reforging, such that it might inherit the Mistsplitter name. \n\nAs though holding onto a spiders thread hanging down in the dark, the samurai held the handle of his broken sword tightly. Amidst the dark mist, he kept stubbornly reminding himself: The result of our wager is still undecided. I must return to Asase's side... \n",
      "image":"https://impact.moe/assets/img/weapon-icons/mistsplitter-reforged.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"mitternachts-waltz",
      "name":"Mitternachts Waltz",
      "type":"Bow",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Physical DMG %",
      "subStat":51.7,
      "abilityName":"Evernight Duet",
      "abilityDescription":"Normal Attack hits on opponents increase Elemental Skill DMG by 20/25/30/35/40% for 5s. Elemental Skill hits on opponents increase Normal Attack DMG by 20/25/30/35/40% for 5s.",
      "description":"A bow painted the color of transgression and nights of illusion.",
      "lore":"\"Mein Fräulein, not one tear of yours was shed in vain during your pilgrimage.\"\nThus spoke Ozvaldo Hrafnavins when the Prinzessin when her journey in the land of ever-silence came to a close.\n\nIn their long journey across space and time, the Prinzessin der Verurteilung and her Night-Severing Raven bore witness to countless stories and their endings, each a raindrop that flows at the journey's end into a bitter sea. Every young man's rage at injustice must turn to calm. Every passion must be ground into dust by the march of time, before being turned to wild paranoia upon that inverted, ancient tree. Even the branch of the tree of time upon which the great and glorious Reman Republic nested would be cut off in the end, such that the nation founded by the other twin child of the wolves might rule.\nEverything in this world must pass through the doorway of their destruction unto the future kingdom of the Prinzessin. In the silence of her pitch-dark Nachtgarten would they find a place to slumber.\nEven so, when Droctfult fell at the hands of the Beast of the World, having fought for the dreams of a young man and the rain that had yet to fall, and was torn to shred by its claws, the Prinzessin still began to tear up.\n\n\"Hearken well, Ozvaldo Hrafnavins. The Sovereign of the Immernachtreich weepeth not.\"\nShe went on, \"Who among those born into this world are not burdened with sin? When the clock sounds for the time of judgment once more, the skirt of night shall descend once more.\nThen he writhing struggles of man and beast trapped within will be naught but a midnight waltz.\" ",
      "image":"https://impact.moe/assets/img/weapon-icons/mitternachts-waltz.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"mouuns-moon",
      "name":"Mouun's Moon",
      "type":"Bow",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"ATK %",
      "subStat":27.6,
      "abilityName":"Watatsumi Wavewalker",
      "abilityDescription":"For every point of the entire party's combined maximum Energy capacity, the Elemental Burst DMG of the character equipping this weapon is increased by 0.12/0.15/0.18/0.21/0.24%. A maximum of 40/50/60/70/80% increased Elemental Burst DMG can be achieved this way.",
      "description":"A lovely warbow made from seashells and coral. A mournful brilliance flows along its moonlight-colored arms.",
      "lore":"The longbow once used by the Watatsumi shrine maiden Mouun,\nIt shines as pure white as the seafoam at the tip of a moonlit wave.\n\nThe shrine maiden was friends with the monsters of distant seas, and together they did battle against the thundering clouds for the sake of Watatsumi's transient dream.\nThe bosom companions rode the waves as one, looming ever in the spray created by the bows of ships...\nOn and on they went, pursuing the path of no return that Watatsumi was now on until they went together to the land of their tragic obliteration.\n\n\"Perhaps it is true that Lord Watatsumi Omikami's war was doomed from the start.\"\n\"But as long as we leave these memories behind, as long as we sow the seeds of sacrifice, this might all be worth it.\"\n\nThe songs of the past eulogize the tacit bond she shared with \"Umigozen\" as twins born of Watatsumi,\nAnd depict them, bow drawn and spear raised, bathing in the wave-spray of a ship's bow...\nThese distant songs recount how she rode with Touzannou upon the back of a sea creature in the night,\nThe broken tomorrows she whispered of, gently and mournfully, into the hero's ear...\n\nIn yet peaceful days, the twins once sang in chorus with the great whale of the deep sea,\nTelling of dismal days spent in the depths and the dark ever-night, and of Omikami and the radiant jade branches.\nShe once frolicked with that reckless young man, whose only strength was his strength...\n\n\"Once I bring that legendary Great Tengu's mask back, you have to keep our promise and finish that business.\"\n\n\"Sure, and if you're still so full of crap then, I'll get a whale to raise a wave large enough to wash that potty mouth of yours clean.\" ",
      "image":"assets/img/weapon-icons/mouuns-moon.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"old-mercs-pal",
      "name":"Old Merc's Pal",
      "type":"Claymore",
      "rarity":2,
      "baseAtk":243,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"A battle-tested greatsword that has seen better days and worse.",
      "lore":"He would often mention the experiences that he had in his youth as an adventurer.\nThey were always the same old long-winded, annoying tall tales.\nBut this old greatsword seems to silently say,\n\"Well, it is a bit over the top, yes. But I was there too, you know.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/old-mercs-pal.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"otherworldly-story",
      "name":"Otherworldly Story",
      "type":"Catalyst",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"Energy Recharge %",
      "subStat":39,
      "abilityName":"Energy Shower",
      "abilityDescription":"Each Elemental Orb or Particle collected restores 1/1.25/1.5/1.75/2% HP.",
      "description":"A cheap fantasy novel with no value whatsoever. Any claim that it possesses the power of catalysis is also pure fantasy.",
      "lore":"A mediocre work of fiction telling the tale of an ordinary fellow who finds himself in another world after death.\nThe world is filled with dangers. Steel monsters as vast as galaxies lurk beneath the ground and devour people in the thousands.\nBut there also exists a powerful being who can make the room comfortable in any season and turn night into day with a snap of his fingers. This is a story as groundless as it is meaningless.\nIt only shares one thing in common with the real world: all the precious metals are owned by a handful of individuals, who keep them locked up in safe boxes.",
      "image":"https://impact.moe/assets/img/weapon-icons/otherworldly-story.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"pocker-grimoire",
      "name":"Pocket Grimoire",
      "type":"Catalyst",
      "rarity":2,
      "baseAtk":243,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"A carefully compiled notebook featuring the essentials needed to pass a magic exam.",
      "lore":"A manual on magic that is popular amongst students, it is portable enough to fit into one's pocket.\nIt has been stripped of the lengthy descriptions of principles and voluminous exercises. All that is left now is exam content.\nCurrently obsolete due to the revisions made in the 12th edition of the Magic Guide.",
      "image":"https://impact.moe/assets/img/weapon-icons/pocket-grimoire.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"polar-star",
      "name":"Polar Star",
      "type":"Bow",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"CRIT Rate %",
      "subStat":33.1,
      "abilityName":"Daylight's Augury",
      "abilityDescription":"Elemental Skill and Elemental Burst DMG increased by 12/15/18/21/24%. After a Normal Attack, Charged Attack, Elemental Skill or Elemental Burst hits an opponent, 1 stack of Ashen Nightstar will be gained for 12s. When 1/2/3/4 stacks of Ashen Nightstar are present, ATK is increased by [10/20/30/48%] / [12.5/25/37.5/60%] / [15/30/45/72%] / [17.5/35/52.5/84%] / [20/40/60/96%]. The stack of Ashen Nightstar created by the Normal Attack, Charged Attack, Elemental Skill or Elemental Burst will be counted independently of the others.",
      "description":"A pristine bow that is as sharp as the glaciers of the far north.",
      "lore":"\"I was once a wounded wolf, betrayed by the whole world,\"\n\"But we shall create a new world, one in which no one shall ever be forsaken.\"\n\n\"Dressed in flawless garments as radiant as the midday,\"\n\"We came to the land of silver snow,\"\n\"And sounded the clarion of Her Majesty's greatness.\"\n\n\"Oft have we walked in the moonless night.\"\n\"Oft have we trudged through the gilded sands.\"\n\"Oft have we felt piercing enmity in the dark,\"\n\"And oft have we dreamed of lovers in distant hometowns.\"\n\"But the pale flame yet burns in our breasts.\"\n\"O Harbingers, scintillating as polar stars,\"\n\"Guide us ever onward, tireless.\"\n\n\"If your dreams find no acceptance, if you nurse wounds that will not fade,\"\n\"If you end each day discontent, if you burn with fury against false promises,\"\n\"Lift up your eyes to the white, glimmering stars, for that is our banner.\"\n\"Join our ranks! Let our marching boots shake the earth like thunder!\"\n\"You who will march with us towards the polestar of the white night, come! We shall never abandon you.\"\n\"You who will walk with us into the land of darkness, come! We shall create a new world together.\"\n\n\"Know that the destruction of all precedes the birth of a new order.\"\n\"At devastation's end, we will greet a stainless dawn.\" ",
      "image":"https://impact.moe/assets/img/weapon-icons/polar-star.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"predator",
      "name":"Predator",
      "type":"Bow",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Strong Strike",
      "abilityDescription":"Effective only on the PlayStation Network: Dealing Cryo DMG to opponents increases this character's Normal and Charged Attack DMG by 10% for 6s. This effect can have a maximum of 2 stacks. Additionally, when Aloy equips Predator, ATK is increased by 66.",
      "description":"A uniquely designed bow. This should not belong in this world.",
      "lore":"The Blacksmith who accepted the commission asked why this order had to be made this way and why it had to be named like this.\n\nThe answer was rather complicated: something about machine beasts that roamed all over the world, and something about polearms not having override codes.\n\nThe blacksmith understood quickly enough, though. So this bow was some powerful weapon used to hunt and kill these mighty machine creatures, and so it was the apex predator of that world.\n\nBut the strange girl corrected him.\n\nShe was just going to use this to hunt wild boars next, since it appeared that in this world, using bows and arrows to hunt would actually allow one to harvest Raw Meat. ",
      "image":"https://impact.moe/assets/img/weapon-icons/predator.webp",
      "location":"Given via the Mail on PS4/PS5 between Version 2.1–2.2, obtainable on PC/Mobile via cross save",
      "stats":null
   },
   {
      "id":"primordial-jade-cutter",
      "name":"Primordial Jade Cutter",
      "type":"Sword",
      "rarity":5,
      "baseAtk":542,
      "subStatType":"CRIT Rate %",
      "subStat":44.1,
      "abilityName":"Protector's Virtue",
      "abilityDescription":"HP increased by 20/25/30/35/40%. Additionally, provides an ATK bonus based on 1.2/1.5/1.8/2.1/2.4% of the wielder's Max HP.",
      "description":"A ceremonial sword masterfully carved from pure jade. There almost seems to be an audible sigh in the wind as it is swung.",
      "lore":"They say that when Liyue first arose, Rex Lapis once walked the land with a sword hewn from jade.\nDespite the constant wear and tear of age, the jade edge, so bathed in blood, still retained a polished sheen as if brand-new.\nThe blood was washed away in the rain of a thousand years, yet the thoughts and grudges that gathered about it could not be so easily eliminated.\n\"Nephrite has the soul of the Bishui's gentle heart, and will in time cleanse itself of the remnant grudges within.\"\n\"But who will ease the agony that the jade itself feels for having becoming an instrument of slaughter?\"\nThese words of a friend long-forgotten were both lament and sigh.\nBut the inexorable gears of destiny would drown out those compassionate words.\nIn the passing of many long years, many became mortal foes who once made merry together,\nWhile those who betrayed one another or fought to the death would come to share a drink, their hatred dispelled.\nSo it was also with this precious sword, carved as it once was to be given as an expensive gift to a certain someone.\nThis jade too was once cut for love of peace and luxury.\nWhen wine vessels are filled with blood, and when tender feelings are ripped asunder by cold ambition and reduced to dust on the wind,\nGifts ungiven and bonds unspoken will become sharp blades with which to cleave erstwhile friends.",
      "image":"https://impact.moe/assets/img/weapon-icons/primordial-jade-cutter.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"primordial-jade-winged-spear",
      "name":"Primordial Jade Winged-Spear",
      "type":"Polearm",
      "rarity":5,
      "baseAtk":674,
      "subStatType":"CRIT Rate %",
      "subStat":22.1,
      "abilityName":"Eagle Spear of Justice",
      "abilityDescription":"On hit, increases ATK by 3.2/3.9/4.6/5.3/6% for 6s. Max 7 stacks. Can only occur once every 0.3s. Full stacks increase Skill DMG by 12/16/20/24/28%.",
      "description":"A jade polearm made by the archons, capable of slaying ancient beasts.",
      "lore":"At Liyue's foundation, monsters and gods still ruled the seas.\n\nIn fear the forebears lived, and fought the sea with all they could muster.\n\nAs spring turned to fall and back again for many an eon, a behemoth arose that dominated the seas. Even the Geo Archon's Geo Whale could not triumph against it.\n\nThe people of Liyue called it \"Baqiu\", a beast without rival even in the deepest depths of the ocean abyss. Its enormous waves would wash away entire settlements.\n\nSo the Geo Archon fashioned a black kite by hand with jade and stones.\n\nThe stone bird took to the unbound skies once forged. Into the heart of the ocean it dove, into the battlefield with the behemoth and the whale.\n\nInto the depths of the sea the behemoth sank, there to stay forever.\n\nReleased from its thundering roars were the people of Liyue.",
      "image":"https://impact.moe/assets/img/weapon-icons/primordial-jade-winged-spear.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"prototype-amber",
      "name":"Prototype Amber",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"HP %",
      "subStat":41.3,
      "abilityName":"Gilding",
      "abilityDescription":"Using an Elemental Burst regenerates 4/4.5/5/5.5/6 Energy every 2s for 6s. Additionally, all party members will regenerate 4/4.5/5/5.5/6% HP every 2s for this duration.",
      "description":"A dully gilded catalyst secretly guarded in the Blackcliff Forge. It seems to glow with the very light from the sky.",
      "lore":"An ancient catalyst from Liyue's arsenal. The batch number has faded and no records exist to confirm the date of production. The disc represents the cosmos and thus takes a circular form. At the center is a piece of Cor Purum, representing a heavenly body suspended in the firmament. After the great chaos subsided, sinister forces still remained in the world. Thus, people abandoned traditional martial arts and tools and espoused the supernatural arts. But the techniques used in catalyst production were antiquated, having remained unchanged in over a century. Thus, the catalysts of that age were fragile and broke on first use. The thaumaturges flocked to Liyue and pleaded with Yun Hui, head of the house of Yun, to design a new type of catalyst for them. Yun Hui proceeded to add a catalyst to the then-new series of improved weapon designs known as \"the prototypes.\" The disc is made of wood and rare ore. The Cor Purum in the center was a gift from the thaumaturges. Cor Purum is produced by firing Cor Lapis in an urn for seven days squared (that is, forty-nine days) and then steeping it in fresh water drawn from a mountain spring for a further seven days squared. The dual purification of fire and water renders Cor Purum unbreakable, and the thaumaturges also believe it allows the stone to act as a vessel for primordial cosmic energy. A catalyst with Cor Purum at its core can channel cosmic energy with the turning of the disc. Twelve full turns works the energy into its purest form. Yun Hui observed that the Cor Purum had a warm, golden glow like that of amber. After discussion with the thaumaturges, he proposed to name the catalyst \"Prototype Amber.\" Thereafter, all catalysts made in Liyue were modeled on Yun Hui's prototype.",
      "image":"https://impact.moe/assets/img/weapon-icons/prototype-amber.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"prototype-archaic",
      "name":"Prototype Archaic",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"ATK %",
      "subStat":27.6,
      "abilityName":"Crush",
      "abilityDescription":"On hit, Normal or Charged Attacks have a 50% chance to deal an additional ATK DMG to enemies within a small radius. Can only occur once every 15s.",
      "description":"An ancient greatsword discovered in the Blackcliff Forge. It swings with such an immense force that one feels it could cut straight through reality itself.",
      "lore":"An ancient prototype greatsword from Liyue's arsenal. The batch number has faded and no records exist to confirm the date of production. Weighing in at close to forty pounds, this weapon's hilt is made from a rare ore, while the blade is forged from the finest steel. All you will see when it is swung are blinding flashes of light, powerful enough to devour the clouds and blot out the moon. After the great disaster, the Yun family forge joined forces with the master craftsman Han Wu to find a way to push past the constraints of contemporary blade design and revolutionize their craft. Thus was born a new series of weapon models, simply named \"the prototypes.\" The first greatsword built using the new design was unusually understated in its final appearance. The underwhelming sight of dull, blotchy gold masked the weapon's true strength. While not much to look at, any who cared to try it would discover that it was weighty but not unwieldy. Han Wu, the master craftsman who forged the weapon, traveled north through the night to hand the sword over to a martial artist who followed the chivalric code. The martial artist inspected the blade closely before trialing it. The blade howled like the wind and in an instant decimated the entire bamboo forest. It was a rare sight to behold. The martial artist said to Han Wu, \"This blade is endowed with the elegance of antiquity. It is of equal value both as a weapon and an ornament.\" \"Such a fine creation possessed of both scale and subtlety is worthy of a name like no other. May it be known as Archaic.\" Due to its unparalleled strength, this sword subsequently became the model for thousands of greatswords in Liyue.",
      "image":"https://impact.moe/assets/img/weapon-icons/prototype-archaic.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"prototype-crescent",
      "name":"Prototype Crescent",
      "type":"Bow",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Unreturning",
      "abilityDescription":"Aimed Shot hits on weak points increase Movement SPD by 10% and ATK by 6% for 10s.",
      "description":"A prototype longbow discovered in the Blackcliff Forge. The arrow fired from this bow glimmers like a ray of moonlight.",
      "lore":"An ancient prototype bow weapon from Liyue's arsenal. The batch number has faded and no records exist to confirm the date of production. More than fifty-year-old cudrania wood was ordained in gold silk and paired with the finest steel components to make this fine bow. Despite being made from Irminsul branches that had stretched deep down into the earth, the bowstring is exceptionally pliable, guaranteed to never snap. The house of Yun in Liyue promoted a set of legendary prototype weapons to break free of their constraints and bring a new age to the power of their forces. An exceptional longbow that is mainstream among the armed forces. The master craftsman Han Wu personally assembled this longbow at the request of his good friend Yun Hui. He employed every trade caravan he could find to bring to him a plethora of resources. In the end, he chose to use cudrania wood, fine steel and Irminsul branches brought back from the abyss. The result is a beautifully superior bow, sturdy and easy to grip, and cool to the touch. The bow's arc is as beautiful as the crescent moon, albeit a darker shade, like a light moon hanging low amidst a foggy night sky. When an arrow from the bow pierces the sky, the string's light is thin and cold, reminiscent of an unforgettable moonflow. This resemblance has earned the bow the title of \"Crescent.\" Should its beauty captivate the people, then Liyue will be sure to see no shortage of similarly inspired bows.",
      "image":"https://impact.moe/assets/img/weapon-icons/prototype-crescent.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"prototype-rancour",
      "name":"Prototype Rancour",
      "type":"Sword",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Physical DMG %",
      "subStat":34.5,
      "abilityName":"Smashed Stone",
      "abilityDescription":"On hit, Normal or Charged Attacks increase Base ATK and DEF by 4/4.5/5/5.5/6% for 6s. Max 4 stacks. Can only occur once every 0.3s.",
      "description":"An ancient longsword discovered in the Blackcliff Forge that cuts through rocks like a hot knife through butter.",
      "lore":"An ancient prototype sword from Liyue's arsenal. The batch number has faded and no records exist to confirm the date of production. A swirling cloud motif is etched into the body of the blade, which gives it a faint golden glow in the sunlight as it swings through the air. It is said that the bladesmiths behind this weapon reached the extent Of their abilities and were forced to innovate. Yun Hui, head of the house of Yun's family forge, approached renowned craftsman Han Wu. With the combined expertise from both sides, Han Wu drew up designs for a new series of weapons, simply named \"the prototypes.\" The very first sword made following this design already had the feel of a formidable weapon. While trying out the sword at Mt. Tianheng, Han Wu accidentally dropped it on the ground. The sword responded by unleashing a swirling tornado of energy that cut a twelve-inch-deep hole into the solid mountain rock. Han Wu took it as a sign from the heavens. He declared, \"This sword shall be named Rancour, destroyer of rocks.\" This sword shakes mountains at their foundations and possesses the power of a thousand peaks in its tip. This sword that cuts through rocks like butter became the basis for all subsequent swords made in Liyue.",
      "image":"https://impact.moe/assets/img/weapon-icons/prototype-rancour.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"prototype-starglitter",
      "name":"Prototype Starglitter",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Energy Recharge %",
      "subStat":45.9,
      "abilityName":"Magic Affinity",
      "abilityDescription":"After using an Elemental Skill, increases Normal and Charged Attack DMG by 8% for 12s. Max 2 stacks.",
      "description":"A grudge discovered in the Blackcliff Forge. The glimmers along the sharp edge are like stars in the night.",
      "lore":"An ancient prototype pole weapon from Liyue's arsenal. The batch number has faded and no records exist to confirm the date of production. The pole is made of black steel inlaid with gold. A lightning motif runs along the body, featuring streaks of lightning interspersed with stars. The addition of gold leaf gives it an exquisite finish. By the time the monster threat was quelled, the remaining troops were few and far between, and each joined the civilian community where they were based. Though peace now prevailed, it sparked a martial arts renaissance that spread throughout the land. Demand for all kinds of weaponry spiked, especially for superior quality items, and manufacturers could not keep pace. To find a solution, Yun Hui of the house of Yun met with master craftsman Han Wu and the two conducted intensive research behind closed doors. By the time they emerged, both men's beards had grown by twelve inches. Their new weapon designs, \"the prototypes,\" were finally ready to revolutionize weaponry manufacturing in Liyue. It was time to do away with the shackles of the past that plagued their craft. The first pole built to the new specifications had a black-and-gold appearance. The spike at the tip was two inches longer than the previous standard. It was truly a deadly weapon, but one with a composed and commanding presence. It was left to bask overnight in the moonlight. At the first light of dawn, the tip shone with the cold, piercing light of a star against the dim sky. At this ethereal sight, Yun Hui's mind was flooded with memories of his father's glory, for his father's name made reference to the stars. Greatly moved, he decided to dedicate the weapon to his father's memory. For this reason the weapon became known as \"Starglitter\" among later practitioners of the halberd arts in Liyue.",
      "image":"https://impact.moe/assets/img/weapon-icons/prototype-starglitter.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"rainslasher",
      "name":"Rainslasher",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Elemental Mastery",
      "subStat":165,
      "abilityName":"Bane of Storm and Tide",
      "abilityDescription":"Increases DMG against opponents affected by Hydro or Electro by 20/24/28/32/36%.",
      "description":"A fluorescent greatsword with no sharp edge that crushes enemies with brute force and raw power.",
      "lore":"A dimly fluorescent greatsword with no sharp edge.\nYears ago it was known as the \"Beacon of the Nether\" by the mountain bandits.\nSeeing it meant there was no way back.\nThe only way was forward, towards the end of one's life.\n\n\"Formless, like the rain that cuts through rain. Weightless, like the light that pierces light.\"\n\"Untouchable, moving like a snake. Inescapable, as sword's stare and polearm's glance.\"\n\nThe Raincutter was named out of reverence for its master.\nOriginally it had no name.\nThe blade's first and final master was a martial nomad who went by the name of Guhua.\n\nIt is said he was an adeptus. While Guhua lived, bandits dared not act and the wilderness knew a peace like that of the city.\nAllegedly, at the end of his journey he ascended in a purple haze and became a star.[Note 1]\n\nOne to whom Guhua had shown kindness founded what is now known as the Guhua School in his honor. But no school is destined to last forever.",
      "image":"https://impact.moe/assets/img/weapon-icons/rainslasher.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"raven-bow",
      "name":"Raven Bow",
      "type":"Bow",
      "rarity":3,
      "baseAtk":448,
      "subStatType":"Elemental Mastery",
      "subStat":94,
      "abilityName":"Bane of Flame and Water",
      "abilityDescription":"Increases DMG against enemies affected by Hydro or Pyro by 12/15/18/21/24%.",
      "description":"Ravens are known to be the ferrymen of the dead. This bow's limb is decorated with raven feathers, which forebode the imminent death of its target.",
      "lore":"Ravens are messengers of death. \"Placing this feather on the limb of one's bow declares the death of one's prey.\" Or so claimed the weapon vendors. Ascensions",
      "image":"https://impact.moe/assets/img/weapon-icons/raven-bow.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"recurve-bow",
      "name":"Recurve Bow",
      "type":"Bow",
      "rarity":3,
      "baseAtk":354,
      "subStatType":"HP %",
      "subStat":46.9,
      "abilityName":"Cull the Weak",
      "abilityDescription":"Defeating an opponent restores 8/10/12/14/16% HP.",
      "description":"It is said that this bow can shoot down eagles in flight, but ultimately how true that is depends on the skill of the archer.",
      "lore":"A recurve bow exquisitely made from wood, bones, and animal tendons. In the hands of a masterful archer, it can shoot down eagles in flight. It is the pride of a hunter, and proof of mastery. Pity the innocent eagles.",
      "image":"https://impact.moe/assets/img/weapon-icons/recurve-bow.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"redhorn-stonethresher",
      "name":"Redhorn Stonethresher",
      "type":"Claymore",
      "rarity":5,
      "baseAtk":542,
      "subStatType":"CRIT DMG %",
      "subStat":88.2,
      "abilityName":"Gokadaiou Otogibanashi",
      "abilityDescription":"DEF increased by 28/35/42/49/56%. Normal and Charged Attack DMG is increased by 40/50/60/70/80% of DEF.",
      "description":"According to its previous owner, this weapon is the \"Mighty Redhorn Stoic Stonethreshing Gilded Goldcrushing Lion Lord\" that can send any monster packing with its tail between its legs.",
      "lore":"",
      "image":"https://impact.moe/assets/img/weapon-icons/redhorn-stonethresher.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"royal-bow",
      "name":"Royal Bow",
      "type":"Bow",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Focus",
      "abilityDescription":"Upon dealing damage to an opponent, increases CRIT Rate by 8/10/12/14/16%. Max 5 stacks. A CRIT hit removes all existing stacks.",
      "description":"An old royal longbow that belonged to the erstwhile rulers of Mondstadt. Countless generations later, the bowstring is still tight and can still fire arrows with great force.",
      "lore":"A longbow used by a noble who ruled over Mondstadt. It was crafted with premium materials and master craftsmanship. For that reason, generations later, it is still as powerful as ever.\nHunting was once a pastime of the nobles.\nThey demonstrated their strength in the natural world, and shared the spoils with the people in benevolence.\nUnfortunately, benevolence was lost, and with it, their reign.\n\nAfter the uprising, the Lawrence Clan that had long ruled Mondstadt was overthrown.\nIn the name of benevolent governance, the newly established Knights of Favonius deemed that protracted investigations would be unnecessary.\nThe Lawrence clan was promptly cast out from Mondstadt, never to return.\n\n\"On the road bound to our exile, I watched my father sigh with grief; at the betrayal of the people, at the end of a glorious era, at the final chapter of history.\"\n\"We watched the people who were once our subjects rejoicing in the open country as we bid farewell to our homeland.\"\n\"Only years later did I realize: it was we, the Lawrence clan, who had betrayed, who had ended a glorious era, and who had closed the history books. Only now was Mondstadt as it always should have been.\"\n\nVennessa was but the final push that toppled a crumbling tower.\nBefore her, the flames of fury already burned bright, and occasionally the flickering flames had shone through the thick smoke of secrecy:\nThe phantom thief praised in secret by the people. The woman who could see death. The Wanderer's Troupe intent on revolution.\nThe spirit of resistance is in Mondstadter's blood.",
      "image":"https://impact.moe/assets/img/weapon-icons/royal-bow.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"royal-greatsword",
      "name":"Royal Greatsword",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"ATK %",
      "subStat":27.6,
      "abilityName":"Focus",
      "abilityDescription":"Upon dealing damage to an opponent, increases CRIT Rate by 8/10/12/14/16%. Max 5 stacks. A CRIT hit removes all existing stacks.",
      "description":"An old greatsword that belonged to the erstwhile rulers of Mondstadt. It is made from the finest-quality materials and has stood the test of time. A weapon for use by royals only.",
      "lore":"A greatsword used by a noble who ruled over Mondstadt. It was crafted with premium materials and master craftsmanship.\n\nFor that reason, even after being passed down for generations, it is still as good as new. Combat was once a responsibility of the nobles. They protected their people from monsters threatening peace and stability. Unfortunately, they all but forgot their responsibilities, which turned them into the very monsters they once sought to destroy.\n\nResearch suggests that gladiatorial combat originated in a religious context during the rule of the Aristocracy. Now outlawed by the Knights of Favonius, it began as a sacrificial ceremony held jointly with prayers to the gods. Though the practice was later turned into a perverted sport for the Lawrence clan's pleasure. and subsequently abolished by the Knights. Some texts of the original prayers still remain.\n\n\"Please look after Mondstadt's winds. Look after me, my friends, my countrymen, and my opponent. May the sound of clashing blades delight you, and may the offering of sweat and blood please you.\"\n\n\"To the wind that guides me. When I'm exhausted, bless me with the strength to keep going forward. When I'm uncertain , bless me with the wisdom to distinguish good from evil.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/royal-greatsword.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"royal-grimoire",
      "name":"Royal Grimoire",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"ATK %",
      "subStat":27.6,
      "abilityName":"Focus",
      "abilityDescription":"Upon dealing damage to an opponent, increases CRIT Rate by 8/10/12/14/16%. Max 5 stacks. A CRIT hit removes all existing stacks.",
      "description":"A book that once belonged to a royal mage of Mondstadt. It contains faithful and comprehensive historical accounts as well as magic spells.",
      "lore":"A delicate scroll treated with wax to prevent decay and moth damage.\nIt contains the research of royal mages—research which is still rather forward-looking to this day.\nThe royal mages were tasked with nourishing the water and soil as well as fighting off monsters. They also served as tutors for the nobles.\nTherefore, the scroll contains a wealth of information regarding history, governance, management, and culture.\nWhen the people overthrew the royals, they exiled the royal mages at the same time,\nFor the mages had forsaken their responsibility to instill goodness and virtue in the nobles, instead becoming birds of a feather with them.\n\nIn the early days of Mondstadt, the Lawrence clan was led by Venerare.\nUnder her guidance, the people built a tall statue in the plaza to commemorate the miracle of the Anemo Archon's descent.\n\nThe inscription beneath the statue was put there by the leader of all the clans. It bore an oath of protection to Mondstadt that they had sworn.\nOver the years, the Lawrence clan forsook the noble aspirations of their forebears, and the statue was taken down.\nThe wise mages of the court spoke neither of history nor of the oath ever again.\n\nIn the age of the Knights of Favonius, the statue was rebuilt.\nBut the wording of the oath on the inscription was lost forever.",
      "image":"https://impact.moe/assets/img/weapon-icons/royal-grimoire.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"royal-longsword",
      "name":"Royal Longsword",
      "type":"Sword",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Focus",
      "abilityDescription":"Upon dealing damage to an opponent, increases CRIT Rate by 8/10/12/14/16%. Max 5 stacks. A CRIT hit removes all existing stacks.",
      "description":"An old longsword that belonged to the erstwhile rulers of Mondstadt. Exquisitely crafted, the carvings and embellishments testify to the stature of its owner.",
      "lore":"A longsword used by a noble who ruled over Mondstadt. It was crafted with premium materials and master craftsmanship.\nFor that reason, even after being passed down for generations, it is still as sharp as ever.\nSwordsmanship was once a mandatory skill for the nobles.\nHowever, it was for the purpose of refining wisdom and elegance, not for use in combat.\nUnfortunately, wisdom and elegance were eventually all but forgotten. Swordsmanship became a mere formality.\n\nTwenty-six hundred years ago was the era of Mondstadt's most ancient inhabitants.\nThey swore a solemn oath, after the new Anemo Archon descended and reformed the world:\n\n\"For Mondstadt, as always. For the verdant plains, for the hills, and for the forests of Mondstadt. May they continue to flourish, as always.\"\n\"For Mondstadt, as always. For the everlasting freedom of Mondstadt from the blizzard and the tyrant, whose coldness and oppression are one and the same.\"\n\nNo matter what future woes might befall Mondstadt, whether human tyranny or monster infestation, and even if that tablet is destroyed on which the oath of protection is written,\nThe oath itself will forever be borne by the winds, gently caressing Mondstadt like a doting lover, firmly defending Mondstadt like a loving father.",
      "image":"https://impact.moe/assets/img/weapon-icons/royal-longsword.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"royal-spear",
      "name":"Royal Spear",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"ATK %",
      "subStat":27.6,
      "abilityName":"Focus",
      "abilityDescription":"Upon dealing damage to an opponent, increases CRIT Rate by 8/10/12/14/16%. Max 5 stacks. A CRIT hit removes all existing stacks.",
      "description":"This polearm was once cherished by a member of the old nobility that governed Mondstadt long ago. Although it has never seen the light of day, it is still incomparably sharp.",
      "lore":"A lance once kept in the collection of a noble who ruled over Mondstadt. A product of premium materials and masterful artisanship.\nFor that reason, it remains sharp as it was on the day it was first forged, even many generations after the nobles' time ended.\nBut back in the era of the nobility, this weapon never saw the light of day, and bathed only in the pale moonlight.\n\nThe nobles believed that those of high blood should use swords in battle.\nTo them, the sound of blades clashing was the chorus the lofty souls.\nThe spear and the bow, on the other hand, were the weapons of plebian gladiators and commoners.\n\nCommoners with pitchforks and sharpened wooden poles, after all, could yet be a match for sword-wielding scions of nobility.\nThis was, undoubtedly, a hard pill for the rulers of Old Mondstadt to swallow.\n\nLegend has it that there was also a youth of noble stock,\nWho sought out a smith to make this weapon, emblazoned with their house's crest,\nAnd yet which, like this youth, could never earn the favor of his family...\nNo, not without the spilling of blood.\n\nIf that youth wanted change to come, they needed power.\nEven if it meant using a weapon seen as ignoble.\nEven if it meant that their spear-wielding shadow could never see any light but that of the deep night's moon.",
      "image":"https://impact.moe/assets/img/weapon-icons/royal-spear.webp",
      "location":"Starglitter Exchange",
      "stats":null
   },
   {
      "id":"rust",
      "name":"Rust",
      "type":"Bow",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Rapid Firing",
      "abilityDescription":"Increases Normal Attack DMG by 40/50/60/70/80% but decreases Aimed Shot DMG by 8/9/10/11/12%",
      "description":"A completely rusted iron greatbow. The average person would lack the strength to even lift it, let alone fire it.",
      "lore":"An ancient bow, as hard as cast iron, that once belonged to a famed archer. He once slew monsters and bandits like silvergrass in the wind. As he pursued mastery in the discipline of archery, his string sang like unrelenting thunder, and his arrows shone like sun-soaked iron rain. In his twilight years, the archer had a revelation. \"The ultimate profundity of speech is the word withheld, and the ultimate profundity in archery is the arrow spared.\" Thereafter, he never spoke again of arrows shot out of the sky. Nor did he speak again of the foul monsters slain by iron arrows shot from an iron bow. He buried his bow in the ground and went to live as a hermit amidst the hills. Allegedly, the story of his death is as follows: Every night, as the sound of a plucked string rang out from his home, a ray of brilliant purple light shot forth, and foul monsters dared not approach. On the night of his death there was a storm. Amidst the howling wind and rain there was but a single clap of thunder. The accompanying bolt of lightning shot upwards, towards the sky, burning bright as the stars in the galaxy.",
      "image":"https://impact.moe/assets/img/weapon-icons/rust.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"sacrificial-bow",
      "name":"Sacrificial Bow",
      "type":"Bow",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Energy Recharge %",
      "subStat":30.6,
      "abilityName":"Composed",
      "abilityDescription":"After damaging an opponent with an Elemental Skill, the skill has a 40/50/60/70/80% chance to end its own CD. Can only occur once every 30/26/22/18/14s.",
      "description":"A ceremonial hunting bow that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
      "lore":"On the cliff facing the eastern sea, the ancestors worshipped the masters of Time and Anemo together. The two are intimately related, as expressed in the saying, \"Anemo brings stories while Time nurtures them.\" This bow tells the story of the pioneers and the hardships they went through. It used to be a prop with an immobile bowstring, but the string became both flexible and sturdier with the passage of time. This bow was once the property of the proud Lawrence Clan. In the far-flung past, they used it to reenact their clan's brave victory over the frozen wilderness. The first act of the ceremony told the tale of their forebears conquering the land through their wisdom and strength. Over their long history, though this ceremony was lost, they continued to play the same role. But this role became corrupted. Gradually, their view of themselves shifted from conquerors, to overlords, to kings. Gradually, they strayed into the path of depravity, and lost the affection of Mondstadt's winds.",
      "image":"https://impact.moe/assets/img/weapon-icons/sacrificial-bow.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"sacrificial-fragments",
      "name":"Sacrificial Fragments",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"Elemental Mastery",
      "subStat":221,
      "abilityName":"Composed",
      "abilityDescription":"After damaging an opponent with an Elemental Skill, the skill has a 40/50/60/70/80% chance to end its own CD. Can only occur once every 30/26/22/18/14s.",
      "description":"A weathered script, the text of which is no longer legible. A cursed item eroded by the winds of time.",
      "lore":"In the early days, the people of Mondstadt had a tradition of building theaters on top of windy cliffs to please the gods. Rituals took the form of performances, for they believed the gods enjoyed stories and ballads. This script is millennia old, and is no longer legible. Long ago, a war waged between the Lord of Storm and the Great Wolf King of the North. Mondstadt was engulfed in blizzards, and the snow stung like sand. A group who could bear the cold no longer built a shrine high on a clifftop in the east. There, they prayed for divine mercy and protection. The wind blows for a moment, but the ravages of time are constant, unrelenting, and irreversible. A god of the winds may move between the pages of a book, but in the end, the merciless god of time will eat away at them until not a single legible word remains. Yet, time's assault and that of the wind often take their toll the same upon the heart. Perhaps that is why later generations presumed the shrine to have always been to the wind, and the wind alone.",
      "image":"https://impact.moe/assets/img/weapon-icons/sacrificial-fragments.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"sacrificial-greatsword",
      "name":"Sacrificial Greatsword",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Energy Recharge %",
      "subStat":30.6,
      "abilityName":"Composed",
      "abilityDescription":"After damaging an opponent with an Elemental Skill, the skill has a 40/50/60/70/80% chance to end its own CD. Can only occur once every 30/26/22/18/14s.",
      "description":"A ceremonial greatsword that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
      "lore":"On the cliff facing the eastern sea, the ancestors worshiped the masters of Time and Anemo together. The two are intimately related, as expressed in the saying, \"Anemo brings stories while Time nurtures them.\" The sword tells a story of war, and was used in the enactment of war tales. Originally just a prop, its blade has been hardened by the passage of time. This sword once belonged to the Imunlaukr clan, a clan of brave and gifted warriors who fought hard and died young. In sacrificial ceremonies, they would enact duels between brave warriors stained black with blood. In the eyes of the Imunlaukr clan, combat existed not for protection, for glory, or for gaining territory. Rather, it was for the amusement of the gods, high up in the heavens, for whom little else could serve to entertain. Monsters and outlaws, they fought them all the same, with no regard for whether, this time, they would return to their beloveds afterwards. For none of that mattered. What mattered was to roar, loud and clear, in the heat of bloody battle. That was duty fulfilled. Such hot blood running through the veins should not have been conducive to a long history for the Imunlaukr clan. For their fight was one without end, and without hope of victory. And yet, as the snow slowly melted and Mondstadt began to take shape, gradually they realized: They had found something to fight for at last.",
      "image":"https://impact.moe/assets/img/weapon-icons/sacrificial-greatsword.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"sacrificial-sword",
      "name":"Sacrificial Sword",
      "type":"Sword",
      "rarity":4,
      "baseAtk":454,
      "subStatType":"Energy Recharge %",
      "subStat":61.3,
      "abilityName":"Composed",
      "abilityDescription":"After damaging an opponent with an Elemental Skill, the skill has a 40/50/60/70/80% chance to end its own CD. Can only occur once every 30/26/22/18/14s.",
      "description":"A ceremonial sword that has become petrified over time. The trinkets on it are still visible. It grants the wielder the power to withstand the winds of time.",
      "lore":"On the cliff facing the eastern sea, the ancestors worshiped the masters of Time and Anemo together. The two are intimately related, as expressed in the saying, \"Anemo brings stories while Time nurtures them.\" This sword tells the story of protection to show the courage to protect. Originally just a prop, its blade was sharpened by the passage of time. This sword once belonged to the kindly Gunnhildr clan. In sacrificial ceremonies, they would enact the defense of Mondstadt. There were three acts in the ceremony dedicated to the winds of time. The final act told a tale of the protection of Mondstadt, of life, and of freedom. The ceremony and its history have now been lost. But the Gunnhildr clan continues to act as guardians of Mondstadt to this day.",
      "image":"https://impact.moe/assets/img/weapon-icons/sacrificial-sword.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"seasoned-hunters-bow",
      "name":"Seasoned Hunter's Bow",
      "type":"Bow",
      "rarity":2,
      "baseAtk":243,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"A bow that has been well-polished by time and meticulously cared for by its owner. It feels almost like an extension of the archer's arm.",
      "lore":"A hunter must always be downwind, and must never walk upright on a mountain's ridge. It matters not if their target is beast, monster or the wicked — this method remains the same.",
      "image":"https://impact.moe/assets/img/weapon-icons/seasoned-hunters-bow.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"serpent-spine",
      "name":"Serpent Spine",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"CRIT Rate %",
      "subStat":27.6,
      "abilityName":"Wavesplitter",
      "abilityDescription":"Every 4s a character is on the field, they will deal 6% more DMG and take 3% more DMG. This effect has a maximum of 5 stacks and will not be reset if the character leaves the field, but will be cleared when the character takes DMG.",
      "description":"A rare weapon whose origin is the ancient ocean. One can hear the sound of the ageless waves as one swings it.",
      "lore":"A greatsword fashioned from the spine of a great sea monster, each eerie segment of bone a tale unto itself. In the past, seamen would use the bones of such monsters as figureheads, And with them frighten the beasts who dwelt in the deep sea, and who envied the land—dwellers. In the stormy oceans of the ancient past, those who put out to sea would often never be seen again. The carefree sea shanties of today were, in years long gone, farewell songs that left people in mournful silence. There was a greatsword-wielding captain in those days who enjoyed drinking and making merry before a voyage. When people questioned him, he laughed and said: \"I know myself. What is wine and song to me? Worry not. Once the sea and winds are right...\" But he would never finish that statement. He would only raise his mug, and call for all around to have another drink. Then, the day when the sea and winds came together arrived at last, and the stern of the great vessel rode them as it sailed. Deep into the misty sea it went, far across the darkening waves, into the ocean that teemed with sea creatures. And at last, neither the singing skipper nor his ship would ever return to the harbor ringed by mountains. After many days, the corpse of a sea monster from the deep was beached upon the shore by the waves. Brilliant white bone shone out from a great gash torn into it by a greatsword. Its blood had long been washed clean. \"When the sea and winds are right, I will go forth to sea and avenge her. O maiden charmed by the tidal song.\" \"So what if I sleep with the fishes? That way, I will be able to send my sea shanties into the deep where she dwells.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/serpent-spine.webp",
      "location":"BP Bounty",
      "stats":null
   },
   {
      "id":"sharpshooters-oath",
      "name":"Sharpshooter's Oath",
      "type":"Bow",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"CRIT DMG %",
      "subStat":46.9,
      "abilityName":"Precise",
      "abilityDescription":"Increases DMG against weak spots by 24/30/36/42/48%.",
      "description":"This superior bow once belonged to a master archer. However, it gives off a strong scent, thus making it unsuitable for hunting.",
      "lore":"A long time ago, in a place far, far away... Tragedy struck.\nBrothers took to arms against one another.\nOne among them was a great archer. After suffering a humiliating defeat, he made a vow:\n\"Until I have brought down my enemies,\"\n\"Until I have pierced their throats and their blood has run dry, I shall not clean my feet.\"\nAnd so, the great archer fell prey to a foot infection.",
      "image":"https://impact.moe/assets/img/weapon-icons/sharpshooters-oath.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"silver-sword",
      "name":"Silver Sword",
      "type":"Sword",
      "rarity":2,
      "baseAtk":243,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"A sword for chasing away demons. Everyone knows it's made of a silver alloy, not pure silver.",
      "lore":"Despite how the folk belief would have it, silver does not actually have any special ability to exorcise. It is the pure heart of the wandering exorcist that is the true bane of evil.",
      "image":"https://impact.moe/assets/img/weapon-icons/silver-sword.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"skyrider-greatsword",
      "name":"Skyrider Greatsword",
      "type":"Claymore",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"Physical DMG %",
      "subStat":43.9,
      "abilityName":"Courage",
      "abilityDescription":"On hit, Normal or Charged Attacks increase ATK by 6/7/8/9/10% for 6s. Max 4 stacks. Can only occur once every 0.5s.",
      "description":"A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword... for the second time.",
      "lore":"Feeling defeated, it dawned on the Skyrider that there are things that swordsmanship cannot achieve.\nSo instead of believing in his swordsmanship, he turned to the sword itself.\n\"Bigger is always better, and swords are no exception,\" he thought.\nIn the grand Guyun Stone Forest, he embraced his grand ending.\nHis dream of flight came to an end, but his sword and story would never fade...",
      "image":"https://impact.moe/assets/img/weapon-icons/skyrider-greatsword.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"skyrider-sword",
      "name":"Skyrider Sword",
      "type":"Sword",
      "rarity":3,
      "baseAtk":354,
      "subStatType":"Energy Recharge %",
      "subStat":51.7,
      "abilityName":"Determination",
      "abilityDescription":"Using an Elemental Burst grants a 12/15/18/21/24% increase in ATK and Movement SPD for 12s.",
      "description":"A reliable steel sword. The legendary Skyrider once tried to ride it as a flying sword...",
      "lore":"Leap, the master swordsman Skyrider did, from the heights of Jueyun Karst.\nHe pierced the clouds as the winds hollered by his ears,\nBut what followed was the sound of shattering.\nWhat he had hoped for was something swordsmanship could not bring him.\nHe pawned the sword for medicine,\nBut die it did not, his dream of flight.",
      "image":"https://impact.moe/assets/img/weapon-icons/skyrider-sword.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"skyward-atlas",
      "name":"Skyward Atlas",
      "type":"Catalyst",
      "rarity":5,
      "baseAtk":674,
      "subStatType":"ATK %",
      "subStat":33.1,
      "abilityName":"Wandering Clouds",
      "abilityDescription":"Increases Elemental DMG Bonus by 12/15/18/21/24%. Normal Attack hits have a 50% chance to earn the favor of the clouds. which actively seek out nearby enemies to attack for 15s, dealing 160/200/240/280/320% ATK DMG. Can only occur once every 30s.",
      "description":"A cloud atlas symbolizing Dvalin and its former master, the Anemo Archon. It details the winds and clouds of the northern regions and contains the powers of the sky and wind.",
      "lore":"An atlas of wind.\nA copy of the atlas pertaining to the weather of the northern regions, presented in the form of poems and images.\nIt consists of 100,000 odes, each dedicated to a single cloud or wind and calling it by name.\nThe cloud atlas gave form to the winds, and odes infused them with personality.\nThe myriad formless winds are now friends and family in the eyes of Barbatos.\n\nLegends tell that in ancient times, Barbatos summoned the four winds with the original version.\nHe thawed the snow, drove away vicious beasts, summoned rainfall, and created Mondstadt.\nHe permitted the atlas to be shared and copied among the people, giving it the name of Cloud Atlas.\nSadly, nothing survives the test of time. Certain drawings and odes were missing in the copies that survived.\nHowever, the knowledge passed on in the form of ballads and legends among the general public.\n\nThe histories of the thousand winds were not lost, for Barbatos still holds them.\nWhen Barbatos stood against the shadowy wings of the evil dragon Durin,\nHe sang to the thousand winds and called upon the Wind Dragon.\nHe who holds this atlas wields the true names of the thousand winds and all of their powers.\n\nNow the skies above Mondstadt are calm and blue.\nBarbatos and Dvalin have found a new place to call home.\nThe atlas, meanwhile, has been entrusted to one worthy of the honor.",
      "image":"https://impact.moe/assets/img/weapon-icons/skyward-atlas.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"skyward-blade",
      "name":"Skyward Blade",
      "type":"Sword",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"Energy Recharge %",
      "subStat":55.1,
      "abilityName":"Sky-Piercing Fang",
      "abilityDescription":"CRIT Rate increased by 4%. Gains Skypiercing Might upon using an Elemental Burst: Increases Movement SPD by 10%, increases ATK SPD by 10%, and increases the DMG of Normal and Charged Attack hits by 20% for 12s.",
      "description":"The sword of a knight that symbolizes the restored honor of Dvalin. The blessings of the Anemo Archon rest on the fuller of the blade, imbuing the sword with the powers of the sky and the wind.",
      "lore":"The sky-piercing fang. It once pierced the black-gold scales of the kingdom of the abyss, and cut the throats of the sons of ancient sinners.\nMondstadt was once threatened by the shadow dragon Durin.\nIts jealousy for Mondstadt's prosperity begot evil, poisoning the land.\nIn those dark days, Mondstadt was surrounded by monsters and barren lands.\nHearing the people's cry for help, the Anemo Archon descended and awoke Dvalin.\nDvalin rode the wind and soared up to the sky, fighting for all life.\n\nBlessed by the Anemo Archon, Dvalin fought the shadow dragon.\nClouds broke, and the sky burned red as if the end of days was upon Mondstadt.\nEventually, Dvalin's blessed fangs pierced through the throat of Durin.\nDurin fell, but Dvalin was poisoned by Durin's tainted blood.\n\nUnable to bear the pain, Dvalin fell unconscious.\nEven the most learned bards knew not where he slumbered.\nCenturies passed, and Dvalin's sacrifice was all but forgotten by Mondstadt.\nWhen Dvalin finally awoke, gone was his friend and the sound of his comforting lyre.\nAnd the ones he once protected now cowered in fear at the sight of him.\n\nHonor reclaimed, poison cleansed,\nBallads shall give back a people's forgotten memory.\nA prayer, this sword is. May Dvalin's name be restored.",
      "image":"https://impact.moe/assets/img/weapon-icons/skyward-blade.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"skyward-harp",
      "name":"Skyward Harp",
      "type":"Bow",
      "rarity":5,
      "baseAtk":674,
      "subStatType":"CRIT Rate %",
      "subStat":22.1,
      "abilityName":"Echoing Ballad",
      "abilityDescription":"Increases CRIT DMG by 20/25/30/35/40%. Hits have a 60/70/80/90/100% chance to inflict a small AoE attack, dealing 100% Physical ATK DMG. Can only occur once every 4s.",
      "description":"A greatbow that symbolizes Dvalin's affiliation with the Anemo Archon. The sound of the bow firing is music to the Anemo Archon's ears. It contains the power of the sky and wind within.",
      "lore":"The sky-piercing lyre.\nThe clear tunes of this lyre still echo in the hearts of the people and in the winds.\nIt is said that the ancient evil dragon from the abyss was enticed here by its tunes.\n\nIn ancient times, Barbatos softly strummed his lyre and summoned the pure thousand winds and songs.\nCharmed by the free-spirited winds and songs, Dvalin the high dragon descended and swore loyalty to him.\nBarbatos rejoiced in making a new friend, and entrusted the people of Mondstadt to Dvalin.\nAnd so, the wandering Anemo Archon and the Wind Dragon forged Mondstadt's dawn with their relationship.\n\nThe floating tunes of the lyre halted the shadow dragon's attack in the final battle.\nGranting Dvalin the chance to end the shadow dragon's poisonous reign.\n\nEons after the winds sang and the vicious battle ended, Dvalin awoke from his long slumber.\nBut gone was his master, and instead he was met by the poisonous whispers of the Abyss Order.\nUnseen pain. Unheard torture.\nAn all-engulfing sorrow crushed the poisoned Dvalin's spirit.\n\nDvalin turned on what he vowed to protect,\nAnd accursed the one to whom he had sworn loyalty:\n\"Indifferent is Barbatos to my pain! A careless friend is he!\"\n\"Curse you, Barbatos, cruelest of the Archons!\"\n\nThe furious friend knew not that Barbatos sought to save him.\nFor many fond memories may have been quashed by Dvalin's anguish, but not that of Barbatos' lyre. The Holy Lyre der Himmel.\nSoon, centuries of misunderstanding shall be gone.\nSoon, Dvalin shall hear once more his songs.",
      "image":"https://impact.moe/assets/img/weapon-icons/skyward-harp.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"skyward-pride",
      "name":"Skyward Pride",
      "type":"Claymore",
      "rarity":5,
      "baseAtk":674,
      "subStatType":"Energy Recharge %",
      "subStat":36.8,
      "abilityName":"Sky-Ripping Dragon Spine",
      "abilityDescription":"Increases all DMG by 8/10/12/14/16%. After using an Elemental Burst, Normal or Charged Attack, on hit, creates a vacuum blade that does 80/100/120/140/160% Physical DMG to enemies along its path. Lasts for 20s or 8 vacuum blades.",
      "description":"A claymore that symbolizes the pride of Dvalin soaring through the skies. When swung, it emits a deep hum as the full force of Dvalin's command of the sky and the wind is unleashed.",
      "lore":"",
      "image":"https://impact.moe/assets/img/weapon-icons/skyward-pride.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"skyward-spine",
      "name":"Skyward Spine",
      "type":"Polearm",
      "rarity":5,
      "baseAtk":674,
      "subStatType":"Energy Recharge %",
      "subStat":36.8,
      "abilityName":"Blackwing",
      "abilityDescription":"Increases CRIT Rate by 8/10/12/14/16% and increases Normal ATK SPD by 12%. Additionally, Normal and Charged Attacks hits on enemies have a 50% chance to trigger a vacuum blade that deals 40/55/70/85/100% of ATK as DMG in a small AoE. This effect can occur no more than once every 2s.",
      "description":"A polearm that symbolizes Dvalin's fire resolve. The upright shaft of this weapon points towards the heavens, clad in the might of sky and wind.",
      "lore":"A spine that holds up the sky.\nThe true companion of the Anemo Archon never wavered in its desire to protect the land of wind.\nThis unshakeable resolve sustained the wind dragon through its mortal battle against its vile nemesis.\n\nIn olden times, the shadow dragon Durin, covetous of the peace Mondstadt enjoyed, came forth to defile the land.\nDurin's black wings blotted out the sky, releasing clouds of toxic fumes,\nSo much so that even the thousand winds could not hold their pestilence and rot at bay,\nAnd thus fell black rain from the skies, the din of their downpour drowning the cries and groans of the people.\nThe Anemo Archon was awakened by the sound of their agony, and his heart was pierced by their despair.\nSo he summoned Dvalin to his side, and shrouding themselves in storm, they pierced through the poisoned skies.\n\nThe great dragon plunged in with a cry, tearing a swathe through the noxious nimbus the shadow dragon had created.\nFollowing his wings came a great, swift whirlwind that destroyed those venomous clouds.\nDvalin seized the poisonous dragon in his mighty claws, ascending to heights that even clouds could not fathom.\nThe poisonous rain had scattered as the clouds had been left behind, and the burning skies became the dragons' battleground.\n\nAt last the wind dragon's razor fangs pierced his foe's throat, and his great claws tore out its corrupted heart.\nThe sinners' creation, filled with eternal regret, fell from the spotless skies and fell to ruin upon a snowy peak.\nThat fierce battle in the distant skies had thus defended the people of the Anemo Archon.\nBut at the moment of his triumph, the venomous ichor of his foe had flowed between his teeth and into his guts.\n\nThe pain withered bone and marrow, and in his agony the great wind dragon curled up in the depths of an ancient ruin.\n...Nursing his wounds, Dvalin still believed that one day, he would be reawakened.\nHe would again pierce the heavens, scatter the darkness, and sing to the sounds of the lyre of the Anemo Archon, his dear friend.",
      "image":"https://impact.moe/assets/img/weapon-icons/skyward-spine.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"slingshot",
      "name":"Slingshot",
      "type":"Bow",
      "rarity":3,
      "baseAtk":354,
      "subStatType":"CRIT Rate %",
      "subStat":31.2,
      "abilityName":"Slingshot",
      "abilityDescription":"If a Normal Attack or Aimed Shot hits a target within 0.3s of being fired, increases DMG by 36/42/48/54/60%; otherwise, it decreases DMG by 10%.",
      "description":"A bow, despite the name. After countless experiments and improvements to the design, the creator of the ultimate slingshot found himself to have made what was actually a bow.",
      "lore":"One who wished to improve the range and accuracy of slingshots discovered that\nPower increases range, but costs accuracy.\nSo slingshot rocks were replaced with long wooden poles that sported feathers for stability.\nThe slingshot's limbs were lengthened and the ends recurved to increase pull.\nIt then dawned on him that he had made a bow.",
      "image":"https://impact.moe/assets/img/weapon-icons/slingshot.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"snow-tombed-starsilver",
      "name":"Snow-Tombed Starsilver",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Physical DMG %",
      "subStat":34.5,
      "abilityName":"Frost Burial",
      "abilityDescription":"Hitting an opponent with Normal and Charged Attacks has a 60/70/80/90/100% chance of forming and dropping an Everfrost Icicle above them, dealing 80/95/110/125/140% AoE ATK DMG. Opponents affected by Cryo are dealt 200/240/280/320/360% ATK DMG. Can only occur once every 10s.",
      "description":"An ancient greatsword that was stored between frescoes. Forged from Starsilver, it has the power to cleave through ice and snow.",
      "lore":"When the verdant city was sealed by cloud and mist,\nWhen the unending snowstorms blotted out the clear moonlight,\nWhen all life and every interrupted story,\nWas pierced by that nail that fell from the azure skies...\n\nThe priest's daughter gave the Starsilver greatsword to the hero from another land,\nIn the howling wind and snow, her words could not reach their intended target.\n\n\"This fourth fresco is prepared for you. Your likeness will forever remain on this wall.\"\n\"For the sake of that fresco, and for everyone, I will wait for you, and pray for your return...\"\n\nWhen the daughter of that snow-entombed city withered together with the grafted yet barren silver branches,\nThe outlander destined to wield this sword to shatter ice and snow alike was far afield, chasing answers.\nBright as the moonlight though she was, her final words, too, would never reach that wayfarer.\n\n\"It's been a while since I last saw the blue sky and green grass. I don't know which hues to use to capture the landscape of thawing ice and snow that my father so longs for.\"\n\"I wish I could see you again...\"\n\nThis was the answer he found-\n\nThe hero ended his fruitless journey at last.\nTainted black blood dripped from the blade of his greatsword,\nAs he trudged through now-foreign snowy paths.\nBut when he returned to the great hall of that mountain country,\nNaught but ringing deathly echoes welcomed him.\n\"So even here, there is nothing left for me to protect...\"\n\"You who dwell in the heavens, you must wish for naught but to watch our ashen suffering here below.\"\n\"In that case, then let me help you pass the time with a song of iron and blood.\"\nThe outlander left the Starsilver originally meant to shatter snow and wind alike between the frescoes.\nThen, he descended the mountain to search for a land full of war and strife - a place he might paint red with blood.",
      "image":"https://impact.moe/assets/img/weapon-icons/snow-tombed-starsilver.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"solar-pearl",
      "name":"Solar Pearl",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"CRIT Rate %",
      "subStat":27.6,
      "abilityName":"Solar Shine",
      "abilityDescription":"Normal Attack hits increase Elemental Skill and Elemental Burst DMG by 20/25/30/35/40% for 6s. Likewise, Elemental Skill or Elemental Burst hits increase Normal Attack DMG by 20/25/30/35/40% for 6s.",
      "description":"A dull, golden pearl made of an unknown substance that harbors the light of the sun and the moon, and pulse with a warm strength.",
      "lore":"Rumored to be a legendary orb of Liyue.\nIt once absorbed all the light in the world, but was kept inside a wooden box for millennia afterwards.\nEven so, its power has not dissipated. Now released from its container, it shines evermore.\nIn the hands of a truly knowledgeable sage, perhaps its extraordinary power would finally be unleashed after lying dormant for millennia.\n\nA story that has long been popular with the jewelers of Liyue holds that the master craftsman Kunwu once took the light of the heavenly bodies and sealed it in a wooden box.\nKunwu then buried that box deep inside a dark rocky chamber, where it remained in pitch blackness for forty-nine days and twenty hours, till finally the pearl within had absorbed the shine of the sun and moon.\n\nA most bizarre tale indeed. And yet, to this day, many in Liyue hold steadfastly to their belief in the esoteric talents of the master craftsman Kunwu.\nSomeone once plucked up the courage to ask the aging craftsman what his secret was. The eccentric old man laughed off the nonsensical notion of his mystical capabilities:\n\"Pfft! 'Twas purely the product prolonged polishing!\"\n\nBut his apprentice revealed a different story when asked about it in private: Just as Kunwu finished polishing the Solar Pearl, the splendor of the heavens shone down and a crimson moon filled the sky.\nBut did this phenomenon mean that Kunwu had indeed received divine assistance in his craft? Or was it a measure of his own accomplishment that his lofty ambitions had sufficed to send waves through the firmament and even elicit a response from the heavenly bodies?",
      "image":"https://impact.moe/assets/img/weapon-icons/solar-pearl.webp",
      "location":"BP Bounty",
      "stats":null
   },
   {
      "id":"song-of-broken-pines",
      "name":"Song of Broken Pines",
      "type":"Claymore",
      "rarity":5,
      "baseAtk":741,
      "subStatType":"Physical DMG %",
      "subStat":20.7,
      "abilityName":"Rebel's Banner Hymn",
      "abilityDescription":"A part of the \"Millennial Movement\" that wanders amidst the winds. Increases ATK by 16/20/24/28/32%, and when Normal or Charged Attacks hit opponents, the character gains a Sigil of Whispers. This effect can be triggered once every 0.3s.\n\nWhen you possess four Sigils of Whispers, all of them will be consumed and all nearby party members will obtain the \"Millennial Movement: Banner-Hymn\" effect for 12s. \"Millennial Movement: Banner-Hymn\" increases Normal ATK SPD by 12/15/18/21/24% and increases ATK by 20/25/30/35/40%.\n\nOnce this effect is triggered, you will not gain Sigils of Whispers for 20s. Of the many effects of the \"Millennial Movement\", buffs of the same type will not stack.",
      "description":"A greatsword as light as the sigh of grass in the breeze, yet as merciless to the corrupt as a typhoon.",
      "lore":"There was once a popular folk song that went like this:\n\"Toss to the bard all the coins you can spare,\"\n\"Give your bouquet to yon maiden so fair,\"\n\"Take wine so bitter it makes the tears flow,\"\n\"Drink to the yesterday now been and gone, and sing for tomorrow that comes with the dawn.\"\n\nIn the land where songs and music carry on the wind, the people have merry yet sensitive souls.\nIt is said that there were times in history when the tyrant Decarabian and the ruling aristocrats would ban certain chords and tunes,\nFor discerning people could sense the spirit of resistance that lay behind the music of the bards and singers.\nSongs and hymns had also indeed been used before as a way for rebels to communicate.\n\nIn the days of the ruling aristocracy, the Church that revered the Anemo Archon was once split in twain by a schism:\nOn one side stood the clergy, who ate at the lords' table, and overturned the archon's statues with them even as they wrote songs and hymns of praise.\nOn the other stood the saints, who held no clerical office, and who walked the streets, the wine cellars, and the world beyond the walls.\nThese saints drank cheap moonshine, blessing the slave and the plebeian with the original holy manuscripts that circulated amongst the people and with words that the wind brought to them.\nAnd while they did so, they penned forbidden songs and poetry.\n\nWhen the gladiator from a foreign land arose together with the re-awakened Anemo Archon and raised the banner of rebellion,\nThe aged saint known as the Nameless Shepherd mobilized the true adherents of the Church of Favonius.\nTogether with many others, they spilled their martyred blood upon these emerald fields.\nAnd together, they sang a rallying cry to save the nation, the hitherto-unsung half of that folk song of old:\n\n\"Leave the keen steel to those who will give their lives for the fight,\"\n\"Prepare the thieves' gallows,\"\n\"Sharpen your rusted arrows,\"\n\"For when the music sounds, we shoot the beasts down.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/song-of-broken-pines.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"staff-of-homa",
      "name":"Staff of Homa",
      "type":"Polearm",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"CRIT DMG %",
      "subStat":66.2,
      "abilityName":"Reckless Cinnabar",
      "abilityDescription":"HP increased by 20/25/30/35/40%. Additionally, provides an ATK Bonus based on 0.8/1/1.2/1.4/1.6% of the wielder's Max HP. When the wielder's HP is less than 50%, this ATK bonus is increased by an additional 1/1.2/1.4/1.6/1.8% of Max HP.",
      "description":"A \"firewood staff\" that was once used in ancient and long-lost rituals.",
      "lore":"To cleanse by fire all that is impure, to allow the impurities to rise with the flames unto the all-accommodating high heavens.\nThese rites would see fresh tinder lit during the rainy seasons, and wolf smoke would arise from those fires as prayers for blessings and the defeat of evil.\n\nThese blazing rituals were especially commonplace during that ancient period of strife.\nFor the dreams and delusions of the silent corpses of gods would produce evil miasmas,\nSnatching away the citizens who were no longer theirs, and those who never were theirs also.\n\nThen, a merciful doctor heard a whisper from within the flame as fierce as the red sunset,\nFrom within the crackling and snapping of withered grass.\n\"Only an unbound flame can purify the filth of this world.\"\n\"Lift up this scarlet firewood. With it, you shall repel every demon.\"\n\nSo the doctor took up that devilishly red staff, igniting all that was impure.\nThose who have passed, unable to bear deep sadness, but who have since become shrouded by ill karma and calamity,\nThey shall be reduced to ashen butterflies in this flame, and receive relief from their misfortunes and hurts.\nAs for the doctor who lit those countless flames, legend has it that they, too, were reduced to smoke in the shape of a lovely butterfly.\n\nThough these rites have been forgotten over time and with the coming of peace,\nThose with fire in their hearts can still hear these whispered words from flickering flames when they find themselves faced with an imposing darkness:\n\"Only an unbound flame can purify this world.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/staff-of-homa.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"summit-shaper",
      "name":"Summit Shaper",
      "type":"Sword",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"ATK %",
      "subStat":49.6,
      "abilityName":"Golden Majesty",
      "abilityDescription":"Increases Shield Strength by 20/25/30/35/40%. Scoring hits on opponents increases ATK by 4/5/6/7/8% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield, this ATK increase effect is increased by 100%.",
      "description":"A symbol of a legendary pact, this sharp blade once cut off the peak of a mountain.",
      "lore":"In the distant past, when the gods and spirits walked the land,\n\nWhen all the land was in turmoil, people must have asked such questions...\n\n\"Please tell me: where have my lover and children gone?\"\n\n\"When will those who have departed return to us?\"\n\n\"O great lord, how long will these horrific times persist?\"\n\n\nEven the hearts of people hewn from the hardest bedrock would crack and break from the pain.\n\nEven the eyes of those who remained silent, stoic in their unswerving faith in their gods, would begin to smolder.\n\nEven if they did not ask such questions, their hearts would make the sounds.\n\n\nThe ruler of Geo thus put forth his might and carved a long blade from a pure slab of golden Cor Lapis.\n\nWith a single slice, he cut a corner clean off a mountain, and upon it he swore a most solemn oath to the people-\n\nThose scattered, he would gather – and those who broke the contract, he would punish.\n\nThose who had lost their loved ones, those robbed of their possessions, those deprived of justice – they would receive recompense.\n\n\nPerhaps this is but one of the many tales that shroud the ancient land of Liyue.\n\nBut the solemn oath that Rex Lapis swore is nonetheless at work within it.\n\nTo break a contract is to make an enemy of this land where gods once ruled,\n\nAnd sooner or later, the mountain Rex Lapis cut will fall upon those who break contracts-\n\n\nA legend still circulates, saying that this weapon's true owner will one day return to walk among mortals.\n\nThen, this sword will once again gleam gold, and its light will cut through the greatest of this world's injustices...\n\nJust as it did when Rex Lapis made his solemn oath before the people.",
      "image":"https://impact.moe/assets/img/weapon-icons/summit-shaper.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"sword-of-descension",
      "name":"Sword of Descension",
      "type":"Sword",
      "rarity":4,
      "baseAtk":440,
      "subStatType":"ATK %",
      "subStat":35.2,
      "abilityName":"Descension",
      "abilityDescription":"Effective for players on PlayStation Network only. Hitting enemies with Normal or Charged Attacks grants a 50% chance to deal 200% ATK as DMG in a small AoE. This effect can only occur once every 10s. Additionally, if the Traveler equips the Sword of Descension, their ATK is increased by 66.",
      "description":"A sword of unique craftsmanship. It does not appear to belong to this world.",
      "lore":"This is a proof that you came to this world via special means.\nOnly one who has challenged the \"world\" may wield such a sword.\n\nWhen this sword was last drawn, humankind was trying to preserve a doomed world.\nThat world was their last and only home.\nThis sword was drawn to defy that fate of destruction.\n—But to draw steel against the law of universe that \"all who exist must one day perish...\"\nSurely it must have seemed the height of folly.\n\nBut really, when one is faced when such a final fate, when up against the star-devouring darkness,\nWhat weapon would be fitting for one to wield? It can only be a sword. If nothing else, it shall bear the memory of those who faced their ends without fear...\n\nWhen you wield this sword, you search for the answers hidden within this world.\nIn this world, such a weapon may be used without any problem.\nNot for the fact that the universe casts no shadows here, and certainly not simply because it suits this world's aesthetics...\nBut because this search is perhaps why you descended to this realm in the first place.\n\nWhen the past is dust, and the future arrives,\nAs the present fades away, you can trust to this blade's edge.\nHaving a weapon for self-defense is, of course, a good idea. After all, this one was forged for one such as yourself.\nSomeone who challenges and pursues.\nTake it, walk this earth,\n\nAnd cut open all the challenges and mysteries that it has to offer you.",
      "image":"https://impact.moe/assets/img/weapon-icons/sword-of-descension.webp",
      "location":"PlayStation Exclusive",
      "stats":null
   },
   {
      "id":"the-alley-flash",
      "name":"The Alley Flash",
      "type":"Sword",
      "rarity":4,
      "baseAtk":620,
      "subStatType":"Elemental Mastery",
      "subStat":51,
      "abilityName":"Itinerant Hero",
      "abilityDescription":"Increases DMG dealt by the character equipping this weapon by 12/15/18/21/24%. Taking DMG disables this effect for 5s.",
      "description":"A straight sword as black as the night. It once belonged to a thief who roamed the benighted streets.",
      "lore":"A mighty and noble longsword that bursts forth like a flash of light from the depths of the night.\nTo the end, not even once was the sword's edge marred by blood.\nIt is said that over the generations, many swords crafted for the noblest of knights have been based on this design.\n\nThe darkened blade blended into the nights of yore with ease,\nFor in those days, people feared to light fires in the nighttime.\nAccording the songs of some bards, it was stained black during the age of the aristocracy.\n\nReading the tales and songs of his upright ancestors sowed seeds of rebellion in the young noble's heart.\nWhen the time came, he forsook his venerable house, stole this sword, and hid himself in the streets.\nThere he roamed the dark alleys and taverns like the common folk, and put his noble swordsmanship to use by robbing the rich to give to the poor.\nUnder cover of night, the sword from an opulent arsenal leaped across roofs and streets in the hands of one with equally noble blood.\nThe blade's pristine edge remained unblemished, as did the heart of the gentleman thief who had forsaken his corrupt lineage.\n\nBut wine and song and youth would fade, and many things would happen.\nIn the end, when under moonlight he buried his beloved blade and fled across the sea,\nHe remembered that night when he had stolen it from his family's vault,\nAnd he remembered his vow to his family, to past and present, to his land, and to his sworn brother Eberhart:\n\"Even if only by a little, I want to use my strength to turn this dark world around.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/the-alley-flash.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"the-bell",
      "name":"The Bell",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"HP %",
      "subStat":41.3,
      "abilityName":"Rebellious Guardian",
      "abilityDescription":"Taking DMG generates a shield which absorbs DMG up to 20/23/26/29/32% of Max HP. This shield lasts for 10s or until broken, and can only be triggered once every 45s. While protected by the shield, the character gains 12/15/18/21/24% increased DMG.",
      "description":"A heavy greatsword. A clock is embedded within it, though its internal mechanisms have long been damaged.",
      "lore":"A strange greatsword decorated with an exquisite clock.\nThe distinctive sound of clockwork served as a combat rhythm for the wielder and their friends.\nAfter the Wanderer's Troupe disbanded, the greatsword was soaked in acid. The gears have rusted because of this.\nEven so, it still makes a lethal weapon.\n\nOne by the name of Kreuzlied traveled with the Wanderer's Troupe. Once a member of the ruling Lawrence clan, now a traitor and outcast.\nIn that time, scholars and bards paid no heed to history. For the Aristocracy preferred to remain willfully ignorant of their own moral degeneracy than face history's judgement.\nBut the aristocrats trembled in fear at the sound of this blade as it flew through the air, for it was the toll of the bell of judgment.\n\nIt was not made public what punishment Kreuzlied met with after the failed uprising. This in itself is a testament to his privileged origins.\nLegend says that after being dismissed from office, his desire to continue the legacy of his fellow rebels led him to establish a secret society aimed at bringing down the Aristocracy.\nIt is also said that he gave his full assistance to the enslaved gladiator when she revolted.\n\nFurther in the past, the popular rumor was that Kreuzlied's secret society was working constantly in the background,\nHelping the Knights of Favonius keep Mondstadt safe through deeds that no knight should ever be party to.\nIt was even said that the Wolf Pup Rostam ran this organization in secret, behind the Grand Master's back.",
      "image":"https://impact.moe/assets/img/weapon-icons/the-bell.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"the-black-sword",
      "name":"The Black Sword",
      "type":"Sword",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"CRIT Rate %",
      "subStat":27.6,
      "abilityName":"Justice",
      "abilityDescription":"Increases DMG dealt by Normal and Charged Attacks by 20%. Additionally, regenerates 60% of ATK as HP when Normal and Charged Attacks score a CRIT Hit. This effect can occur once every 5s.",
      "description":"A pitch-black longsword that thirsts for violence and conflict. It is said that this weapon can cause its user to become drunk on the red wine of slaughter.",
      "lore":"A blade that thirsts after fresh blood will be awakened by its scent. Those who possess, wield and nourish it will keep killing. Till even a pure soul is blackened by bloodshed... There once was a bright white knight, who longed ever for the path of justice. Clad in burnished armor, a mirror-sheen sword hung from his hip. Wherever there was injustice, man-eating beast, or fire in the distance, The Knight would ride up in haste to cut, slash, and pierce. Following the teachings of the Wolf Pup, who taught him chivalry, justice and swordsmanship, He cut, slashed and pierced them from head to toe... Till justice had run its course, and the monster moved no more. \"I began to lose myself in cutting, slashing and piercing.\" \"When my blade's edge met my foe's flesh, it sent a tingle up my spine.\" \"Ah, I thought. That must be the feeling of justice getting its due.\" \"As long as I cut, slash and pierce the evil in this twisted world,\" \"Someday, someday, it shall all be cleansed.\" \"O, foolish knight, slaughter in the name of justice is slaughter still.\" \"Nay. Slaughter in the name of justice is justice.\" Cut. Slash. Pierce. Thus will you see justice done! Though the white flowers the maidens offer you should be bloodied black, though your sword should no longer gleam bright, Though your fair countenance should turn hideous, and you should be forced to don an iron mask, Though those you defend cannot understand you, cease never! And so, the black-stained knight persisted on his path, pursuing monsters in the name of justice, Until he came upon an ancient, ruined realm, where he discovered the ultimate injustice...",
      "image":"https://impact.moe/assets/img/weapon-icons/the-black-sword.webp",
      "location":"BP Bounty",
      "stats":null
   },
   {
      "id":"the-catch",
      "name":"The Catch",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Energy Recharge %",
      "subStat":45.9,
      "abilityName":"Shanty",
      "abilityDescription":"Increases Elemental Burst DMG by 16/20/24/28/32% and Elemental Burst CRIT Rate by 6/7.5/9/10.5/12%.",
      "description":"In the distant past, this was the beloved spear of a famed Inazuman bandit.",
      "lore":"The favored barbed spear of a famous Inazuman bandit. It was originally a harpoon used to catch fish, but it was also very handy in battle. They say that he even pierced the enchanted, sword-armed puppet before carrying it off.\n\"Haha! Once, I was the master of this ship, the 'Seiraimaru.'\"\n\"I commanded over ten ships, and they called me the Deathless Oni of Seirai.\"\n\"Now, I am but a leaf floating upon the waves.\"\n\"If not for Janome and the people marooned on those islands,\"\n\"Forget raising our sails again - I doubt I would have managed to make it back to my home shores.\"\n\"And yet Seirai now looks like this.\"\n\"There is no longer any place for me in the Inazuman Islands.\"\n\"Even that naggy, fretful old shrine maiden is gone...\"\n\n\nThe bandit named Ako Domeki's voice was thick with emotion. Then he said...\n\"Hey Janome! I'm now the freest man in the whole wide world!\"\n\"Aunt Shrine Maiden! Didn't you see[sic] that you wanted to go see the world?\"\n\"You know, go some place else, like that Kannagara guy or that Konbumaru you always talk about?\"\n\"You know what? Let me, Ako Domeki Zaemon, go in your stead!\"\n\"Let me go see what the edge of the world really looks like!\"\n\n\n\"We'll meet again where all ship routes end!\"\n\"And when we do, it'll be my turn to tell you all about these distant lands!\" ",
      "image":"https://impact.moe/assets/img/weapon-icons/the-catch.webp",
      "location":"Inazuma Fishing Association",
      "stats":null
   },
   {
      "id":"the-flute",
      "name":"The Flute",
      "type":"Sword",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"ATK %",
      "subStat":41.3,
      "abilityName":"Chord",
      "abilityDescription":"Normal or Charged Attacks grant a Harmonic on hits. Gaining 5 Harmonics triggers the power of music and deals 100/125/150/175/200% ATK DMG to surrounding enemies. Harmonics last up to 30s, and a maximum of 1 can be gained every 0.5s.",
      "description":"Beneath its rusty exterior is a lavishly decorated thin blade. It swings as swiftly as the wind.",
      "lore":"A nimble sword with holes and delicate engravings on the blade. The sword once made the sound of a flute when wielded by one with the requisite skill. The pitch and tone were determined by the swinging angle.\nThis sword was buried when the Wanderer's Troupe disbanded. Unearthed years later, it has long since lost its ability to sing. Even so, it still makes for a lethal weapon.\n\nAmong the members of the Wanderer's Troupe was a valiant sword-wielding dancer.\nAfter the Troupe's attempt to tear down the ruling class failed, she was enslaved as a gladiator.\n\nThough all her hope and all her companions were lost, still she fought bravely.\nHer sword sang with the radiance of the morn's light, and she was dubbed the \"Dawnlight Swordswoman.\"\n\nIn his youth, the Dawn Knight Ragnvindr was in the retinue of a knight.\nHe went with his master to watch a gladiator match, and was moved by the Dawnlight Swordswoman's splendid finale.\nHe named himself the Dawn Knight in her honor, and knew in his heart what he must do next.",
      "image":"https://impact.moe/assets/img/weapon-icons/the-flute.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"the-stringless",
      "name":"The Stringless",
      "type":"Bow",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Elemental Mastery",
      "subStat":165,
      "abilityName":"Arrowless Song",
      "abilityDescription":"Increases Elemental Skill and Elemental Burst DMG by 24/30/36/42/48%.",
      "description":"A bow that once served as an extraordinary instrument. It is no longer capable of getting people up and dancing.",
      "lore":"An exquisite instrument with strings of different materials on every section.\nWhen struck, every string trembles, creating flowing music.\nBut it is also a bow, one capable of firing arrows that target the heart. Where the music from this instrument leads, death shall surely follow.\n\nAfter the Wanderer's Troupe disbanded, the harp's strings were cut with a dull blade, creating ear-piercing noises.\nOnly the bowstring remains. The instrument's lofty melodies are lost, but it remains a deadly weapon.\n\nThe Wanderer's Troupe could make birds fall from the sky, sometimes with the tune of the harp, sometimes with the arrows that followed the tune through the air.\nJust like the wind that elopes with the harp's tune and the flowers that grow on Starsnatch Cliff, the harpist was both playful and determined.\nAfter the uprising failed, the Wanderer's Troupe disbanded and its members fled.\nThe harpist stayed till the end, deftly plucking the instrument's strings and raining down a torrent of arrows to protect his comrades. He played till he exhausted his repertoire, and his arrows.\n\nThe harpist was from the magnificent and enchanting land of Fontaine. He had left to travel the world in search of his true destiny.\nIt is said that all the ladies of the Court of Fontaine wailed with grief when they heard the tragic news that he had left without saying goodbye.\n\nThe story is that he fell in love with a humble Mondstadt woman, but she was then selected for the miserable fate of Ludi Harpastum princess.\nIt is claimed that he had no regrets about dying anonymously in a foreign land.\nThe only thing he regretted was finally discovering true love, only to never have the chance to sing another love song.",
      "image":"https://impact.moe/assets/img/weapon-icons/the-stringless.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"the-unforged",
      "name":"The Unforged",
      "type":"Claymore",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"ATK %",
      "subStat":49.6,
      "abilityName":"Golden Majesty",
      "abilityDescription":"Increases Shield Strength by 20/25/30/35/40%. Scoring hits on opponents increases ATK by 4/5/6/7/8% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield this ATK increase effect is increased by 100%",
      "description":"Capable of driving away evil spirits and wicked people alike, this edgeless claymore seems to possess divine might.",
      "lore":"A long time ago, a dragon there was to be found in Liyue.\nNot a dragon that soared the skies, but one whose abode was the mountains.\nIndeed, this ancient dragon of stone was as large as the very mountains it called home.\nThe legends say that it slumbered in Nantianmen, seeming not at all unlike the surrounding hills.\nBut when it awakened, even the tiniest movement, or the slightest stretch...\nThat would cause the earth to tremble and shake.\nThen, Rex Lapis came before the dragon, seeking to stop the earth's quailing.\nThey say that for a long while, the land knew peace,\nAnd that Rex Lapis gained another comrade by his side.\nBut in the end, the union of dragons, gods and men was perhaps not to be...\nThe dragon was sealed in the bowels of the earth. Fearing the ire of the gods and the adepti,\nThe Geovishaps, who once heeded the trembling of the rock and wrought havoc alongside the dragon,\nFled into the roots of the mountains. But as millennia passed, the dragon began to stir once again...\nThe legends hold that those who triumphed over the dragon stabbed this sword into the ground next to the giant tree that subdued the ancient dragon.\nAs one of the seals, monsters and malevolent mortals would be unable to touch it.\nIndeed, if the legends are true, only those with hearts as pure as clear mirrors could even come near it.\nYet, if those legends are true, how did this sword come to be lost?",
      "image":"https://impact.moe/assets/img/weapon-icons/the-unforged.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"the-viridescent-hunt",
      "name":"The Viridescent Hunt",
      "type":"Bow",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"CRIT Rate %",
      "subStat":27.6,
      "abilityName":"Verdant Wind",
      "abilityDescription":"Upon hit, Normal and Aimed Shot Attacks have a 50% chance to generate a Cyclone, which will continuously attract surrounding enemies, dealing 40% of ATK as DMG to these enemies every 0.5s for 4s. This effect can only occur once every 14s.",
      "description":"A pure green hunting bow. This once belongs to a certain hunter whose home was the forest.",
      "lore":"This bow once belonged to a certain hunter, and its green color was such that it could blend in with the natural environment.\nTo be as pure as the beasts of the verdant fields, who roam in the forests in the light of day.\nTo never bear any ill-will, and to never loose an arrow for any reason but to survive.\n\nThe nameless hunter was taught thus, and grew thus, far away from the city.\n\"We were born of the greenery. As long as there is grass and shade, we shall move unimpeded.\"\n\"We are the same as beast and bird. As long as we follow the laws of nature, then we shall not fear death.\"\n\"All those who follow nature, when their life reaches its last ebb, shall head towards that endless plain.\"\n\nFollowing these precepts, the hunter left no traces, and fought not against the natural order.\nShe comforted the wild beasts that had been shot through the heart, until their lives had returned to nature.\nIf that calamity had not happened, if she had not tracked the tainted blood upon the leaves,\nIf she had not met that dying, blind youth under the tree where she often napped,\nThen perhaps she may never have been shaken by thoughts of revenge, by blood and fire...\n\n\"Never forget, good Viridescent.\"\n\"Never forget that you belong to the green, child of the forest.\"\n\"Never loose your arrow for war, for revenge, or for glory.\"\n\"For the bloodstained shall never find yonder hunting fields of endless viridescence.\"\n\n\"Then at least do not let this bow be tainted by my mortal vengeance.\"\n\"I cannot reach the other side, whether to meet my master or the parents whom I have never met.\"\n\"But at least let this bow remain pure, and let it carry my thoughts and regrets to them.\"",
      "image":"https://impact.moe/assets/img/weapon-icons/the-viridescent-hunt.webp",
      "location":"BP Bounty",
      "stats":null
   },
   {
      "id":"the-widsith",
      "name":"The Widsith",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"CRIT DMG %",
      "subStat":55.1,
      "abilityName":"Debut",
      "abilityDescription":"When a character takes the field, they will gain a random theme song for 10s. This can only occur once every 30s.\n\nRecitative: ATK is increased by 60/75/90/105/120%.\nAria: Increases all Elemental DMG by 48/60/72/84/96%.\nInterlude: Elemental Mastery is increased by 240/300/360/420/480.",
      "description":"A heavy notebook filled with musical scores. Though suffering from moth damage and heavy wear-and-tear, there is still much power to be found among the hand-written words within.",
      "lore":"A notebook that was shared among the members of the Wanderer's Troupe. It contains musical scores and travel journals. The history of the troupe has been lost, since it was disbanded before Mondstadt was rebuilt.\nThe notebook records the experiences of the Troupe, the lands they roamed and the worlds they witnessed.\nIt siphons great power from the records of the Troupe's performances as well as the cheering of the crowds they performed for.\n\nThe Wanderer's Troupe was founded during the reign of the Aristocracy.\nMany referred to it as the Swordsman's Troupe — some out of hope, others out of fear.\nEven poems and songs were denied the right to freedom in that era.\n\nFor flutes they had swords, for harps they had bows, and their song was an anthem of rebellion.\nTheir final act was an attempt to storm the city and impose the death sentence upon its tyrannical rulers.\n\nThe Swordsman's Troupe had gone, and with it the memory of their rebellion.\nBut the spirit of resistance they embodied will always flow in Mondstadters' veins.",
      "image":"https://impact.moe/assets/img/weapon-icons/the-widsith.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"thrilling-tales-of-dragon-slayers",
      "name":"Thrilling Tales of Dragon Slayers",
      "type":"Catalyst",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"HP %",
      "subStat":35.2,
      "abilityName":"Legacy",
      "abilityDescription":"When switching characters, the new character taking the field has their ATK increased by 24/30/36/42/48% for 10s. This effect can only occur once every 20s.",
      "description":"A fictional story of a band of five heroes who go off on a dragon hunt. It is poorly written and structurally incoherent. Its value lies in the many lessons that can be learned from failure.",
      "lore":"Five Heroes embarked on a journey to slay the evil dragon.\nFor honor, the master swordsman.\nFor research, the knowledgeable sorceress.\nFor bounty, the swashbuckling mercenary.\nFor vengeance, the deadeye marksman.\nFor stories, the grand novelist.\nA lotus proceeds from my mouth and flowers bloom on the page.\nMy words are wise and clear and my thoughts are sharp like lightning.\nI joined this party because I couldn't find a job, and anybody can be a copywriter.\nBut I'm no writer, just a regular fellow in his mid twenties without an honest job.",
      "image":"https://impact.moe/assets/img/weapon-icons/thrilling-tales-of-dragon-slayers.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"thundering-pulse",
      "name":"Thundering Pulse",
      "type":"Bow",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"CRIT DMG %",
      "subStat":66.2,
      "abilityName":"Rule by Thunder",
      "abilityDescription":"Increase ATK by 20/25/30/35/40% and grants the might of the Thunder Emblem. At stack levels 1/2/3, the Thunder Emblem increases normal attack DMG by {12/24/40}/{15/30/50}/{18/36/60}/{21/42/70}/{24/48/80}%. The character will obtain 1 stack of Thunder Emblem in each of the following scenarios: Normal Attack deals DMG (stack lasts 5s), casting Elemental Skill (stack lasts 10s); Energy is less than 100% (stack disappears when Energy is full). Each stack's duration is calculated independently.",
      "description":"A longbow that was a gift from the Shogun. Eternal lightning crackles all around it.",
      "lore":"This bow, crackling with thunder, retains its luster despite having been soaked in thick darkness. When disaster came from a distant sea, it was once the favorite weapon of a great swordsman. \nIn his youth, he wandered the mountains, and he made a wager with a great Tengu he came across. He gambled his young, strong body as a bet against a bow given by the Shogun. \nAs for the gamble itself, he could only sometimes recall it, when he was drunk. But by the time dawn came, he had three wins and three loses — his contest with the Tengu was a draw. So in the bad news, he was taken as a servant by the Tengu. But in the good news, he won that unmatched bow. \n\"Behold, Konbumaru, this is Tengu archery. Watch and learn!\" He was given this rather ridiculous nickname, but ultimately, he witnessed the Tengu. Soaring through the cloud unfettered, unleashing thunderbolts with every bowstring's pulse... It was a true, unreserved dance of death. Fierce and unpredictable, elegant and beautiful. \nMany years later, he was no longer a servant boy, and he had grasped both some archery and swordsmanship. He was referred to the Shogunate through a recommendation letter from his impatient master. In the years under the Shogun, his martial skills improved greatly, and he made many friends and enemies. Still, his hobby of unrestrained wanderlust had not changed. On the contrary, with the Tengu's great bow, he became yet more fearless. \n\"Let's make a wager this time, shall we? Hmm. Right, then. This bow shall be my wager\" \"I bet on the mightiest bow in the world that I will return here alive.\" \"I'll leave it here with you for now. If I, Takamine, lose our bet, you can keep the bow.\" \"After all, you've inherited the essence of my archery techniques. You'll be able to make good use of it.\" \"But if I win...\" \nWhen disaster swept in from across the distant sea, the samurai and the obstinate shrine maiden had a mutual wager. They bet on his safe return from the abyss against the inscribed bow bestowed by the Shogun. \nWhen the dark venom sank deep into the earth and peace returned, the swordsman did not come back. The Shogun's bestowed bow was given to the shrine maiden as her prize for winning their great wager. Later, in the forest where the Kitsune Saiguu would no longer appear, in the promised meeting place, The lone returnee who came stumbling back from the abyss finally met the shrine maiden again, though by now she could no longer be called young. Dull eyes stained with dried blood and tears regained their radiance, but were pierced through by a barbed arrow glowing with power. \n",
      "image":"https://impact.moe/assets/img/weapon-icons/thundering-pulse.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"travelers-handy-sword",
      "name":"Traveler's Handy Sword",
      "type":"Sword",
      "rarity":3,
      "baseAtk":448,
      "subStatType":"DEF %",
      "subStat":27.5,
      "abilityName":"Journey",
      "abilityDescription":"Each Elemental Orb or Particle collected restores 1/1.25/1.5/1.75/2% HP.",
      "description":"A handy steel sword which contains scissors, a magnifying glass, tinder, and other useful items in its sheath.",
      "lore":"A reliable and balanced sword made of fine steel.\nThe one downside is that the partial-tang design renders it less durable than its full-tang counterparts.\nThat said, the partial tang creates space in the hilt for hidden knives, scissors, tinder, and other objects.\nHence the name, Traveler's Handy Sword. It contains all sorts of handy items for travelers.",
      "image":"https://impact.moe/assets/img/weapon-icons/travelers-handy-sword.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"twin-nephrite",
      "name":"Twin Nephrite",
      "type":"Catalyst",
      "rarity":3,
      "baseAtk":448,
      "subStatType":"CRIT Rate %",
      "subStat":15.6,
      "abilityName":"Guerilla Tactic",
      "abilityDescription":"Defeating an enemy increases Movement SPD and ATK by 12/14/16/18/20% for 15s.",
      "description":"A jade pendant formed by piecing together two jade stones.",
      "lore":"A jade piece which, despite its exquisite packaging, has been placed in one of the least prominent positions in the store.\nThe box comes with an official-looking certificate of premium quality, issued by an organization that no one has ever heard of.\nTo the untrained eye, the luxurious packaging and accessories would probably be enough to lure one in.\nHowever, it is still reasonable value for money when compared with genuine top-quality jade pieces.",
      "image":"https://impact.moe/assets/img/weapon-icons/twin-nephrite.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"vortex-vanquisher",
      "name":"Vortex Vanquisher",
      "type":"Polearm",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"ATK %",
      "subStat":49.6,
      "abilityName":"Golden Majesty",
      "abilityDescription":"Increases Shield Strength by 20/25/30/35/40%. Scoring hits on opponents increases ATK by 4/5/6/7/8% for 8s. Max 5 stacks. Can only occur once every 0.3s. While protected by a shield this ATK increase effect is increased by 100%",
      "description":"This sharp polearm can seemingly pierce through anything. When swung, one can almost see the rift it tears in the air.",
      "lore":"This was an ancient time, when ships sailed alongside sea monsters.\n\nIn those days, Liyue Harbor was not at peace, not from those creatures from the deep.\n\nThey say that a great shadow once dwelt within the oceanic abyss. With great vortexes and whirlpools it would smash even the strongest of ships, and drag its prey down into the sunless depths. They also say that a divine island would emerge from the sea, rainbow-clad and fog-shrouded...\n\nAll who are fortunate enough to set foot on that island will find treasures buried for time incalculable.\n\nStill others say that this island is a great monster in a threadbare torpor.\n\nMost legends that pass between sailors and skippers are such bizarre ones as these. But there is one story that they all believe. They believe that Rex Lapis had once wielded a spear that pierced the rainbow. pinning the churning vortex that had once terrorized the oceans in the center of the deep sea.\n\nLegends have it that since then, one can often see dolphins and whales congregate about that patch of ocean, singing.\n\nSome hold that they mourn for the God that they revered, and sing many a winding dirge for it.\n\nOthers claim that they do so in awe of Rex Lapis' great power, that he could indeed pierce the rainbow's arc and bring them down the sun.\n\nBut folk legend also holds this,\n\nThat one day, the vortex, consigned to a dead stillness by the Lord of Geo's divine spear, will once again begin to wake.\n\nWhen the wind once again brings the stench of the depths onshore, that will be the omen of a hurricane as large as a nine-headed hydra.\n\nWho, then, will be able to subdue That Which Lies in the Deep?",
      "image":"https://impact.moe/assets/img/weapon-icons/vortex-vanquisher.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"waster-greatsword",
      "name":"Waster Greatsword",
      "type":"Claymore",
      "rarity":1,
      "baseAtk":185,
      "subStatType":"",
      "subStat":0,
      "abilityName":"",
      "abilityDescription":"",
      "description":"A sturdy sheet of iron that may be powerful enough to break apart mountains, if wielded with enough willpower.",
      "lore":"The one who uses this heavy, edgeless two-handed greatsword knows this well:\nIt matters not what the weapon is, for it is the wielder's might that counts.",
      "image":"https://impact.moe/assets/img/weapon-icons/waster-greatsword.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"wavebreakers-fin",
      "name":"Wavebreaker's Fin",
      "type":"Polearm",
      "rarity":4,
      "baseAtk":620,
      "subStatType":"ATK %",
      "subStat":13.8,
      "abilityName":"Watatsumi Wavewalker",
      "abilityDescription":"For every point of the entire party's combined maximum Energy capacity, the Elemental Burst DMG of the character equipping this weapon is increased by 0.12/0.15/0.18/0.21/0.24%. A maximum of 40/50/60/70/80% increased Elemental Burst DMG can be achieved this way.",
      "description":"A naginata forged from luminscent material deep in the ocean depths. It was once the possession of the tengu race.",
      "lore":"The naginata of \"Umigozen,\" the mighty warrior of Watatsumi. Its edge flows with the phosphorescence of the depths.\nThe way this person once made the navies of Narukami quail are well-recorded in the island's music.\n\nThe whalesong that the twin Watatsumi shrine maidens once sang followed the tide's flow into the dreams of the island's people.\nAll of Watatsumi's warriors pinned their hopes and will to fight upon their shoulders.\nAnd they brandished their nagamaki like a white, flowing wave, and with a loud shout advanced upon the other islands.\nYet the glory of Omikami and that of his warriors were dimmed by the lightning's glow...\nMouun was consumed by a dark storm of crow feathers, and the great whale who sang with the sisters sank to the bottom of the sea.\nThe vassal ruler, determined as a child, the vanguard of their forces, vanished into a rift rent into the very earth itself.\n\n\"Umigozen\" was lost to the waves, becoming a myth to the archipelago at large.\nSome say that she dove alone into the press of tengu warriors to reclaim the bodies of her comrades, and was lost after a valiant last stand.\nOthers say that she hid thenceforth, steering her flagship into the Dark Sea at the borders of the world...\nThe only proof that she once sought to change the tides of the world is this still-sharp naginata.\n\nAs long as the seas are yet disturbed by the waves, so too might the memory of her song live on.\nLegend even has it that the song yet echoes within seashells and the bellies of mighty whales at the bottom of the sea. ",
      "image":"https://impact.moe/assets/img/weapon-icons/wavebreakers-fin.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"white-iron-greatsword",
      "name":"White Iron Greatsword",
      "type":"Claymore",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"DEF %",
      "subStat":43.9,
      "abilityName":"Cull the Weak",
      "abilityDescription":"Defeating an opponent restores 8/10/12/14/16% HP.",
      "description":"A claymore made from white iron. Lightweight without compromising on power. Effective even when wielded by one of average strength, it is extremely deadly in the hands of a physically stronger wielder.",
      "lore":"A lightweight greatsword made of white iron with a silver sheen. When swung rapidly, the flashes of light can blind the enemy. However, this sword is not usually used as a weapon.\nAccording to the way of warriors of old, when a comrade falls in battle, polished weapons will line the ground where they fell. Though such rituals as these are no longer in fashion, some few still remember what they mean...",
      "image":"https://impact.moe/assets/img/weapon-icons/white-iron-greatsword.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"white-tassel",
      "name":"White Tassel",
      "type":"Polearm",
      "rarity":3,
      "baseAtk":401,
      "subStatType":"CRIT Rate %",
      "subStat":23.4,
      "abilityName":"Sharp",
      "abilityDescription":"Increases Normal Attack DMG by 24/30/36/42/48%.",
      "description":"A standard-issue weapon of the Millelith soldiers. It has a sturdy shaft and sharp spearhead. It's a reliable weapon.",
      "lore":"The Millelith Soldier are renowned the world over for their skilled use of polearm weapons.\nThe signature white-tasseled halberd they wield is mass-produced at the Blackcliff Forge.\nIt is a weapon that has stood the test of countless bloody battles over centuries of history.\nFor even when the smoke of the battlefield stained the tassel a murky shade of gray, it would wave proudly and defiantly like a flag in the wind.\n\nThe army once had in its ranks a legendary master of the polearm.\nHe could hit his target from miles away without staining its tassel.\n\"The legend is that of the polearm's bearer...\"\n\"Not the polearm itself, which was entirely ordinary.\"\nThe old smith smacked his apprentice.\nHe demanded a white tassel for the newly made polearm.",
      "image":"https://impact.moe/assets/img/weapon-icons/white-tassel.webp",
      "location":"Chest",
      "stats":null
   },
   {
      "id":"whiteblind",
      "name":"Whiteblind",
      "type":"Claymore",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"DEF %",
      "subStat":51.7,
      "abilityName":"Infusion Blade",
      "abilityDescription":"On hit, Normal or Charged Attacks increase Base ATK and DEF by 6/7.5/9/10.5/12% for 6s. Max 4 stacks. Can only occur once every 0.5s.",
      "description":"An exotic sword with one section of the blade left blunt. It made its way into Liyue via the hands of foreign traders. Incredibly powerful in the hands of someone who knows how to use it.",
      "lore":"The whole world flocks to the commercial port of Liyue, much to the city's pride. With the tides of people also come exotic treasure. This greatsword is expertly made with the finest materials. It is unique in that the edge closest to the wielder has been left dull. The dull edge is said to have been used as the hilt, enabling the wielder to switch forms by constantly shifting hand positions in combat. Though it is rarely acknowledged, this greatsword was in fact a foreign bladesmith's labor of love. The bladesmith knew himself to be dull of wits, and was anxious that this blade should not follow suit. Hence, he worked painstakingly on sharpening and balancing his beloved blade. Sparks flew as the bladesmith worked through many sleepless nights. The sword was recast and re-tempered countless times. All the while his mind was consumed with the hope of his lover's return, as well as his untold anxiety for her wellbeing. \"After the war is over...\" The bladesmith would ponder briefly, each time he paused for breath. \"Will this blade still be of use to her?\" \"Will she even make it home safely?\" These thoughts would linger in his mind for but a moment before he cast them aside and refocused his full attention on the blade. Indulging irresolvable anxieties was a futile endeavor - better to focus his faculties on creating the perfect welcome-home gift. Finally, the day came when the triumphant expeditionary force entered the city gates, their monstrous foes defeated at last. But the bladesmith had not had time to carve his lover's name onto the blade's body. With no time to lose, he grabbed the sword and rushed to meet his lover on the occasion of her return. Unfortunately, what would transpire next was to be an unbearable anticlimax. As the warrior removed her helmet, long, soft hair flowed down. She was growing her hair out, and hence would never need to wield a blade again for the rest of her days. Meanwhile, she had brought her lover a gift, too: A shiny new hunting bow. \"Romance is dead! I wasted all these years making you this greatsword, and now you don't even need it!\" The bladesmith was thoroughly miserable and would not stop complaining about the unfairness of it all. But his efforts had by no means been in vain—at least he had finally succeeded in making a blade of the very finest quality.",
      "image":"https://impact.moe/assets/img/weapon-icons/whiteblind.webp",
      "location":"Crafting",
      "stats":null
   },
   {
      "id":"windblume-ode",
      "name":"Windblume Ode",
      "type":"Bow",
      "rarity":4,
      "baseAtk":510,
      "subStatType":"Elemental Mastery",
      "subStat":165,
      "abilityName":"Windblume Wish",
      "abilityDescription":"After using an Elemental Skill, receive a bon from the ancient wish of the Windblume, increasing ATK by 16/20/24/28/32% for 6s.",
      "description":"A bow adorned with nameless flowers that bears the earnest hopes of an equally nameless person.",
      "lore":"In the childhood dreams of Mondstadt, there was a certain breed of floaty flower,\nThat would grow lushly even amidst the mighty winds, terrible winters and wild whipping ice.\n\nIt was unlike those normal plants, which would blow away, roots and all, by the powerful gales.\nIndeed, this \"Windblume\"'s roots would grow stronger even as the wind grew wilder.\nToday, the rebellion of ordinary mortals against tyranny has long been consigned to festive jests,\nAnd the shape of that flower has grown faint, melding into the lilting lyre-tines of histories long gone by.\n\n\"Let me give you this nameless flower, and may the spring-times you never saw mean nothing to you.\"\n\"Pray repay me with hope and a smile, and stand with me to welcome the day when the storms blow no longer.\"\n\nIn the days when a tyrant gazed down upon the common folk from his tower, those who nursed freedom in their breasts would greet each other thusly.\nThose who sought courage and dreamed of walking upright wove the unknown, using this as their secret sign.\nIn those days, a lonely and fragile flower would come into bloom with the wind before slowly blossoming all across the wild mountain ranges.\nSo too did rootless and indifferent subjects content to go with the flow become proud, fearless heroes.\nThe frowning lord in the tower grew ever lesser in stature, and could no longer disperse the swelling, raging tide.\n\n\"Let me give you this nameless flower, and may she crown us champions, defenders of spring and sky.\"\n\"May the dawn be our spirit and follow us into the winds of true freedom.\"\n\nAtop the ruins of the ancient tower, amidst the cheers, songs, and tears of those who had newly won their freedom.\nA red-haired warrior turned his back on the newborn god, hidden like a single raindrop in a tidal wave of humanity.\nHe was first among those who passed the secret sign of Windblume, the one who wove threads of dawn throughout the long night.\nHis name has since been lost to time, but his deeds are still remembered in song.\nA thousand years later, another red-haired knight would follow in his footsteps, and bring light to the then-benighted history of the nobility.\nJust as the fate of the Windblume is to bloom under great pressure when the need to arise is most desperate,\nThe fate of this clan will likely never change: they shall ever live in the darkness and bring forth the flame of dawn.\n\nThe shape of the Windblume has been lost amidst the flowing winds of time.\nIn times of peace, its name has become synonymous with love and gladness.\nBut surely, this must have been the desire of those who walked stalwartly through the darkness…\n\n\"The flowers in bloom should represent love, and stand for the coming of spring.\"\n\"No more should they signal for rebellion, nor be the sign for banners to be raised...\"",
      "image":"https://impact.moe/assets/img/weapon-icons/windblume-ode.webp",
      "location":"Windblume Festival Event",
      "stats":null
   },
   {
      "id":"wine-and-song",
      "name":"Wine and Song",
      "type":"Catalyst",
      "rarity":4,
      "baseAtk":565,
      "subStatType":"Energy Recharge %",
      "subStat":30.6,
      "abilityName":"Ever-Changing",
      "abilityDescription":"Hitting an opponent with a Normal Attack decreases the Stamina consumption of Sprint or Alternate sprint by 14/16/18/20/22% for 5s. Additionally, using a Sprint or Alternate Sprint ability increases ATK by 20/25/30/35/40% for 5s.",
      "description":"A songbook from the bygone aristocratic era, whose composer has become forgotten. It chronicles the tale of a certain heroic outlaw.",
      "lore":"An elegantly bound songbook, it was once fashionable in the days of the ruling aristocracy.\nAn indelible scent of daisies and finely-aged wine wafts from within its pages.\nIts contents are rather absurd, but it was once a popular tune in the alleys and taverns.\n\"Everyone knows that drunken gentleman thief, though no one knows where he's from. One fine day — When? No one can say — he appeared like a ghost in our slum.\"\n\"He sings, he drinks, he wanders the streets, he passes the roofs and terraces by. But everyone knows he's a jolly good fellow, which nobody can deny.\"\n\"The sword by his side was a great house's pride, and he stole it from where it'd been lain, and the bow so black that he wears on his back fires never once in vain.\"\n\"His matchless skill rings chill in the night like a comet's flashing tail, and his strides are as light as Favonius' flight, and the leaves that behold him quail.\"\n\"He could slake the entire Cider Lake, were it all filled with Death After Noon. And then he'd creep right up to those pigs at midnight, while they're all fast asleep in their rooms.\"\n\"He robs the rich and pays the poor, he blows noble farts away, he throws a spark into the dark, and night is pierced by day.\"\n\"The maidens all dream of the gentleman thief, they pine after him from their windows, but sad to say, he passes not that way, he prefers a pint with his fellows.\"\n\"Till on one day (or was it dusk?) in a mansion he ran amok, took he with him a thief's full due, and an extra silver cup.\"\n\"Left he silently in the moon's silver light, when fey were his eyes set ablaze, he lifted them nigh to a warm window bright, and upon a lovely face he gazed.\"\n\"Her eyes they shone like sapphire stones, so blue did they gleam in the dark, and the thief glanced up to the gem in his cup, and he thought them the same in his heart.\"\n\"Losing no time, the thief made his climb, and prying the gem from its place, he gave it to her, and a bashful smile stirred, and crept up upon her face.\"\n\"When at last they toppled the indolent nobles, they left, distant lands to explore, and so the song says, they warmed each other's days with light forevermore.\"\nThe story ends here. In the latter days of righteous governance, there are none left who sing of the gentleman thief, nor are such thieves needed anymore.\nWine and swords, maidens and heroes, a carefree opening and a happy ending, this vulgar sort of tale tends to be popular with the people.\nFor no matter how the real story went, or how the two truly ended up, wine and songs brim with hope.\nThey give the unfortunate a little courage to face tomorrow, and stand up to the powers that oppress them...",
      "image":"https://impact.moe/assets/img/weapon-icons/wine-and-song.webp",
      "location":"Gacha",
      "stats":null
   },
   {
      "id":"wolfs-gravestone",
      "name":"Wolf's Gravestone",
      "type":"Claymore",
      "rarity":5,
      "baseAtk":608,
      "subStatType":"ATK %",
      "subStat":49.6,
      "abilityName":"Wolfish Tracker",
      "abilityDescription":"Increases ATK by 20/25/30/35/40%. On hit, attacks against opponents with less than 30% HP increase all party members' ATK by 40/50/60/70/80% for 12s. Can only occur once every 30s.",
      "description":"A longsword used by the Wolf Knight. Originally just a heavy sheet of iron given to the knight by a blacksmith from the city, it became endowed with legendary power owing to his friendship with the wolves.",
      "lore":"The Knight of Boreas' journey ended at the city of Barbatos.\nWandering souls attract each other, boundless freedom begets only anxiety.\n\nUpon entering the city, the Knight of Boreas' companion bade him farewell in silence.\nFor the free-spirited Wolf resented the stone walls and lamplight, and yearned for the open wilds.\n\nThe Knight of Boreas' heart remained free, though his flesh was inside the prison-like city.\nMeanwhile, the windborne Wolf roamed the forest in the flesh, while his heart remained loyal to the Knight.\n\nThe Knight of Boreas rode again to hunt. The Wolf followed his scent into battle.\nStill one were they, the Wolf and the Knight.\n\nThough one they were, death comes for beasts sooner than men. Laying down his sword as a gravestone, the Knight of Boreas buried the Wolf in the remote countryside.\nThe Knight of Boreas then left the city behind, living instead the wandering life of a lone wolf.\n\nYet the eternal wolf spirit remained here,\nWatching over the land the Knight once protected.",
      "image":"https://impact.moe/assets/img/weapon-icons/wolfs-gravestone.webp",
      "location":"Gacha",
      "stats":null
   }
]