[
    {
        "name": "Swirl",
        "elementalFormula": ["pyro", "hydro", "electro", "cryo", "anemo"],
        "description": "Infuses an element and deals that elemental damage while spreading the effect to nearby enemies. It does not deal Anemo DMG (as that elemental damage seen comes from the talent that is dealing the Anemo element). Only one element at a time can be infused with Anemo."
    },
    {
        "name": "Melt",
        "elementalFormula": ["pyro", "cryo"],
        "description": "When Cryo meets Pyro, Melt occurs. The effects of Cryo and Pyro will dissipate when Melt occurs. Melt itself does not inflict DMG. However, the Pyro or Cryo attack that triggers Melt deals increased DMG."
    },
    {
        "name": "Frozen",
        "elementalFormula": ["hydro", "cryo"],
        "description": " Freezes the target. If the frozen target is hit by a Claymore, a Sword Plunge Attack, or Geo DMG (excluding Catalyst user's Plunge), it will cause Shattered. Shattering a frozen target will deal additional Physical DMG."
    },
    {
        "name": "Superconduct",
        "elementalFormula": ["electro", "cryo"],
        "description": "Deals AoE Cryo DMG and reduces the target's Physical DMG Resistance by -40% for 12 seconds. Each Superconduct reaction deals DMG to targets within its range once, meaning if there are 3 Superconduct reactions, given all 3 targets are within the reactions' AoE, each target will take DMG 3 times."
    },
    {
        "name": "Burning",
        "elementalFormula": ["pyro", "dendro"],
        "description": "When Dendro meets Pyro, it triggers Burning, which continuously deals Pyro DMG until it wears off."
    },
    {
        "name": "Overloaded",
        "elementalFormula": ["electro", "pyro"],
        "description": "When Electro meets Pyro, Overloaded occurs. The resulting explosion deals AoE Pyro DMG, and tears effortlessly through otherwise sturdy objects."
    },
    {
        "name": "Electro Charged",
        "elementalFormula": ["electro", "hydro"],
        "description": "When Electro meets Hydro, Electro-Charged occurs. Electro-Charged continuously deals Electro DMG until it wears off. Electricity intermittently arcs off of Electro-Charged beings, shocking Hydro-affected opponents nearby."
    },
    {
        "name": "Crystallize",
        "elementalFormula": ["hydro", "electro", "cryo", "pyro", "geo"],
        "description": " Absorbs the element and drops a crystal of that same element. The crystal will give an elemental shield. The shield absorbs all types of damage, but it protects more efficiently against the shield's element."
    },
    {
        "name": "Vaporize",
        "elementalFormula": ["hydro", "pyro"],
        "description": "When Hydro meets Pyro, Vaporize occurs. The effects of Pyro and Hydro will dissipate when Vaporize occurs. Vaporize itself does not inflict DMG. However, the Pyro or Hydro attack that triggers Vaporize deals increased DMG."
    }
]