[
    {
        "id": "pile-em-up",
        "name": "Pile 'Em Up",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "A rich, meaty dish. Originally a Mondstadt dish made of steaks, potatoes, and cheese, it has since become synonymous with Ludi Harpastum.",
        "effect": "Increases all party members' CRIT Rate by 10~20% for 300s.",
        "recipe": [
            "3x Raw Meat",
            "3x Potato",
            "1x Small Lamp Grass",
            "1x Cheese"
        ]
    },
    {
        "id": "adeptus-temptation",
        "name": "Adeptus' Temptation",
        "rarity": 5,
        "type": "ATK-Boosting Dishes",
        "description": "A complex, famous type of Liyue cuisine, in which specially selected ingredients are submerged and slowly bowled into soup stock. The recipe scribbled from memory alone was enough to urge the adepti to once again return to the world of men.",
        "effect": "Increases all party members' ATK by 316 and CRIT Rate by 10% for 300s.",
        "recipe": [
            "4x Ham",
            "3x Crab",
            "3x Shrimp Meat",
            "3x Matsuke"
        ]
    },
    {
        "id": "adventurers-breakfast-sandwich",
        "name": "Adventurer's Breakfast Sandwich",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "A nutritious egg dish. Luxurious mayonnaise sits atop a lining of ham and poached egg toast. The smooth mouthfeel fills you with energy for the long road ahead, and is one of the Adventurers' Guild's top-rated breakfasts.",
        "effect": "Increases all party members' ATK by 194 for 300s.",
        "recipe": [
            "4x Bird Egg's",
            "3x Flour",
            "1x Ham"
        ]
    },
    {
        "id": "almond-tofu",
        "name": "Almond Tofu",
        "rarity": 2,
        "type": "ATK-Boosting Dishes",
        "description": "A dessert made out of almond. It has a silky-smooth texture with a long-lasting aroma of almond. It's named tofu only because of its tofu-like shape.",
        "effect": "Increases all party members' ATK by 81 for 300s.",
        "recipe": [
            "3x Milk",
            "1x Sugar",
            "1x Almond"
        ]
    },
    {
        "id": "apple-cider",
        "name": "Apple Cider",
        "rarity": 2,
        "type": "Recovery Dishes",
        "description": "A freshly squeezed, fashionable, and fruity non-alcoholic beverage. Said to have a strong sobering effect, tavern patrons often order this as the last drink of the night.",
        "effect": "Restores 26% of Max HP to the selected character and regenerates 570 HP every 5s for 30s."
    },
    {
        "id": "apple",
        "name": "Apple",
        "type": "Recovery Dishes",
        "description": "Crisp and fragrant. Delicious raw or made into wine.",
        "effect": "Restores 300 HP."
    },
    {
        "id": "bamboo-shoot-soup",
        "name": "Bamboo Shoot Soup",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "A soup dish that's been stewed for a good long while. The meat and ham have been diced into small pieces, and the soup has been kept on low heat till it turned milky white. The process has brought out the distinct flavors of both kinds of meat, making for an especially tasty soup.",
        "effect": "Restores 28% of Max HP to the selected character. Regenerates 620 HP every 5s for 30s.",
        "recipe": [
            "2x Raw Meat",
            "2x Ham",
            "1x Bamboo Shoot"
        ]
    },
    {
        "id": "barbatos-ratatouille",
        "name": "Barbatos Ratatouille",
        "rarity": 3,
        "type": "Adventurer's Dishes",
        "description": "A simple chowder with a long history. The ingredients are similarly traditional and simple. No matter where you are, a piping-hot chowder of this sort can always give you a sense of real and unsurpassed satisfaction.",
        "effect": "Decreases all party members' gliding and sprinting Stamina consumption by 20% for 900s.",
        "recipe": [
            "4x Carrot",
            "4x Potato",
            "4x Onion"
        ]
    },
    {
        "id": "mint-burst",
        "name": "Berry & Mint Burst",
        "rarity": 2,
        "type": "ATK-Boosting Dishes",
        "description": "A freshly squeezed, fashionable, and fruity non-alcoholic beverage. A refreshing burst of Mint with Berries to sweeten the deal, it has an exquisite aroma.",
        "effect": "Increases all party members' CRIT Rate by 16% for 300s.",
        "recipe": [
            "No Recipe"
        ]
    },
    {
        "id": "berry-mizu-manjuu",
        "name": "Berry Mizu Manjuu",
        "rarity": 2,
        "type": "Recovery Dishes",
        "description": "A crystal-clear snack. The transparent skin wraps the yellow filling. It is said that some vendors will put these snacks into a small clay bowl and immerse it in water to ensure that the cool mouthfeel is retained. This dish is as transparent as water, but it will not be washed away by flowing water — this is probably the origin of the name.",
        "effect": "Restores 20% of Max HP and regenerates 390 HP every 5 seconds for 30s.",
        "recipe": [
            "2x Rice",
            "2x Berry",
            "1 Sugar"
        ]
    },
    {
        "id": "bird-egg-sushi",
        "name": "Bird Egg Sushi",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "An everyday Inazuman dish. The sliced Egg Roll is placed over seasoned rice. Simply made, yet full of flavor.",
        "effect": "Restores 9% of Max HP and an additional 1,000 HP to the selected character.",
        "recipe": [
            "1x Bird Egg",
            "1x Rice"
        ]
    },
    {
        "id": "black-back-perch-stew",
        "name": "Black-Back Perch Stew",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "A poached fish dish. The fresh and tasty fish fillets are tender and juicy. The secret to this recipe is adding powdered Violetgrass into the heated oil to give the dish that aromatic scent. It's spicy, but not too spicy.",
        "effect": "Restores 28% of Max HP to the selected character and regenerates 620 HP every 5s for 30s.",
        "recipe": [
            "3x Fish",
            "1x Jueyun Chili",
            "1x Salt",
            "1x Violetgrass"
        ]
    },
    {
        "id": "braised-meat",
        "name": "Braised Meat",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "A stewed dish. The meat slices were fried first, followed by the vegetable accouterments, after which they were mixed together. The soup was then added and simmered until it thickened. After this patient, slow cooking process, the meat has become soft and tender, bringing those who eat it a down-to-earth satisfaction.",
        "effect": "Increases all party members' Physical DMG by 30% for 300s.",
        "recipe": [
            "4x Raw Meat",
            "2x Carrot",
            "2x Potato",
            "1x Onion"
        ]
    },
    {
        "id": "bountiful-year",
        "name": "Bountiful Year",
        "rarity": 4,
        "type": "ATK-Boosting Dishes",
        "description": "Luxurious and exquisite raw fish. The fish is sliced thinly and arranged in the shape of a flower before a ring of side dishes is set all around it. Normally, the side dishes will be mixed with the raw fish according to one's taste before consumption — this act is said to ensure that things will be smooth sailing in the coming days.",
        "effect": "Increases all party members' ATK by 272 and CRIT Rate by 8% for 300s.",
        "recipe": [
            "4x Fish",
            "4x Carrot",
            "2x Onion",
            "1x Violetgrass"
        ]
    },
    {
        "id": "butter-crab",
        "name": "Butter Crab",
        "rarity": 4,
        "type": "DEF-Boosting Dishes",
        "description": "A grilled crab dish. Appropriate heat control has allowed the crab meat to stay moist and fatty. The butter has seeped into the crab meat, producing an aroma that has people salivating even from afar.",
        "effect": "Increases all party members' DEF by 261 and healing effects by 8% for 300s.",
        "recipe": [
            "4x Butter",
            "4x Crab",
            "2x Seagrass",
            "1x Matsutake"
        ]
    },
    {
        "id": "calla-lily-seafood-soup",
        "name": "Calla Lily Seafood Soup",
        "rarity": 3,
        "type": "DEF-Boosting Dishes",
        "description": "A balanced combination of seafood. The delicacy of crab and mint make for a clear soup, and the calla lily brings it a refreshing taste.",
        "effect": "Increases all party members' DEF by 200 for 300s.",
        "recipe": [
            "4x Crab",
            "1x Calla Lily",
            "2x Mint"
        ]
    },
    {
        "id": "chicken-tofu-pudding",
        "name": "Chicken Tofu Pudding",
        "rarity": 4,
        "type": "ATK-Boosting Dishes",
        "description": "A dish made with great precision. The finely-diced chicken breast is stirred strongly and added into a soup that has various other minced meats within, before being cooked over a small flame. The result is light and elegant, and it tastes like tofu pudding. The meat has been shaped such that it is \"a chicken above chickens, yet does not look like chicken.\" This, too, is part of Liyue's culinary fine arts.",
        "effect": "Increases all party members' ATK by 272 and CRIT Rate by 8% for 300s.",
        "recipe": [
            "4x Fowl",
            "2x Ham",
            "2x Bird Egg",
            "1x Snapdragon"
        ]
    },
    {
        "id": "chicken-mushroom-skewer",
        "name": "Chicken-Mushroom Skewer",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "A skewer of mushrooms and poultry. Fresh poultry is complimented by fragrant mushrooms. Don't be picky, chow down!",
        "effect": "Restores 9% of Max HP and an additional 1,000 HP to the selected character.",
        "recipe": [
            "1x Mushroom",
            "1x Fowl"
        ]
    },
    {
        "id": "chili-mince-cornbread-buns",
        "name": "Chili-Mince Cornbread Buns",
        "rarity": 4,
        "type": "DEF-Boosting Dishes",
        "description": "A traditional snack from Liyue. The fresh dough is turned out into a round, rested, and then placed inside a cage to steam. The meat and vegetables are then washed, diced, before being fried quickly in an oiled wok. When eaten, the fried condiments must be placed into the empty space in the middle of the buns before they are eaten together. Between the crisp vegetables and the flavorful meat, this is solid, great flavor.",
        "effect": "Increases all party members' Shield strength by 30% and DEF by 200 for 300s.",
        "recipe": [
            "4x Raw Meat",
            "2x Jueyun Chili",
            "3x Flour",
            "2x Cabbage"
        ]
    },
    {
        "id": "cold-cut-platter",
        "name": "Cold Cut Platter",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "A plate of cold cut meat. An equal balance of bacon, ham and sausage keeps everyone happy.",
        "effect": "Increases all party members' Physical DMG by 30% for 300s.",
        "recipe": [
            "1x Ham",
            "1x Bacon",
            "1x Sausage",
            "1x Mint"
        ]
    },
    {
        "id": "come-and-get-it",
        "name": "Come and Get It",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "A dish made out of a luxurious variety of ingredients. There is no great refinement in the making of this food, and it appears in Liyue often during festival season. Whenever this dish is served up, the person at the head of the table will invite everyone to dig in, saying \"Come on, eat, eat,\" hence the name.",
        "effect": "Increases all party members' CRIT Rate by 15% for 300s.",
        "recipe": [
            "3x Raw Meat",
            "3x Fish",
            "3x Rice",
            "1x Tofu"
        ]
    },
    {
        "id": "crab-roe-kourayaki",
        "name": "Crab Roe Kourayaki",
        "rarity": 2,
        "type": "ATK-Boosting Dishes",
        "description": "A crab meat dish that has been cooked directly over the flames. The meat and roe are mixed evenly, before being garnished with plump crab legs. The happiness that flows forth from that first bite imparts meaning upon your prior forbearance.",
        "effect": "Increases all party members' ATK by 81 for 300s.",
        "recipe": [
            "1x Crab",
            "1x Crab Roe"
        ]
    },
    {
        "id": "crab-ham-and-veggie-bake",
        "name": "Crab Ham & Veggie Bake",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "A luxurious bake. Cracks through the golden outer skin reveal a medley of rosy ham and bright vegetables. How tantalizing!",
        "effect": "Revives a character and restores 1,200 HP.",
        "recipe": [
            "1x Crab Roe",
            "1x Ham",
            "1x Cream",
            "1x Cabbage"
        ]
    },
    {
        "id": "cream-stew",
        "name": "Cream Stew",
        "rarity": 2,
        "type": "Adventurer's Dishes",
        "description": "A meat and vegetable stew. The thick juices taste great with the tender meat and vegetables.",
        "effect": "Decreases all party members' sprinting Stamina consumption by 20% for 900s.",
        "recipe": [
            "2x Raw Meat",
            "2x Cream",
            "1x Snapdragon"
        ]
    },
    {
        "id": "crispy-potato-shrimp-platter",
        "name": "Crispy Potato Shrimp Platter",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "An attractive-looking pre-meal snack. A spread made from potatoes and berries is placed onto crispy potato slices, and a whole shrimp is then added on top. The fragrant and full-bodied flavors serve to whet the appetite, while the addition of Mint adds a whole other dimension to the mix.",
        "effect": "Restores 28% of Max HP to the selected character and regenerates 620 HP every 5s for 30s.",
        "recipe": [
            "4x Mint",
            "4x Shrimp Meat",
            "3x Potato",
            "2x Berry"
        ]
    },
    {
        "id": "crystal-shrimp",
        "name": "Crystal Shrimp",
        "rarity": 2,
        "type": "Recovery Dishes",
        "description": "One of Liyue's traditional snacks. The stuffing is taken from whole fresh shrimp, and the glistening quality of the flour can be guessed at from the translucence of the outer skin. Has a springy, tasty chew.",
        "effect": "Restores 20% of Max HP to the selected character and regenerates 390 HP every 5s for 30s.",
        "recipe": [
            "3x Rice",
            "3x Shrimp Meat",
            "2x Carrot"
        ]
    },
    {
        "id": "cured-pork-dry-hotpot",
        "name": "Cured Pork Dry Hotpot",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "A dish fried over a great flame. Matsutake and Ham have been sliced up, stir-fried, and garnished with some spicy condiments. The flavor of the Ham is a match for the Matsutake's crispness, and the combination grows even lovelier and more addictive as you chew. The heat-conducting wok also serves to keep it piping hot for long periods.",
        "effect": "Increases all party members' CRIT Rate by 15% for 300s.",
        "recipe": [
            "2x Ham",
            "2x Matsutake",
            "1x Snapdragon",
            "1x Pepper"
        ]
    },
    {
        "id": "dango-milk",
        "name": "Dango Milk",
        "rarity": 2,
        "type": "Recovery Dishes",
        "description": "A creative snack made by adding sticky dango to milk. It is sweet and has a dense mouthfeel. All the customers who have tried it love it. Still, it is dango that's been added in — drink too much and you might lose your appetite.",
        "effect": "Restores 26% of Max HP to the selected character and regenerates 570 HP every 5s for 30s.",
        "recipe": [
            "None"   
        ]
    },
    {
        "id": "dragon-beard-noodles",
        "name": "Dragon Beard Noodles",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "Noodles that are as slender as the hairs on a dragon's beard. The green onion is fried in a wok before the soup and condiments are added. Last in are the noodles, after which the lot is ladled out and plated up. The noodles must be skillfully hand-pulled multiple times before they become extremely thin — a technique that makes this dish the most challenging noodle recipe in Liyue.",
        "effect": "Increases all party members' ATK by 194 for 300s.",
        "recipe": [
            "4x Flour",
            "2x Fowl",
            "2x Mushroom",
            "1x Ham"
        ]
    },
    {
        "id": "dry-braised-salted-fish",
        "name": "Dry-Braised Salted Fish",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "Dried fish that has been grilled slowly over a charcoal flame. Fish air-dried overnight have a tinge of the salty sea wind and give off a tantalizing flavor when grilled. Many Inazumans who dwell near the sea know this taste well indeed.",
        "effect": "Restores 9% of Max HP and an additional 1,000 HP to the selected character.",
        "recipe": [
            "1x Fish",
            "1x Salt"
        ]
    },
    {
        "id": "egg-roll",
        "name": "Egg Roll",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "A fried egg dish. Beat eggs well, season and fry them slowly in a wok, roll up into a fixed shape. Pour our egg liquid in again and continue until it has all reached a certain thickness, then get ready to plate up. This is an ordinary yet welcoming Inazuman delicacy.",
        "effect": "Revives a character and restores 100 HP.",
        "recipe": [
            "1x Bird Egg",
            "1x Sugar"
        ]
    },
    {
        "id": "fishermans-toast",
        "name": "Fisherman's Toast",
        "rarity": 2,
        "type": "DEF-Boosting Dishes",
        "description": "Onion-covered toast. A favorite amongst fishermen, they will stuff a bag with it and sit by the river all day.",
        "effect": "Increases all party members' DEF by 107 for 300s.",
        "recipe": [
            "3x Flour",
            "2x Tomato",
            "1x Onion",
            "1x Milk"
        ]
    },
    {
        "id": "five-pickled-treasures",
        "name": "Five Pickled Treasures",
        "rarity": 3,
        "type": "Adventurer's Dishes",
        "description": "Pickled vegetables. A round of fermentation makes food richer and also allows it to keep for longer. There were originally only four \"treasures,\" but for auspiciousness' sake, the four vegetables were mixed and plated up with one additional \"treasure\" added in, hence the name \"Five Pickled Treasures.\"",
        "effect": "Restores 85 Stamina.",
        "recipe": [
            "2x Radish",
            "2x Carrot",
            "2x Lavender Melon",
            "2x Seagrass"
        ]
    },
    {
        "id": "flaming-red-bolognese",
        "name": "Flaming Red Bolognese",
        "rarity": 2,
        "type": "Recovery Dishes",
        "description": "Bolognese covered with a meat sauce. The meaty, herby aroma really gets your appetite going.",
        "effect": "Restores 20% of Max HP to the selected character and regenerates 390 HP every 5s for 30s.",
        "recipe": [
            "2x Flour",
            "2x Raw Meat",
            "1x Tomato"
        ]
    },
    {
        "id": "fragrant-mashed-potatoes",
        "name": "Fragrant Mashed Potatoes",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "Seasoned mashed potatoes. The potatoes were thoroughly mashed before a sauce was drizzled over them. The mouthfeel is soft and smooth and it has a rich, multi-layered flavor profile. A satisfying choice for a hungry stomach, whether as a side or as a main dish.",
        "effect": "Increases all party members' ATK by 194 for 300s.",
        "recipe": [
            "6x Potato",
            "4x Cream",
            "3x Pepper"
        ]
    },
    {
        "id": "fried-radish-balls",
        "name": "Fried Radish Balls",
        "rarity": 2,
        "type": "ATK-Boosting Dishes",
        "description": "Fried Radish Balls. Fragrant and crispy. Make sure to eat them while they're hot! Said to be a recipe from Liyue.",
        "effect": "Increases all party members' ATK by 81 for 300s.",
        "recipe": [
            "3x Flour",
            "2x Radish",
            "1x Pepper"
        ]
    },
    {
        "id": "fullmoon-egg",
        "name": "Fullmoon Egg",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "One of Liyue's traditional snacks. The egg has been beaten into the flour to form a dough and the shrimp and fish have been diced, minced, and packaged into the shape of a teacup, before being garnished with whole shrimp and steamed in a pot. The resulting design is like that of clouds embracing the moon, hence the name Fullmoon Egg.",
        "effect": "Revives a character and restores 1,200 HP.",
        "recipe": [
            "4x Fish",
            "2x Shrimp Meat",
            "2x Bird Egg",
            "1x Flour"
        ]
    },
    {
        "id": "golden-chicken-burger",
        "name": "Golden Chicken Burger",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "A hamburger in which the fowl meat is the main star. The fluffy bread sandwiches slices of fresh vegetables and a flavorful, crispy fowl fillet. No utensils required here: Just grab it in your hands and bite down on that bundle of rich, satisfying succulence with a hearty \"ker-runch\"!",
        "effect": "Restores 32% of Max HP and an additional 1,250 HP to the selected character.",
        "recipe": [
            "4x Fowl",
            "2x Flour",
            "2x Cabbage",
            "2x Butter"
        ]
    },
    {
        "id": "golden-crab",
        "name": "Golden Crab",
        "rarity": 4,
        "type": "DEF-Boosting Dishes",
        "description": "A crab dish cooked in the ancient ways. The crab has been chopped into pieces and battered with flour, before being stir-fried till golden and rich with flavor. It is worthy of the word \"gold,\" whether in terms of appearance or quality.",
        "effect": "Increases all party members' DEF by 261 and healing effects by 8% for 300s.",
        "recipe": [
            "5x Bird Egg",
            "5x Flour",
            "4x Crab",
            "2x Salt"
        ]
    },
    {
        "id": "golen-fried-chicken",
        "name": "Golden Fried Chicken",
        "rarity": 4,
        "type": "ATK-Boosting Dishes",
        "description": "Fowl that has been seasoned and then fried. The golden outer skin has all but sealed the abundant juices into the meat, leading to absolute enjoyment with each bite. The taste at your fingertips will linger in memory far longer than the instant it takes to reduce the meal to nothing but slim bones.",
        "effect": "Increases all party members' ATK by 272 and CRIT Rate by 8% for 300s.",
        "recipe": [
            "4x Fowl",
            "4x Butter",
            "3x Pepper",
            "2x Flour"
        ]
    },
    {
        "id": "golden-shrimp-balls",
        "name": "Golden Shrimp Balls",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "A deep-fried shrimp dish. The aroma assaults your senses, while the crispy potatoes bring out the light sweetness of the shrimp meat. This, in tandem with its cute, small shape, makes it very enticing indeed.",
        "effect": "Revives a character and restores 1,200 HP.",
        "recipe": [
            "5x Shrimp Meat",
            "4x Potato",
            "3x Flour"
        ]
    },
    {
        "id": "goulash",
        "name": "Goulash",
        "rarity": 3,
        "type": "Adventurer's Dishes",
        "description": "A steaming-hot stew. Hot stew made from Chilled Meat and vegetables chopped into small pieces. Slow-boiled tomatoes give this dish a rich and thick texture. Filling one's stomach with this comforting mixture has a warming effect.",
        "effect": "Somewhat decreases the rate of Sheer Cold accumulation for all party members for 900s.",
        "recipe": [
            "2x Chilled Meat",
            "2x Carrot",
            "1x Tomato"
        ]
    },
    {
        "id": "grilled-tiger-fish",
        "name": "Grilled Tiger Fish",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "A fish kebab grilled over an open flame. The fish is a fresh catch straight from the harbor, lightly picked and swiftly grilled. Its aroma attracts the street cats. Indeed, freshness is the secret of flavor.",
        "effect": "Restores 9% of Max HP and an additional 1,000 HP to the selected character.",
        "recipe": [
            "1x Fish",
            "1x Pepper"
        ]
    },
    {
        "id": "grilled-unagi-fillet",
        "name": "Grilled Unagi Fillet",
        "rarity": 2,
        "type": "Recovery Dishes",
        "description": "A grilled dish. The sliced unagi has been steamed first to remove the excess fat before being grilled and sauced. There is no consensus in Inazuma as to where the name \"unagi\" came from, but everyone at least agrees that it will take a whole lifetime to master its making.",
        "effect": "Restores 22% of Max HP and an additional 1,200 HP to the selected character.",
        "recipe": [
            "3x Unagi Meat",
            "1x Sugar"
        ]
    },
    {
        "id": "holy-water",
        "name": "Holy Water",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "A bottle of clear, colorless, and contaminant-free liquid. Indistinguishable from ordinary spring water. May or may not be worth putting all of one's hopes into."
    },
    {
        "id": "imported-poultry",
        "name": "Imported Poultry",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "A meat dish drizzled with sauce. Having been marinated beforehand, the fowl has had several layers of flavor added to it, keeping its oiliness in perfect moderation. Bite down on that crispy, cracking flour-skin, and feel the rich juices of the fowl rush into your mouth and whet your appetite.",
        "effect": "Increases all party members' CRIT Rate by 20% for 300s.",
        "recipe": [
            "4x Fowl",
            "3x Lavender Melon",
            "2x Flour",
            "2x Bird Egg"
        ]
    },
    {
        "id": "invigorating-kitty-meal",
        "name": "Invigorating Kitty Meal",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "This main dish looks rather cute. With Kiminami Anna's help, this dish was made with the tastes of the provisional head priestess Neko in mind. Although it does not quite match the flavor that Hibiki used to produce, Lady Neko seems rather pleased with your work nonetheless, Due to lack of spices, humans might find this dish a tad on the plain side.",
        "effect": "Restores 28% of Max HP to the selected character. Regenerates 620 HP every 5s for the next 30s.",
        "recipe": [
            "4x Fish",
            "2x Raw Meat",
            "2x Seagrass",
            "1x Rice"
        ]
    },
    {
        "id": "jade-parcels",
        "name": "Jade Parcels",
        "rarity": 4,
        "type": "ATK-Boosting Dishes",
        "description": "An exquisite-looking dish. The ham's sweetness is locked inside the fresh vegetables, drizzled with a spicy broth. Delicious is an understatement.",
        "effect": "Increases all party members' ATK by 272 and CRIT Rate by 8% for 300s.",
        "recipe": [
            "3x Lotus Head",
            "2x Jueyun Chili",
            "2x Cabbage",
            "1x Ham"
        ]
    },
    {
        "id": "jewelry-soup",
        "name": "Jewelry Soup",
        "rarity": 2,
        "type": "DEF-Boosting Dishes",
        "description": "A simple vegetable soup. Snapdragon, tofu, and lotus seeds are put into boiling water and simmered. Jewelry Soup earned its luxurious name from the look of the ingredients used, but contrary to its name, the soup is commonly prepared and served in ordinary households.",
        "effect": "Increases all party members' DEF by 107 for 300s.",
        "recipe": [
            "2x Snapdragon",
            "2x Tofu",
            "1x Lotus Head"
        ]
    },
    {
        "id": "jueyun-chili-chicken",
        "name": "Jueyun Chili Chicken",
        "rarity": 2,
        "type": "ATK-Boosting Dishes",
        "description": "Cold chicken mixed in dressings. The finesse technique used in mixing the dish retained the freshness of the delightful juice contained within the chicken. The glowing gold chicken skin hides a mildly hot flavor underneath.",
        "effect": "Increases all party members' CRIT Rate by 9% for 300s.",
        "recipe": [
            "2x Fowl",
            "1x Jueyun Chili",
            "1x Pepper"
        ]
    },
    {
        "id": "jueyun-guoba",
        "name": "Jueyun Guoba",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "One of Liyue's specialty snacks. Stir-fried ham and Jueyun Chili sprinkled on a crispy crust made from Rice and Horsetail create a refined, meaty snack that transforms humble Rice into a hot delicacy.",
        "effect": "Increases all party members' Physical DMG by 30% for 300s.",
        "recipe": [
            "2x Horsetail",
            "2x Rice",
            "1x Ham",
            "1x Jueyun Chili"
        ]
    },
    {
        "id": "konda-cuisine",
        "name": "Konda Cuisine",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "Slowly stewed local cuisine. Everyone in Konda Village knows how to make this dish. It originally had no name but would spread throughout Inazuma on account of its nutritious deliciousness. This eventually caused those from outside the village to give it its name — \"Konda Cuisine.\"",
        "effect": "Revives a character and restores 1200 HP.",
        "recipe": [
            "3x Fowl",
            "2x Snapdragon",
            "2x Lavender Melon",
            "1x Mushroom"
        ]
    },
    {
        "id": "lantern-rite-special-come-and-get-it",
        "name": "Lantern Rite Special Come and Get It",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "Traditional cuisine made to celebrate Lantern Rite. There is no great refinement in the making of this food, and it appears in Liyue often during festival season. Whenever this dish is served up, the person at the head of the table will invite everyone to dig in, saying \"Come on, eat, eat,\" hence the name.",
        "effect": "Increases all party members' CRIT Rate by 20% for 300s."
    },
    {
        "id": "lantern-rite-special-fried-radish-balls",
        "name": "Lantern Rite Special Fried Radish Balls",
        "rarity": 2,
        "type": "ATK-Boosting Dishes",
        "description": "Traditional cuisine made to celebrate Lantern Rite. Fragrant and crispy. Make sure to eat them while they're hot!",
        "effect": "Increases all party members' ATK by 95 for 300s."
    },
    {
        "id": "lantern-rite-special-grilled-tiger-fish",
        "name": "Lantern Rite Special Grilled Tiger Fish",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "Traditional cuisine made to celebrate Lantern Rite. The fish is a fresh catch straight from the harbor, lightly seasoned and swiftly grilled. Its aroma attracts the street cats. Indeed, freshness is the secret of flavor.",
        "effect": "Restores 10% of Max HP and an additional 1,200 HP to the selected character."
    },
    {
        "id": "lantern-rite-special-jewelry-soup",
        "name": "Lantern Rite Special Jewelry Soup",
        "rarity": 2,
        "type": "DEF-Boosting Dishes",
        "description": "Traditional cuisine made to celebrate Lantern Rite. Snapdragon, tofu, and lotus seeds are put into boiling water and simmered. Jewelry Soup earned its luxurious name from the look of the ingredients used, but contrary to its name, the soup is commonly prepared and served in ordinary households.",
        "effect": "Increases all party members' DEF by 126 for 300s."
    },
    {
        "id": "lantern-rite-special-lotus-seed-and-bird-egg-soup",
        "name": "Lantern Rite Special Lotus Seed and Bird Egg Soup",
        "rarity": 2,
        "type": "Adventurer's Dishes",
        "description": "Traditional cuisine made to celebrate Lantern Rite. The clear, gold colors of the egg custard have been embellished with several lotus roots. Regardless of whether it is breakfast or a post-meal snack, its superior nutritional value can greatly nourish the body.",
        "effect": "Decreases all party members' sprinting Stamina consumption by 25% for 900s."
    },
    {
        "id": "lantern-rite-special-noodles-with-mountain-delicacies",
        "name": "Lantern Rite Special Noodles with Mountain Delicacies",
        "rarity": 2,
        "type": "Adventurer's Dishes",
        "description": "Traditional cuisine made to celebrate Lantern Rite. The sauce has a rustic flavor, and there's a generous amount of it mixed in with the noodles. A humble but enduringly popular dish.",
        "effect": "Restores 60 Stamina."
    },
    {
        "id": "lantern-rite-special-triple-layered-consomme",
        "name": "Lantern Rite Special Triple-Layered Consommé",
        "rarity": 3,
        "type": "DEF-Boosting Dishes",
        "description": "Traditional cuisine made to celebrate Lantern Rite. The ham, fowl, and bamboo shoots have been sliced into threads of equal length, and they've been laid out neatly in the soup bowl after being steamed at high heat, before being covered in consommé. The layers are distinct, and the mouthfeel is salty yet fresh.",
        "effect": "Increases all party members' Shield strength by 30%."
    },
    {
        "id": "lotus-flower-crisp",
        "name": "Lotus Flower Crisp",
        "rarity": 3,
        "type": "DEF-Boosting Dishes",
        "description": "One of Liyue's traditional snacks. Sweet stuffed lotus wrapped in a crispy, deep-fried crust. Its layers of flower petals unravel perfectly in the palm of your hand.",
        "effect": "Increases all party members' DEF by 200 for 300s.",
        "recipe": [
            "4x Almond",
            "2x Flour",
            "2x Butter",
            "1x Sugar"
        ]
    },
    {
        "id": "lotus-seed-and-bird-egg-soup",
        "name": "Lotus Seed and Bird Egg Soup",
        "rarity": 2,
        "type": "Adventurer's Dishes",
        "description": "A steaming egg dish. The clear, gold colors of the egg custard have been embellished with several lotus roots. Regardless of whether it is breakfast or a post-meal snack, its superior nutritional value can greatly nourish the body.",
        "effect": "Decreases all party members' sprinting Stamina consumption by 20% for 900s.",
        "recipe": [
            "1x Lotus Head",
            "1x Bird Egg",
            "1x Suger"
        ]
    },
    {
        "id": "matsutake-meat-rolls",
        "name": "Matsutake Meat Rolls",
        "rarity": 2,
        "type": "Recovery Dishes",
        "description": "A pan-fried meat dish. Ground meat is put on the Matsutake and gently pan-fried on low heat so the Matsutake can fully take in the aromatic juice of the meat. It's a mouthwatering delicacy in all of its glory.",
        "effect": "Restores 22% of Max HP and an additional 1,200 HP to the selected character.",
        "recipe": [
            "2x Matsutake",
            "2x Raw Meat"
        ]
    },
    {
        "id": "mint-jelly",
        "name": "Mint Jelly",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "A refreshing dessert. The steps to making this are quite simple indeed, and when it slides down your throat, the faint, fresh flavor of mint will leave you feeling reinvigorated for the rest of the day.",
        "effect": "Restores 9% of Max HP and an additional 1,000 HP to the selected character.",
        "recipe": [
            "1x Mint",
            "1x Sugar"
        ]
    },
    {
        "id": "mint-salad",
        "name": "Mint Salad",
        "rarity": 2,
        "type": "ATK-Boosting Dishes",
        "description": "A fragrant salad dish. Finely chopped Jueyun Chilis blended with a sauce and mixed with Mint leaves. It looks like nothing special, but it has surprisingly potent powers of refreshment and reinvigoration. It is also the perfect palate-cleanser after a greasy, indulgent meal.",
        "effect": "Increases all party members' ATK by 81 for 300s.",
        "recipe": [
            "4x Mint",
            "1x Jueyun Chili"
        ]
    },
    {
        "id": "minty-meat-rolls",
        "name": "Minty Meat Rolls",
        "rarity": 3,
        "type": "Adventurer's Dishes",
        "description": "A sour-and-spicy dish. The marinated meat has been thinly sliced and rolled into the mint leaves, before being brushed with a sauce blend containing Jueyun Chilis. The unique mint flavor adds the finishing touch to this dish, turning it into an excellent addition to any cold platter.",
        "effect": "Decreases all party members' gliding and sprinting Stamina consumption by 20% for 900s.",
        "recipe": [
            "4x Mint",
            "4x Raw Meat",
            "1x Jueyun Chili"
        ]
    },
    {
        "id": "miso-soup",
        "name": "Miso Soup",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "A simple and unadorned soup dish. The ingredients use here are very common and it is made simply, but this small bowl of soup has the power to ensure that you shall not grow weary on your journey, even if you travel on foot.",
        "effect": "Restores 9% of Max HP to the selected character and regenerates 260 HP every 5s for 30s.",
        "recipe": [
            "1x Tofu",
            "1x Seagrass"
        ]
    },
    {
        "id": "mixed-yakisoba",
        "name": "Mixed Yakisoba",
        "rarity": 2,
        "type": "Recovery Dishes",
        "description": "One of Inazuma's common household dishes. One merely needs to stir-fry the noodles and side dishes evenly before serving, making this an easy-to-make and filling dish. It is no wonder, then, that this dish is so sought after among Inazumans.",
        "effect": "Revives a character and restores 400 HP.",
        "recipe": [
            "3x Flour",
            "2x Cabbage",
            "1x Raw Meat"
        ]
    },
    {
        "id": "mondstadt-grilled-fish",
        "name": "Mondstadt Grilled Fish",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "Fish grilled thoroughly with moderate fire, making it completely dry and crispy. The sprinkled pepper on top brings out the freshness of the fish.",
        "effect": "Revives a character and restores 100 HP.",
        "recipe": [
            "1x Fish",
            "1x Pepper"
        ]
    },
    {
        "id": "mondstadt-hash-brown",
        "name": "Mondstadt Hash Brown",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "A fried cake of mashed potatoes. A little bit of pinecone helps give it a nice crunch, and great with a bit of jam. Loved by people of all ages.",
        "effect": "Restores 32% of Max HP and an additional 1,250 HP to the selected character.",
        "recipe": [
            "2x Pinecone",
            "1x Potato",
            "1x Jam"
        ]
    },
    {
        "id": "moon-pie",
        "name": "Moon Pie",
        "rarity": 4,
        "type": "DEF-Boosting Dishes",
        "description": "A traditional staple from Mondstadt. Not only is the pickled meat within deeply flavorful, but the meringue has also maintained its sweetness and moisture through the baking process. This dish is not to be missed at any festival in Mondstadt.",
        "effect": "Increases all party members' Shield Strength by 30% and DEF by 200 for 300s.",
        "recipe": [
            "4x Raw Meat",
            "4x Egg",
            "3x Butter",
            "2x Flour"
        ]
    },
    {
        "id": "mora-meat",
        "name": "Mora Meat",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "A large hunk of minced meat packaged inside of a pastry. When you split the pastry in two, minced meat spills out. The taste of meat grease is all but gone, and the baking process has brought out the sweetness of the pastry. Such pastries are usually stamped with the word \"Mora,\" all the better to represent wealth and fortune.",
        "effect": "Revives a character and restores 100 HP.",
        "recipe": [
            "1x Raw Meat",
            "1x Flour"
        ]
    },
    {
        "id": "more-and-more",
        "name": "More-and-More",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "A snack grilled on an iron plate. Water is added to flour and stirred into a slurry, vegetables and meat are added, and the mix is grilled well on an iron plate before taking on a splash of sauce and a sprinkle of dried bonito flakes. This tastes delicious no matter how many ingredients one adds, and indeed it makes people feel like \"the more ingredients, the merrier, hence the dish's name.",
        "effect": "Increases all party members' Physical DMG by 30% for 300s.",
        "recipe": [
            "3x Fish",
            "2x Bacon",
            "1x Lavender Melon",
            "1x Flour"
        ]
    },
    {
        "id": "mushroom-pizza",
        "name": "Mushroom Pizza",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "A pizza covered in cheese and mushrooms. When still warm the cheese stretches out long, making it extremely satisfying to eat.",
        "effect": "Restores 28% of Max HP to the selected character. Regenerates 620 HP every 5s for 30s.",
        "recipe": [
            "4x Mushroom",
            "3x Flour",
            "2x Cabbage",
            "1x Cheese"
        ]
    },
    {
        "id": "noodles-with-mountain-delicacies",
        "name": "Noodles with Mountain Delicacies",
        "rarity": 2,
        "type": "Adventurer's Dishes",
        "description": "Noodles in a meat-and-vegetable sauce. The sauce has a rustic flavor, and there's a generous amount of it mixed in with the noodles. A humble but enduringly popular dish.",
        "effect": "Restores 50 Stamina.",
        "recipe": [
            "3x Mushroom",
            "2x Raw Meat",
            "2x Flour"
        ]
    },
    {
        "id": "northern-smoked-chicken",
        "name": "Northern Smoked Chicken",
        "rarity": 2,
        "type": "Adventurer's Dishes",
        "description": "Smoked fowl paired with vegetables. A staple for Northerners, often made for honored guests.",
        "effect": "Restores 50 Stamina.",
        "recipe": [
            "1x Smoked Fowl",
            "1x Onion",
            "1x Cabbage"
        ]
    },
    {
        "id": "omelette-rice",
        "name": "Omelette Rice",
        "rarity": 3,
        "type": "Adventurer's Dishes",
        "description": "A main dish wrapped up in an egg skin. The evenly beaten egg fluids are fried into half-doneness before being poured out on top of the rice, and tomato ketchup is drizzled over top afterward once it is ready to plate up. They say that this dish was derived from another region, though this version involves a more complicated cooking method.",
        "effect": "Decreases Stamina depleted by climbing and sprinting for all party members by 20% for 900s.",
        "recipe": [
            "4x Egg",
            "3x Rice",
            "2x Tomato",
            "1x Sugar"
        ]
    },
    {
        "id": "oncidium-tofu",
        "name": "Oncidium Tofu",
        "rarity": 3,
        "type": "Adventurer's Dishes",
        "description": "A dish that is a test of one's knifework. All the ingredients were sliced into ribbons in a single go, and after being washed, they were placed into the broth and cooked till they floated. The resulting flavor is light and fresh, and would not be out of place as a chef's recommendation in a Liyue restaurant.",
        "effect": "Restores 85 Stamina.",
        "recipe": [
            "4x Tofu",
            "1x Ham",
            "1x Fowl",
            "2x Bamboo Shoot"
        ]
    },
    {
        "id": "onigiri",
        "name": "Onigiri",
        "rarity": 2,
        "type": "Recovery Dishes",
        "description": "A portable dish made with rice. It is simple to make and remains delicious at room temperatures, which has made it very popular with civilians and soldiers alike.",
        "effect": "Restores 20% of Max HP to the selected character and regenerates 390 HP every 5s for 30s.",
        "recipe": [
            "2x Fish",
            "1x Rice",
            "2x Seagrass"
        ]
    },
    {
        "id": "pop-teas",
        "name": "Pop's Teas",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "Tea from Liyue. After a grueling trek around the vast region of Liyue, there's nothing more rejuvenating than a big swig of tea from Pop's Teas.",
        "effect": "Restores 14% of Max HP to the selected character and regenerates 350 HP every 5s for 30s."
    },
    {
        "id": "qingce-stir-fry",
        "name": "Qingce Stir Fry",
        "rarity": 3,
        "type": "ATK-Boosting Dishes",
        "description": "A dish cooked over a roaring fire. They say it was originally just a rustic dish that everyone in Qingce Village knew how to make. But quite unexpectedly, its crispy and spicy dishes gained the recognition of people from elsewhere, and thus began to spread throughout the Liyue region.",
        "effect": "Increases all party members' ATK by 194 for 300s.",
        "recipe": [
            "3x Mushroom",
            "2x Lotus Head",
            "1x Jueyun Chili",
            "1x Cabbage"
        ]

    },
    {
        "id": "radish-veggie-soup",
        "name": "Radish Veggie Soup",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "Radish-based vegetable soup. Its flavor is delicately between tart and sweet. With luscious radish, it's a well-balanced dish.",
        "effect": "Restores 9% of Max HP to the selected character and regenerates 260 HP every 5s for 30s.",
        "recipe": [
            "1x Radish",
            "1x Mint"
        ]
    },
    {
        "id": "radish-and-fish-stew",
        "name": "Radish and Fish Stew",
        "rarity": 2,
        "type": "ATK-Boosting Dishes",
        "description": "A meat and vegetable dish. The de-skinned radishes have gone into the pot first to cook before large hunks of fish and seasonings are added in. The whole combination is then stewed on a low flame. The large servings of food — best served with rice — give everyone present a feeling of satisfaction.",
        "effect": "Increases all party members' CRIT Rate by 9% for 300s.",
        "recipe": [
            "2x Fish",
            "2x Radish",
            "1x Salt"
        ]
    },
    {
        "id": "rice-buns",
        "name": "Rice Buns",
        "rarity": 1,
        "type": "Recovery Dishes",
        "description": "Soft and fluffy food. The rice and horsetail have been ground into flour and kneaded into dough before being put in a steaming basket. It can be eaten as-is or with vegetable stuffing. Portable and filling, it is a very popular dish in the Liyue region.",
        "effect": "Restores 9% of Max HP and an additional 1,000 HP to the selected character.",
        "recipe": [
            "1x Rice",
            "1x Horsetail"
        ]
    },
    {
        "id": "rice-cake-soup",
        "name": "Rice Cake Soup",
        "rarity": 3,
        "type": "DEF-Boosting Dishes",
        "description": "Commonly-seen city cuisine. The ingredients have gorged themselves on the soup, making them most enticing indeed. They say that in the first, this dish only had a scant few ingredients, but more were added as time passed, resulting in its present form.",
        "effect": "Increases all party members' DEF by 200 for 300s.",
        "recipe": [
            "2x Sausage",
            "1x Tofu",
            "1x Fish",
            "1x Lavender Melon"
        ]
    },
    {
        "id": "rice-pudding",
        "name": "Rice Pudding",
        "rarity": 3,
        "type": "Adventurer's Dishes",
        "description": "A dessert made from rice. After cooking the rice beforehand, it is placed into a pot together with the other ingredients, stirred evenly, and steamed. The mouthfeel is fragrant and soft, a perfect denouement to any meal.",
        "effect": "Restores 85 Stamina.",
        "recipe": [
            "3x Bird Egg",
            "2x Rice",
            "2x Milk",
            "2x Sugar"
        ]
    },
    {
        "id": "sakura-mochi",
        "name": "Sakura Mochi",
        "rarity": 3,
        "type": "Recovery Dishes",
        "description": "A delicate and elegant snack. The dark green leaf adds complexity to the overall warm color palette. Just looking at it gives you a sense of its quiet beauty. 'Tis a shame that its lovely flavor is like a blooming flower in transience — yet do not let that dissuade you from taking a bite.",
        "effect": "Revives a character and restores 1,200 HP.",
        "recipe": [
            "4x Rice",
            "2x Sugar",
            "1x Sakura Bloom"
        ]
    },
    {
        "id": "sakura-shrimp-crackers",
        "name": "Sakura Shrimp Crackers",
        "rarity": 3,
        "type": "DEF-Boosting Dishes",
        "description": "Crispy, crunchy crackers. Potatoes are ground into flour and added to Shrimp and Sakura Blooms before being baked in an oven. It possesses a lovely flavor profile for a snack and is beloved by people of all ages, traits that have made it a popular choice of gift.",
        "effect": "Increases all party members' HP by 22% for 300s.",
        "recipe": [
            "3x Shrimp Meat",
            "3x Potato",
            "2x Sakura Bloom"
        ]
    },
    {
        "id": "sakura-tempura",
        "name": "Sakura Tempura",
        "rarity": 3,
        "type": "DEF-Boosting Dishes",
        "description": "A dish deep-fried in oil. Incorporate the marinated sakura blossom petals into the batter before giving the fresh shrimp and vegetables an even coating, frying, and then draining the oil. This all sounds simple enough, but good tempura making is not something achieved in a mere day.",
        "effect": "Increases all party members' Shield strength by 25% for 300s.",
        "recipe": [
            "4x Shrimp Meat",
            "2x Lavender Melon",
            "2x Sakura Bloom",
            "1x Flour"
        ]
    }
]